Repository: agama-project/agama
Catalog: web/po/*.po
Languages: cs, es, ja, nb_no

source: Please, be aware that a user must be defined before installing the system to be able to log into it.
cs: Pozor, před instalací systému musí být definován uživatel, aby se pak do systému dalo přihlásit.
es: Tenga en cuenta que se debe definir un usuario antes de instalar el sistema para poder iniciar sesión en él.
ja: なお、システムにログインできるようにするには、インストールの前にユーザを設定しておかなければならないことに注意してください。
nb_no: Vennligst, vær oppmerksom på at en bruker må være definert før installasjon av systemet for å kunne logge inn.

source: Full name
cs: Celé jméno
es: Nombre completo
ja: フルネーム
nb_no: Fullt navn

source: Username
cs: Uživatelské jméno
es: Nombre de usuario
ja: ユーザ名
nb_no: Brukernavn

source: Discard
cs: Vyřadit
es: Descartar
ja: 破棄
nb_no: Forkast

source: First user
cs: První uživatel
ja: 最初のユーザ
nb_no: Første bruker

source: Username suggestion dropdown
cs: Rozbalovací nabídka uživatelských jmen
es: Menú desplegable de sugerencias de nombre de usuario
ja: ユーザ名の提案ドロップダウン
nb_no: Rullegardinmeny for forslag til brukernavn

source: Use suggested username
cs: Použijte navrhované uživatelské jméno
es: Usar nombre de usuario sugerido
ja: 提案されたユーザ名を使用する
nb_no: Bruk foreslått brukernavn

source: All fields are required
cs: Všechna pole jsou povinná
ja: 全ての項目に入力する必要があります
nb_no: Alle feltene er påkrevd

source: Create user
cs: Vytvořit uživatele
ja: ユーザの作成
nb_no: Opprett bruker

source: Edit user
cs: Upravit uživatele
ja: ユーザの編集
nb_no: Rediger bruker

source: User full name
cs: Celé jméno uživatele
es: Nombre completo del usuario
ja: ユーザのフルネーム
nb_no: Brukerens fulle navn

source: Edit password too
cs: Upravit také heslo
es: Editar contraseña también
ja: パスワードも編集する
nb_no: Rediger passord også

source: user autologin
cs: automatické přihlášení uživatele
es: inicio de sesión automático del usuario
ja: ユーザの自動ログイン
nb_no: bruker automatisk innlogging

source: Auto-login
cs: Automatické přihlášení
es: Inicio de sesión automático
ja: 自動ログイン
nb_no: Automatisk-innlogging

source: No root authentication method defined yet.
cs: Zatím není definována žádná metoda ověřování superuživatele root.
es: Aún no se ha definido ningún método de autenticación de root.
ja: まだ root 認証方式を設定していません。
nb_no: Ingen root autentisering metode definert ennå.

source: Please, define at least one authentication method for logging into the system as root.
cs: Definujte alespoň jednu metodu ověřování pro přihlášení do systému jako root.
es: Por favor, defina al menos un método de autenticación para iniciar sesión en el sistema como root.
ja: 少なくとも 1 つ以上の root ログイン時の認証方式を設定してください。
nb_no: Vennligst, definer minst en autentiseringsmetode for å logge på systemet som root.

source: Method
cs: Metoda
es: Método
ja: 方式
nb_no: Metode

source: Already set
cs: Již nastaveno
es: Ya establecida
ja: 設定済み
nb_no: Allerede satt

source: Not set
cs: Nenastaveno
es: No establecida
ja: 未設定
nb_no: Ikke satt

source: SSH Key
cs: Klíč SSH
es: Clave SSH
ja: SSH 鍵
nb_no: SSH Nøkkel

source: Set
cs: Nastavit
es: Establecer
ja: 設定
nb_no: Sett

source: Root authentication
cs: Ověření superuživatele root
es: Autenticación de root
ja: root の認証
nb_no: Root autentisering

source: Set a password
cs: Nastavte heslo
es: Establecer una contraseña
ja: パスワードの設定
nb_no: Sett et passord

source: Upload a SSH Public Key
cs: Nahrátí veřejného klíče SSH
es: Cargar una clave pública SSH
ja: SSH 公開鍵のアップロード
nb_no: Last opp en offentlig SSH Nøkkel

source: Change the root password
cs: Změna hesla roota
es: Cambiar la contraseña de root
ja: root のパスワードを変更
nb_no: Endre root passordet

source: Set a root password
cs: Nastavte heslo roota
es: Establecer una contraseña de root
ja: root のパスワードを設定
nb_no: Sett et root passord

source: Edit the SSH Public Key for root
cs: Úprava veřejného klíče SSH pro uživatele root
es: Editar la clave pública SSH para root
ja: root に対する SSH 公開鍵の編集
nb_no: Endre den offentlige SSH Nøkkelen for root

source: Add a SSH Public Key for root
cs: Přidat veřejný klíč SSH pro uživatele root
es: Añadir una clave pública SSH para root
ja: root に対する SSH 公開鍵の追加
nb_no: Legg til en offentlig SSH Nøkkel for root

source: Root password
cs: Heslo roota
es: Contraseña de root
ja: root のパスワード
nb_no: Root passord

source: Set root SSH public key
cs: Nastavte veřejný klíč SSH pro roota
es: Establecer clave pública SSH de root
ja: root の SSH 公開鍵の設定
nb_no: Sett root offentlig SSH Nøkkel

source: Root SSH public key
cs: Veřejný klíč SSH pro roota
es: Clave pública SSH de root
ja: root の SSH 公開鍵
nb_no: Root offentlig SSH nøkkel

source: Upload, paste, or drop an SSH public key
cs: Nahrání, vložení nebo přetažení veřejného klíče SSH
es: Cargar, pegar o arrastrar una clave pública SSH
ja: SSH 公開鍵のアップロード／貼り付け／ドロップ
nb_no: Last opp, lim inn, eller slipp en offentlig SSH nøkkel

source: Upload
cs: Nahrát
es: Cargar
ja: アップロード
nb_no: Last opp

source: Clear
cs: Smazat
es: Limpiar
ja: 消去
nb_no: Tøm

source: Cannot format all selected devices
cs: Nelze formátovat všechna vybraná zařízení

source: About Agama
es: Acerca de Agama

source: Agama is an experimental installer for (open)SUSE systems. It is still under development so, please, do not use it in production environments. If you want to give it a try, we recommend using a virtual machine to prevent any possible data loss.
es: Agama es un instalador experimental para sistemas (open)SUSE. Aún está en desarrollo, por lo que no lo utilice en entornos de producción. Si quiere probarlo, le recomendamos utilizar una máquina virtual para evitar cualquier posible pérdida de datos.

source: For more information, please visit the project's repository at %s.
es: Para obtener más información, visite el repositorio del proyecto en %s.

source: Reading file...
es: Leyendo el archivo...

source: Cannot read the file
es: No se puede leer el archivo

source: Collecting logs...
es: Recolectando registros...

source: The browser will run the logs download as soon as they are ready. Please, be patient.
es: El navegador ejecutará la descarga de registros tan pronto como estén listos. Por favor tenga paciencia.

source: Something went wrong while collecting logs. Please, try again.
es: Algo salió mal al recolectar los registros. Inténtelo de nuevo.

source: IP prefix or netmask
es: Prefijo IP o máscara de red

source: Register %s
es: Registro %s

source: Registration code
es: Código de registro

source: Email
es: Correo electrónico

source: Loading available products, please wait...
es: Cargando productos disponibles, por favor espere...

source: Given encryption password didn't work
es: La contraseña de cifrado dada no funcionó

source: Waiting for progress report
es: Esperando el informe de progreso

source: There is %d destructive action planned
es: Hay %d acción destructiva planeada

source: Space action selector for %s
es: Selector de acción en el espacio para %s

source: Allow resize
es: Permitir cambio de tamaño

source: Do not modify
es: No modificar

source: Shrinkable
es: Se puede reducir

source: Please, try to read the zFCP devices again.
es: Por favor, intente leer los dispositivos zFCP nuevamente.

source: Automatic LUN scan is [enabled]. Activating a controller which is running in NPIV mode will automatically configures all its LUNs.
es: La exploración automática de LUN está [habilitada]. La activación de un controlador que se ejecuta en modo NPIV configurará automáticamente todos sus LUN.

source: Automatic LUN scan is [disabled]. LUNs have to be manually configured after activating a controller.
es: La exploración automática de LUN está [deshabilitada]. Los LUN deben configurarse manualmente después de activar un controlador.

source: Activate a zFCP disk
es: Activar un disco zFCP

source: KiB
es: KB

source: MiB
es: MB

source: GiB
es: GB

source: TiB
es: TB

source: PiB
es: PB
