Repository: agama-project/agama
Catalog: web/po/*.po
Languages: cs, es, ja, nb_no

source: Configuring the product, please wait ...
cs: Konfigurace produktu, počkejte prosím...
ja: 製品を設定しています。しばらくお待ちください...
nb_no: Konfigurerer produktet, vennligst vent...

source: Question
cs: Dotaz
es: Pregunta
ja: 質問
nb_no: Spørsmål

source: The encryption password did not work
cs: Zadané šifrovací heslo nefungovalo
ja: 暗号化パスワードが正しくありません

source: Encrypted Device
cs: Šifrované zařízení
es: Dispositivo cifrado
ja: 暗号化されたデバイス
nb_no: Kryptert Enhet

source: Encryption Password
cs: Heslo pro šifrování
es: Contraseña de cifrado
ja: 暗号化パスワード
nb_no: Krypteringspassord

source: Password Required
cs: Vyžadováno heslo
ja: パスワードが必要です

source: No additional software was selected.
cs: Nebyl vybrán žádný další software.
es: No se seleccionó software adicional.
ja: 追加のソフトウエアは何も選択していません。
nb_no: Ingen ytterligere programvare ble valgt.

source: The following software patterns are selected for installation:
cs: Pro instalaci jsou vybrány tyto softwarové vzory:
es: Los siguientes patrones de software están seleccionados para la instalación:
ja: 下記のソフトウエアパターンをインストールするよう選択しています:
nb_no: Følgende programvare mønstre er valgt for installasjon:

source: Selected patterns
cs: Vybrané vzory
ja: パターンの選択
nb_no: Valgte mønstre

source: Change selection
cs: Změnit výběr
es: Cambiar selección
ja: 選択の変更
nb_no: Endre valg

source: This product does not allow to select software patterns during installation. However, you can add additional software once the installation is finished.
cs: Tento produkt neumožňuje výběr softwarových vzorů během instalace. Po dokončení instalace však můžete přidat další software.
ja: この製品はインストール時のパターン選択を許可していません。なお、インストール完了後に必要なソフトウエアを追加できます。

source: None of the patterns match the filter.
cs: Žádný ze vzorů neodpovídá filtru.
ja: フィルタに該当するパターンがありません。
nb_no: Ingen av mønstrene passer sammen med filteret.

source: auto selected
cs: automaticky vybráno
es: seleccionado automáticamente
ja: 自動選択済み
nb_no: Automatisk valgt

source: Unselect
cs: Zrušit výběr
ja: 未選択

source: Software selection
cs: Výběr softwaru
es: Selección de software
ja: ソフトウエア選択
nb_no: Valg av programvare

source: Filter by pattern title or description
cs: Filtrování podle názvu nebo popisu vzoru
ja: パターンタイトルまたは説明でフィルタ
nb_no: Filtrer etter mønstertittel eller beskrivelse

source: Close
cs: Zavřít
es: Cerrar
ja: 閉じる
nb_no: Lukk

source: Installation will take %s.
cs: Instalace bude trvat %s.
ja: インストールを行うには %s が必要です。
nb_no: Installasjonen vil ta %s.

source: This space includes the base system and the selected software patterns, if any.
cs: Tento prostor zahrnuje základní systém a vybrané softwarové vzory, pokud existují.
ja: この容量にはシステムの基本部分のほか、選択したソフトウエアパターンが含まれます。

source: Change boot options
cs: Změna možností spouštění systému
es: Cambiar opciones de arranque
ja: 起動オプションの変更
nb_no: Endre oppstartalternativer

source: Installation will not configure partitions for booting.
cs: Instalace nenakonfiguruje oddíly pro zavádění systému.
es: La instalación no configurará particiones para el arranque.
ja: インストール作業では起動用のパーティションを設定しません。
nb_no: Installasjonen vil ikke konfigurere partisjoner for oppstart.

source: Installation will configure partitions for booting at the installation disk.
cs: Instalace nakonfiguruje oddíly pro zavádění na instalačním disku.
es: La instalación configurará las particiones para arrancar en el disco de instalación.
ja: インストール作業でインストール先のディスクに起動用のパーティションを設定します。
nb_no: Installasjonen vil konfigurere partisjoner for oppstart på installasjonsdisken.

source: Installation will configure partitions for booting at %s.
cs: Instalace nakonfiguruje oddíly pro zavádění v %s.
es: La instalación configurará las particiones para arrancar en %s.
ja: インストール作業で %s に起動用のパーティションを設定します。
nb_no: Installasjonen vil konfigurere partisjoner for oppstart på %s.

source: To ensure the new system is able to boot, the installer may need to create or configure some partitions in the appropriate disk.
cs: Aby bylo možné nový systém spustit, může být nutné, aby instalační program vytvořil nebo nakonfiguroval některé oddíly na příslušném disku.
es: Para garantizar que el nuevo sistema pueda iniciarse, es posible que el instalador deba crear o configurar algunas particiones en el disco apropiado.
ja: システムを起動できるようにするため、インストーラはディスク内にいくつかの追加パーティションを作成もしくは設定する必要があるかもしれません。
nb_no: For å sikre at det nye systemet er i stand til oppstart, så må kanskje installasjonsprogrammet opprette eller konfigurere noen partisjoner på riktig disk.

source: Partitions to boot will be allocated at the installation disk.
cs: Oddíly pro zavádění budou přiděleny na instalačním disku.
es: Las particiones para arrancar se asignarán en el disco de instalación.
ja: インストール先のディスク内に起動用のパーティションを割り当てます。
nb_no: Partisjoner for oppstart vil bli tildelt på installasjonsdisken.

source: Partitions to boot will be allocated at the installation disk (%s).
cs: Oddíly pro zavádění budou přiděleny na instalačním disku (%s).
es: Las particiones para arrancar se asignarán en el disco de instalación (%s).
ja: インストール先のディスク (%s) 内に起動用のパーティションを割り当てます。
nb_no: Partisjoner for oppstart vil bli tildelt på installasjonsdisken (%s).

source: Select booting partition
cs: Výběr zaváděcího oddílu
ja: 起動パーティションの選択
nb_no: Velg oppstartspartisjon

source: Automatic
cs: Automatický
es: Automático
ja: 自動
nb_no: Automatisk

source: Select a disk
cs: Výběr disku
es: Seleccionar un disco
ja: ディスクの選択
nb_no: Velg en disk

source: Partitions to boot will be allocated at the following device.
cs: Oddíly pro zavádění budou přiděleny na tomto zařízení.
es: Las particiones para arrancar se asignarán en el siguiente dispositivo.
ja: 下記のデバイス内に起動用パーティションを割り当てます。
nb_no: Partisjoner for oppstart vil bli tildelt på følgende enhet.

source: Choose a disk for placing the boot loader
cs: Výběr disku pro umístění zavaděče
es: Escoger un disco para colocar el cargador de arranque
ja: ブートローダを配置するディスクを選択してください
nb_no: Velg en disk for å plassere oppstartslasteren

source: Do not configure
cs: Nekonfigurujte
es: No configurar
ja: 設定しない
nb_no: Ikke konfigurer

source: No partitions will be automatically configured for booting. Use with caution.
cs: Žádné oddíly nebudou automaticky konfigurovány pro zavádění systému. Používejte opatrně.
es: No se configurarán particiones automáticamente para el arranque. Úselo con precaución.
ja: 起動用のパーティションを自動設定しません。注意してお使いください。
nb_no: Ingen partisjoner vil bli automatisk konfigurert for oppstart. Bruk med varsomhet.

source: The file systems will be allocated by default as [new partitions in the selected device].
cs: Souborové systémy budou ve výchozím nastavení přiděleny jako [nové oddíly ve vybraném zařízení].
es: Los sistemas de archivos se asignarán de forma predeterminada como [nuevas particiones en el dispositivo seleccionado].
ja: 既定では、ファイルシステムは [選択したデバイス内の新規パーティション] として割り当てます。
nb_no: Filsystemene vil bli tildelt som standard som [nye partisjoner i den valgte enheten].

source: The file systems will be allocated by default as [logical volumes of a new LVM Volume Group]. The corresponding physical volumes will be created on demand as new partitions at the selected devices.
cs: Souborové systémy budou ve výchozím nastavení přiděleny jako [logické svazky nové skupiny svazků LVM]. Odpovídající fyzické svazky budou na vyžádání vytvořeny jako nové oddíly na vybraných zařízeních.
es: Los sistemas de archivos se asignarán de forma predeterminada como [volúmenes lógicos de un nuevo grupo de volúmenes LVM]. Los volúmenes físicos correspondientes se crearán según demanda como nuevas particiones en los dispositivos seleccionados.
ja: 既定では、ファイルシステムは [新規 LVM ボリュームグループの論理ボリューム] として割り当てます。対応する物理ボリュームは、必要に応じて選択したデバイス内の新規パーティションとして作成します。
nb_no: Filsystemene vil bli tildelt som standard som [logiske volum av en ny LVM Volumgruppe]. Den korresponderende fysiske volumet vil bli opprettet på forespørsel som nye partisjoner på de valgte enhetene.

source: Select installation device
cs: Výběr instalačního zařízení
ja: インストール先デバイスの選択
nb_no: Velg installasjonsenhet

source: Install new system on
cs: Instalace nového systému na
ja: 新しいシステムのインストール先
nb_no: Installer nytt system på

source: An existing disk
cs: Existující disk
ja: 既存のディスク
nb_no: En eksisterende disk

source: A new LVM Volume Group
cs: Nová skupina svazků LVM
ja: 新規 LVM ボリュームグループ
nb_no: En ny LVM volumgruppe

source: Device selector for target disk
cs: Výběr zařízení pro cílový disk
es: Selector de dispositivo para disco de destino
ja: 宛先のディスクデバイス選択
nb_no: Enhetsvelger for måldisk

source: Device selector for new LVM volume group
cs: Výběr zařízení pro novou skupinu svazků LVM
es: Selector de dispositivo para nuevo grupo de volúmenes LVM
ja: 新規 LVM ボリュームグループのデバイス選択
nb_no: Enhetsvelger for nye LVM volumgruppe

source: Prepare more devices by configuring advanced
cs: Připravte další zařízení pomocí pokročilé konfigurace
es: Preparar más dispositivos configurando de forma avanzada
ja: 高度な設定でさらにデバイスを検出
nb_no: Forbered flere enheter for avansert konfigurering

source: storage techs
cs: technologie úložiště
ja: ストレージ技術
nb_no: lagringsteknologier

source: Multipath
cs: Vícecestný
es: Ruta múltiple
ja: マルチパス
nb_no: Flerveis

source: Software %s
ja: ソフトウエア %s
nb_no: Programvare %s

source: SD Card
cs: Karta SD
es: Tarjeta SD
ja: SD カード
nb_no: SD Kort

source: %s disk
es: disco %s
ja: %s ディスク

source: Disk
es: Disco
ja: ディスク

source: Members: %s
cs: Členové: %s
es: Miembros: %s
ja: メンバー: %s
nb_no: Medlemmer %s

source: Devices: %s
cs: Zařízení: %s
es: Dispositivos: %s
ja: デバイス: %s
nb_no: Enheter: %s

source: Wires: %s
cs: Kabely: %s
ja: 接続: %s
nb_no: Kabler: %s

source: %s with %d partitions
cs: %s s %d oddíly
es: %s con %d particiones
ja: %s (%d 個のパーティション)
nb_no: %s med %d partisjoner

source: No content found
cs: Nebyl nalezen žádný obsah
es: No se encontró contenido
ja: 内容が見つかりませんでした
nb_no: Ingen innhold funnet

source: Device
cs: Zařízení
es: Dispositivo
ja: デバイス
nb_no: Enhet

source: Details
cs: Podrobnosti
es: Detalles
ja: 詳細
nb_no: Detaljer

source: Size
cs: Velikost
es: Tamaño
ja: サイズ
nb_no: Størrelse

source: Manage and format
cs: Správa a formátování
es: Administrar y formatear
ja: 管理とフォーマット
nb_no: Behandle og formater

source: Activate disks
cs: Aktivace disků
es: Activar discos
ja: ディスクの有効化
nb_no: Aktivere disker

source: Connect to iSCSI targets
cs: Připojení k cílům iSCSI
es: Conectar a objetivos iSCSI
ja: iSCSI ターゲットへの接続
nb_no: Koble til iSCSI mål

source: disabled
cs: odpojeno
es: desactivado
ja: 無効
nb_no: deaktivert

source: enabled
cs: zapojeno
es: activado
ja: 有効
nb_no: aktivert

source: using TPM unlocking
cs: odemykání čipem TPM
es: usando el desbloqueo TPM
ja: TPM 解錠を使用
nb_no: ved hjelp av TPM opplåsing

source: Enable
cs: Zapojit
ja: 有効
nb_no: Aktiver

source: Modify
cs: Upravit
ja: 修正
nb_no: Modifiser

source: Encryption
cs: Šifrování
es: Cifrado
ja: 暗号化
nb_no: Kryptering

source: Protection for the information stored at the device, including data, programs, and system files.
cs: Ochrana informací uložených v zařízení, včetně dat, programů a systémových souborů.
ja: データやプログラム、システムファイルを含むデバイス内の情報を保護する仕組みです。
nb_no: Beskyttelse for informasjonen lagret på enheten, inkludert data, programmer, og systemfiler.

source: Use the Trusted Platform Module (TPM) to decrypt automatically on each boot
cs: Použití modulu TPM (Trusted Platform Module) k automatickému dešifrování při každém spuštění systému
es: Utilizar Trusted Platform Module(TPM) para descifrar automáticamente en cada arranque
ja: 毎回の起動時に Trusted Platform Module (TPM) を利用して自動的に暗号化解除します
nb_no: Bruk Trusted Platform Module (TPM) for å dekryptere automatisk ved hver oppstart

source: The password will not be needed to boot and access the data if the TPM can verify the integrity of the system. TPM sealing requires the new system to be booted directly on its first run.
cs: Dokáže-li čip TPM ověřit integritu systému, nebude heslo pro spuštění systému a přístup k datům potřebné. Zapečetění TPM vyžaduje, aby byl nový systém spuštěn hned při prvním použití.
es: La contraseña no será necesaria para iniciar y acceder a los datos si TPM puede verificar la integridad del sistema. El sellado TPM requiere que el nuevo sistema se inicie directamente en su primera ejecución.
ja: TPM 側でシステムの一貫性検証が成功すると、起動とデータへのアクセス処理に際してパスワードが不要になります。 TPM シーリングを使用するには、新しいシステムの初回起動時に直接起動を行う必要があります。
nb_no: Passordet vil ikke være nødvendig for oppstart og for tilgang til data hvis TPM kan verifisere integriteten til systemet. TPM forsegling krever at det nye systemet startes opp direkte ved første oppstart.

source: Full Disk Encryption (FDE) allows to protect the information stored at the device, including data, programs, and system files.
cs: Šifrování celého disku (FDE) umožňuje chránit informace uložené v zařízení, včetně dat, programů a systémových souborů.
es: Full Disk Encryption (FDE) permite proteger la información almacenada en el dispositivo, incluidos datos, programas y archivos del sistema.
ja: 完全ディスク暗号化 (Full Disk Encryption; FDE) を使用することで、データやプログラム、システムファイルを含むデバイス内の情報保護を行うことができます。
nb_no: Full Disk Kryptering (FDE) tillater å beskytte informasjonen på lagret enhet, inkludert data, programmer, og systemfiler.

source: Encrypt the system
cs: Šifrování systému
es: Cifrar el sistema
ja: システムの暗号化
nb_no: Krypter systemet

source: File systems created as new partitions at %s
cs: Souborové systémy vytvořené jako nové oddíly v %s
ja: %s に新規のパーティションを作成し、そこにファイルシステムを作成
nb_no: Filsystemer opprettes som nye partisjoner på %s

source: File systems created at a new LVM volume group
cs: Souborové systémy vytvořené v nové skupině svazků LVM
ja: 新規 LVM ボリュームグループにファイルシステムを作成
nb_no: Filsystemer opprettet i en ny LVM volumgruppe

source: File systems created at a new LVM volume group on %s
cs: Souborové systémy vytvořené v nové skupině svazků LVM na %s
ja: %s 内の新規 LVM ボリュームグループにファイルシステムを作成
nb_no: Filsystemer opprettet i en ny LVM volumgruppe på %s

source: Main disk or LVM Volume Group for installation.
cs: Hlavní disk nebo skupina svazků LVM pro instalaci.
ja: インストール先のメインディスクもしくは LVM ボリュームグループを選択してください。
nb_no: Hoveddisken eller LVM Volumgruppe for installasjon.

source: Installation device
cs: Instalační zařízení
es: Dispositivo de instalación
ja: インストール先のデバイス
nb_no: Installasjons enhet

source: Maximum must be greater than minimum
cs: Maximum musí být větší než minimum
es: El máximo debe ser mayor que el mínimo
ja: 最大サイズは最小サイズより大きくなければなりません
nb_no: Maksimum må være større enn minimum

source: at least %s
cs: alespoň %s
es: al menos %s
ja: 少なくとも %s
nb_no: minst %s

source: Transactional Btrfs root volume (%s)
cs: Transakční kořenový svazek Btrfs (%s)
es: Volumen raíz transaccional de Btrfs (%s)
ja: トランザクション型の btrfs ルートボリューム (%s)
nb_no: Transaksjonell Btrfs root volum (%s)

source: Transactional Btrfs root partition (%s)
cs: Transakční kořenový oddíl Btrfs (%s)
es: Partición raíz transaccional Btrfs (%s)
ja: トランザクション型の btrfs ルートパーティション (%s)
nb_no: Transaksjonell Btrfs root partisjon (%s)

source: Btrfs root volume with snapshots (%s)
cs: Kořenový svazek Btrfs se snímky (%s)
es: Volumen raíz Btrfs con instantáneas (%s)
ja: スナップショット有りの btrfs ルートボリューム (%s)
nb_no: Btrfs root volum med øyeblikksbilder (%s)

source: Btrfs root partition with snapshots (%s)
cs: Kořenový oddíl Btrfs se snímky (%s)
es: Partición raíz Btrfs con instantáneas (%s)
ja: スナップショット有りの btrfs ルートパーティション (%s)
nb_no: Btrfs root partisjon med øyeblikksbilder (%s)

source: Mount %1$s at %2$s (%3$s)
cs: Připojit %1$s at %2$s (%3$s)
es: Montar %1$s en %2$s (%3$s)
ja: %1$s を %2$s にマウント (%3$s)
nb_no: Monter %1$s på %2$s (%3$s)

source: Swap at %1$s (%2$s)
cs: Přepnout na %1$s (%2$s)
es: Intercambiar en %1$s (%2$s)
ja: %1$s にスワップを配置 (%2$s)
nb_no: Swap på %1$s (%2$s)

source: Swap volume (%s)
cs: Přepnout svazek (%s)
es: Volumen de intercambio (%s)
ja: スワップボリューム (%s)
nb_no: Swap volum (%s)

source: Swap partition (%s)
cs: Přepnout oddíl (%s)
es: Partición de intercambio (%s)
ja: スワップパーティション (%s)
nb_no: Swap partisjon (%s)

source: %1$s root at %2$s (%3$s)
cs: %1$s kořen na %2$s (%3$s)
es: %1$s raíz en %2$s (%3$s)
ja: %2$s (%3$s) に %1$s ルートを配置
nb_no: %1$s root på %2$s (%3$s)

source: %1$s root volume (%2$s)
cs: %1$s kořenový svazek (%2$s)
es: %1$s volumen raíz (%2$s)
ja: %1$s ルートボリューム (%2$s)
nb_no: %1$s root volum (%2$s)

source: %1$s root partition (%2$s)
cs: %1$s kořenový oddíl (%2$s)
es: %1$s partición raíz (%2$s)
ja: %1$s ルートパーティション (%2$s)
nb_no: %1$s root partisjon (%2$s)

source: %1$s %2$s at %3$s (%4$s)
cs: %1$s %2$s na %3$s (%4$s)
es: %1$s %2$s en %3$s (%4$s)
ja: %3$s (%4$s) に %1$s %2$s を配置
nb_no: %1$s %2$s på %3$s (%4$s)

source: %1$s %2$s volume (%3$s)
cs: %1$s %2$s svazek (%3$s)
es: %1$s %2$s volumen (%3$s)
ja: %1$s %2$s ボリューム (%3$s)
nb_no: %1$s %2$s volum (%3$s)

source: %1$s %2$s partition (%3$s)
cs: %1$s %2$s oddíl (%3$s)
es: %1$s partición %2$s (%3$s)
ja: %1$s %2$s パーティション (%3$s)
nb_no: %1$s %2$s partisjon (%3$s)

source: Do not configure partitions for booting
cs: Nekonfigurujte oddíly pro zavádění systému
es: No configurar particiones para el arranque
ja: 起動用のパーティションを設定しない
nb_no: Konfigurer ikke partisjoner for oppstart

source: Boot partitions at installation disk
cs: Oddíly zavádějící systém na instalačním disku
es: Particiones de arranque en el disco de instalación
ja: インストール先のディスクに起動用のパーティションを設定する
nb_no: Oppstartspartisjoner på installasjonsdisk

source: Boot partitions at %s
cs: Zaváděcí oddíly na %s
es: Arrancar particiones en %s
ja: %s に起動用のパーティションを設定する
nb_no: Oppstartspartisjoner på %s

source: These limits are affected by:
cs: Tyto limity jsou ovlivněny (čím):
es: Estos límites se ven afectados por:
ja: これらの制限は下記による影響を受けます:
nb_no: Disse grensene er påvirket av:

source: The configuration of snapshots
cs: Konfigurace snímků
es: La configuración de instantáneas
ja: スナップショットの設定
nb_no: Konfigurasjonen av øyeblikksbilder

source: Presence of other volumes (%s)
cs: Přítomnost dalších svazků (%s)
es: Presencia de otros volúmenes (%s)
ja: その他のボリューム (%s) の存在
nb_no: Tilstedeværelse av andre volumer (%s)

source: The amount of RAM in the system
cs: Množství paměti RAM v systému
es: La cantidad de memoria RAM en el sistema
ja: システムに搭載された RAM の量
nb_no: Mengden RAM i systemet

source: auto
es: automático
ja: 自動
nb_no: automatisk

source: Reused %s
cs: Opětovné použití %s
es: Reutilizado %s
ja: %s の再利用
nb_no: Gjenbrukt %s

source: Transactional Btrfs
cs: Transakční systém Btrfs
es: Transaccional Brtfs
ja: トランザクション型 btrfs
nb_no: Transaksjonell Btrfs

source: Btrfs with snapshots
cs: Btrfs se snímky
es: Brtfs con instantáneas
ja: スナップショット有りの btrfs
nb_no: Btrfs med øyeblikksbilder

source: Partition at %s
cs: Oddíl na %s
es: Partición en %s
ja: %s に存在するパーティション
nb_no: Partisjon på %s

source: Separate LVM at %s
cs: Oddělené LVM na %s
es: Separar LVM en %s
ja: %s に存在する個別の LVM
nb_no: Seperat LVM på %s

source: Logical volume at system LVM
cs: Logický svazek na systému LVM
es: Volumen lógico en el sistema LVM
ja: システム LVM 内の論理ボリューム
nb_no: Logiske volum på system LVM

source: Partition at installation disk
cs: Oddíl na instalačním disku
es: Partición en el disco de instalación
ja: インストール先のディスクのパーティション
nb_no: Partisjon på installasjonsdisk

source: Reset location
cs: Výmaz umístění
es: Reiniciar localización
ja: 場所のリセット
nb_no: Tilbakestill plassering

source: Change location
cs: Změna umístění
es: Cambiar ubicación
ja: 場所の変更
nb_no: Endre plassering

source: Delete
cs: Smazat
es: Eliminar
ja: 削除
nb_no: Slett

source: Mount point
cs: Přípojný bod
es: Punto de montaje
ja: マウントポイント
nb_no: Monteringspunkt

source: Location
cs: Umístění
es: Ubicación
ja: 場所
nb_no: Plassering

source: Table with mount points
cs: Tabulka s přípojnými body
es: Tabla con puntos de montaje
ja: マウントポイントの一覧
nb_no: Tabell med monteringspunkter

source: Add file system
cs: Přidat souborový systém
es: Agregar sistema de archivos
ja: ファイルシステムの追加
nb_no: Legg til filsystem

source: Other
cs: Ostatní/jiné
es: Otro
ja: その他
nb_no: Andre

source: Reset to defaults
cs: Návrat k standardním hodnotám
es: Restablecer los valores predeterminados
ja: 既定値に戻す
nb_no: Tilbakestill til standard

source: Partitions and file systems
cs: Oddíly a souborové systémy
es: Particiones y sistemas de archivos
ja: パーティションとファイルシステム
nb_no: Partisjoner og filsystemer

source: Structure of the new system, including any additional partition needed for booting
cs: Struktura nového systému, včetně případných dalších oddílů potřebných pro zavádění systému
ja: 起動時に必要な追加パーティションを含む、新しいシステムの構造設定です
nb_no: Strukturen av det nye systemet, inkludert eventuell partisjon som trengs for oppstart,

source: Show partitions and file-systems actions
cs: Zobrazení oddílů a akcí souborových systémů
ja: パーティションとファイルシステムの処理を表示
nb_no: Vis partisjoner og filsystemhandlinger

source: Hide %d subvolume action
cs: Skrýt %d akci podsvazku
es: Ocultar %d acción de subvolumen
ja: %d 個のサブボリューム処理を隠す
nb_no: Skjul %d undervolum handling

source: Show %d subvolume action
cs: Zobrazit %d akci podsvazku
es: Mostrar %d acción de subvolumen
ja: %d 個のサブボリューム処理を表示
nb_no: Vis %d undervolum handling

source: Destructive actions are not allowed
cs: Destruktivní akce nejsou povoleny
ja: 破壊的な処理は許可しません
nb_no: Destruktive handlinger er ikke tillatt

source: Destructive actions are allowed
cs: Destruktivní akce jsou povoleny
ja: 破壊的な処理を許可します
nb_no: Destruktive handlinger er tillatt

source: affecting
cs: ovlivňující
ja: 下記に影響があります
nb_no: påvirker

source: Shrinking partitions is not allowed
cs: Zmenšování oddílů není povoleno
ja: パーティションの縮小を許可しません
nb_no: Krymping av partisjoner er ikke tillatt

source: Shrinking partitions is allowed
cs: Zmenšování oddílů je povoleno
ja: パーティションの縮小を許可します
nb_no: Krymping av partisjoner er tillatt

source: Shrinking some partitions is allowed but not needed
cs: Zmenšení některých oddílů je povoleno, ale není nutné
ja: パーティションの縮小を許可していますが不要です
nb_no: Krymping av noen partisjoner er tillatt men ikke nødvendig

source: %d partition will be shrunk
cs: %d oddíl bude zmenšen
ja: %d 個のパーティションを縮小します
nb_no: %d partisjonen vil bli krympet

source: Cannot accommodate the required file systems for installation
cs: Nelze umístit požadované souborové systémy pro instalaci
ja: インストールに必要なファイルシステムを調整できません
nb_no: Kan ikke håndtere de nødvendige filsystemene for installasjon

source: Check the planned action
cs: Zkontrolujte plánovanou akci
ja: %d 個の処理計画を確認する
nb_no: Sjekk den planlagte handlingen

source: Waiting for actions information...
cs: Čekáme na informace o akcích...
ja: 処理に関する情報を待機しています...
nb_no: Venter på handlingsinformasjon...

source: Planned Actions
cs: Plánované akce
es: Acciones planeadas
ja: 処理の計画
nb_no: Planlagt Handlinger

source: Waiting for information about storage configuration
cs: Čekání na informace o konfiguraci úložiště
es: Esperando información sobre la configuración de almacenamiento
ja: ストレージ設定に関する情報を待機しています
nb_no: Venter på informasjon om lagringskonfigurasjon

source: Final layout
cs: Konečné rozvržení
ja: 最終形態
nb_no: Sluttoppsett

source: The systems will be configured as displayed below.
cs: Systémy budou konfigurovány tak, jak je zobrazeno níže.
ja: システムは下記に表示されているとおりに設定されます。
nb_no: Systemene vil bli konfigurert som vist nedenfor.

source: Storage proposal not possible
cs: Návrh úložiště není možný
ja: ストレージの提案が実施できません
nb_no: Lagringsforslag er ikke mulig

source: New
cs: Nový
es: Nuevo
ja: 新規
nb_no: Ny

source: Before %s
cs: Před %s
es: Antes %s
ja: 変更前: %s
nb_no: Før %s

source: Mount Point
cs: Přípojný bod
es: Punto de montaje
ja: マウントポイント
nb_no: Monteringspunkt

source: Transactional root file system
cs: Transakční kořenový souborový systém
es: Sistema de archivos raíz transaccional
ja: トランザクション型のルートファイルシステム
nb_no: Transaksjonell root filsystem
