Repository: agama-project/agama
Catalog: web/po/*.po
Languages: cs, es, ja, nb_no

source: Change product
cs: Změnit produkt
es: Cambiar de producto
ja: 製品の変更
nb_no: Endre produkt

source: Confirm Installation
cs: Potvrdit instalaci
es: Confirmar instalación
ja: インストールの確認
nb_no: Bekreft Installasjon

source: If you continue, partitions on your hard disk will be modified according to the provided installation settings.
cs: Budete-li pokračovat, připravíme oddíly na pevném disku podle zadaných instalačních nastavení.
es: Si continúa, las particiones de su disco duro se modificarán de acuerdo con la configuración de instalación proporcionada.
ja: 続行すると、お使いのコンピュータのハードディスクにあるパーティションは、ここまでのダイアログで設定したとおりに変更されます。
nb_no: Hvis du fortsetter, så vil partisjonene på harddisken bli modifisert i tråd med de oppgitte installasjons innstillingene.

source: Please, cancel and check the settings if you are unsure.
cs: Nejste-li si jisti, zrušte akci a zkontrolujte nastavení.
es: Por favor, cancele y verifique la configuración si no está seguro.
ja: 何か不安な点があれば、キャンセルして設定を確認しておくことをお勧めします。
nb_no: Vennligst, avbryt og sjekk innstillingene hvis du er usikker.

source: Continue
cs: Pokračovat
es: Continuar
ja: 続行
nb_no: Fortsett

source: Cancel
cs: Zrušit/Storno
es: Cancelar
ja: キャンセル
nb_no: Avbryt

source: Install
cs: Instalovat
es: Instalar
ja: インストール
nb_no: Installere

source: TPM sealing requires the new system to be booted directly.
cs: Zapečetění čipem TPM vyžaduje přímé spuštění nového systému.
es: El sellado TPM requiere que el nuevo sistema se inicie directamente.
ja: TPM シーリングを使用するには、新しいシステムを直接起動する必要があります。
nb_no: TPM forsegling krever at det nye systemet startes opp direkte.

source: If a local media was used to run this installer, remove it before the next boot.
cs: Bylo-li ke spuštění tohoto instalačního programu použito místní médium, před dalším spuštěním ho odstraňte.
es: Si se utilizó un medio local para ejecutar este instalador, expúlselo antes del próximo inicio.
ja: このインストーラの起動に際してローカルメディアを使用している場合は、次回の再起動までの間にメディアを取り出しておいてください。
nb_no: Hvis ett lokalt media ble brukt til å kjøre dette installajonsprogrammet, så fjern det før neste oppstart.

source: Hide details
cs: Skrýt podrobnosti
es: Ocultar detalles
ja: 詳細を隠す
nb_no: Skjul detaljer

source: See more details
cs: Ukázat podrobněji
es: Ver más detalles
ja: さらに詳細を表示する
nb_no: Se flere detaljer

source: The final step to configure the Trusted Platform Module (TPM) to automatically open encrypted devices will take place during the first boot of the new system. For that to work, the machine needs to boot directly to the new boot loader.
cs: Poslední krok konfigurace modulu TPM (Trusted Platform Module) pro automatické otevírání šifrovaných zařízení se provede při prvním spuštění nového systému. Aby to fungovalo, musí se počítač spustit přímo novým zavaděčem.
es: El último paso para configurar Trusted Platform Module (TPM) para abrir automáticamente dispositivos cifrados se llevará a cabo durante el primer inicio del nuevo sistema. Para que eso funcione, la máquina debe iniciarse directamente en el nuevo gestor de arranque.
ja: Trusted Platform Module (TPM) の設定の最後では、新しいシステムの初回起動時に暗号化されたデバイスを自動で解除するよう設定します。これを動作させるためには、マシンが新しいブートローダを直接起動するように設定しておく必要があります。
nb_no: Det siste steget er å konfigurere Trusted Platform Module (TPM) for å automatisk åpne krypterte enheter vil ta plass under første oppstart av det nye systemet. For at det skal fungere, så må maskinen starte direkte med den nye oppstartslasteren.

source: Congratulations!
cs: Blahopřejeme!
es: ¡Felicidades!
ja: おめでとうございます！
nb_no: Gratulerer!

source: The installation on your machine is complete.
cs: Instalace na Váš počítač je dokončena.
es: La instalación en su equipo está completa.
ja: お使いのマシンへのインストールが完了しました。
nb_no: Installasjonen på din maskin er fullført.

source: At this point you can power off the machine.
cs: Nyní můžete počítač vypnout.
es: En este punto puede apagar el equipo.
ja: マシンの電源を切って問題ありません。
nb_no: På dette tidspunktet kan du slå av maskinen.

source: At this point you can reboot the machine to log in to the new system.
cs: Nyní můžete počítač restartovat a přihlásit se do nového systému.
es: En este punto, puede reiniciar el equipo para iniciar sesión en el nuevo sistema.
ja: あとはマシンを再起動して新しいシステムにログインするだけです。
nb_no: På dette tidspunktet kan du starte om maskinen for å logge inn i det nye systemet.

source: Finish
cs: Dokončeno
es: Finalizar
ja: 完了
nb_no: Fullfør

source: Reboot
cs: Restart systému
es: Reiniciar
ja: 再起動
nb_no: Start om

source: Installer options
cs: Možnosti instalace
ja: インストーラのオプション
nb_no: Installasjonsalternativer

source: Language
cs: Jazyk
es: Idioma
ja: 言語
nb_no: Språk

source: Keyboard layout
cs: Rozložení kláves
ja: キーボードレイアウト
nb_no: Tastaturoppsett

source: Cannot be changed in remote installation
cs: U instalace na dálku nelze změnit
ja: リモートインストールの場合は変更できません
nb_no: Kan ikke endres i fjerninstallasjonen

source: Accept
cs: Přijmout
es: Aceptar
ja: 受け入れる
nb_no: Aksepter

source: Before starting the installation, you need to address the following problems:
cs: Před zahájením instalace vyřešte tyto problémy:
ja: インストールを開始する前に、下記の問題に対応する必要があります:
nb_no: Før du starter installasjonen, må du løse følgende problemer:

source: Search
cs: Hledat
es: Buscar
ja: 検索
nb_no: Søk

source: Could not log in. Please, make sure that the password is correct.
cs: Nelze se přhlásit. Zkontrolujte správnost hesla.
es: No se ha podido iniciar sesión. Por favor, asegúrese de que la contraseña es correcta.
ja: ログインできませんでした。入力したパスワードが正しいかどうか、もう一度ご確認ください。
nb_no: Kunne ikke logge på, Vennligst, sjekk at passordet er korrekt.

source: Could not authenticate against the server, please check it.
cs: Nezdařilo se ověřit Vás u serveru, zkontrolujte to prosím.
ja: サーバに対して認証できませんでした。ご確認ください。
nb_no: Kunne ikke autentisere mot serveren, vennligst sjekk det.

source: Log in as %s
cs: Přihlásit se jako %s
es: Iniciar sesión como %s
ja: %s としてログイン
nb_no: Logg på som %s

source: The installer requires [root] user privileges.
cs: Instalátor vyžaduje oprávnění uživatele [root].
ja: インストーラを使用するには [root] 権限が必要です。
nb_no: Installasjonen krever [root] bruker privilegier.

source: Please, provide its password to log in to the system.
cs: Zadejte heslo pro přihlášení do systému.
ja: システムにログインするためのパスワードを入力してください。
nb_no: Vennligst, oppgi passordet for å logge på systemet.

source: Login form
cs: Přihlašovací formulář
es: Formulario de inicio de sesión
ja: ログインフォーム
nb_no: Innloggingsskjema

source: Password input
cs: Zadejte heslo
es: Entrada de contraseña
ja: パスワード入力
nb_no: Passord inntasting

source: Log in
cs: Přihlásit se
es: Iniciar sesión
ja: ログイン
nb_no: Logg inn

source: Back
cs: Zpět
ja: 戻る
nb_no: Tilbake

source: Passwords do not match
cs: Hesla se neshodují
es: Las contraseñas no coinciden
ja: パスワードが合致しません
nb_no: Passordene er ikke like

source: Password
cs: Heslo
es: Contraseña
ja: パスワード
nb_no: Passord

source: Password confirmation
cs: Potvrzení hesla
es: Confirmación de contraseña
ja: パスワードの確認
nb_no: Passord bekreftelse

source: Password visibility button
cs: Tlačítko viditelnosti hesla
es: Botón de visibilidad de contraseña
ja: パスワード表示ボタン
nb_no: Passord synlighetsknapp

source: Confirm
cs: Potvrdit
es: Confirmar
ja: 確認
nb_no: Bekreft

source: Loading data...
cs: Soubor se načítá…
es: Cargando los datos...
ja: データを読み込んでいます...
nb_no: Laster data...

source: Pending
cs: Čeká se na
ja: 保留中
nb_no: Avventer

source: In progress
cs: Probíhá
ja: 処理中
nb_no: Pågår

source: Finished
cs: Dokončeno
ja: 完了
nb_no: Fullført

source: Actions
cs: Akce
es: Acciones
ja: 処理
nb_no: Handlinger

source: Waiting
cs: Čekám
es: Esperar
ja: お待ちください
nb_no: Venter

source: Cannot connect to Agama server
cs: Nelze se připojit k serveru Agama
ja: Agama サーバに接続できません
nb_no: Kan ikke koble til Agama server

source: Please, check whether it is running.
cs: Zkontrolujte, zda je spuštěn.
ja: 問題なく動作しているかどうかご確認ください。
nb_no: Vennligst, sjekk om den kjører.

source: Reload
cs: Znovu načíst
es: Recargar
ja: 再読み込み
nb_no: Last på nytt

source: Filter by description or keymap code
cs: Filtrování podle popisu nebo kódu mapy kláves
es: Filtrar por descripción o código de mapa de teclas
ja: 説明またはキーマップコードでフィルタ
nb_no: Filtrer etter beskrivelse eller tastaturkode

source: None of the keymaps match the filter.
cs: Žádná z map kláves neodpovídá filtru.
ja: フィルタに該当するキーマップがありません。
nb_no: Ingen av tastene passer sammen med filteret.

source: Keyboard selection
cs: Výběr klávesnice
ja: キーボードの選択
nb_no: Valg av tastatur

source: Select
cs: Zvolit
es: Seleccionar
ja: 選択
nb_no: Velg

source: Localization
cs: Lokalizace
es: Localización
ja: ローカライゼーション
nb_no: Lokalisering

source: Not selected yet
cs: Dosud nevybráno
ja: まだ何も選択していません
nb_no: Ikke valgt ennå

source: Change
cs: Změnit
es: Cambiar
ja: 変更
nb_no: Endre

source: Keyboard
cs: Klávesnice
es: Teclado
ja: キーボード
nb_no: Tastatur

source: Time zone
cs: Časové pásmo
es: Zona horaria
ja: タイムゾーン
nb_no: Tidssone

source: Filter by language, territory or locale code
cs: Filtrování podle jazyka, území nebo kódu lokality
es: Filtrar por idioma, territorio o código local
ja: 言語／地域／ロケールコードでフィルタ
nb_no: Filtrer etter språk, territorium eller lokalkode

source: None of the locales match the filter.
cs: Žádné umístění neodpovídá filtru.
ja: フィルタに該当するロケールがありません。
nb_no: Ingen av lokaliseringene passer sammen med filteret.

source: Locale selection
cs: Výběr lokality
ja: ロケールの選択
nb_no: Valg av lokalisering

source: Filter by territory, time zone code or UTC offset
cs: Filtrování podle území, kódu časového pásma nebo posunu od UTC
es: Filtrar por territorio, código de zona horaria o compensación UTC
ja: 地域／タイムゾーンコード／UTC オフセット値でフィルタ
nb_no: Filtrer etter territorium, tidssonekode eller UTC forskyvning

source: None of the time zones match the filter.
cs: Žádné z časových pásem neodpovídá filtru.
ja: フィルタに該当するタイムゾーンがありません。
nb_no: Ingen av tidssonene passer sammen med filteret.

source: Timezone selection
cs: Výběr časového pásma
ja: タイムゾーンの選択
nb_no: Valg av tidssone

source: Download logs
cs: Stahuji zázbamy
es: Descargar los registros
ja: ログのダウンロード
nb_no: Last ned loggfiler

source: Main navigation
cs: Hlavní navigace
ja: メインナビゲーション

source: Loading installation environment, please wait.
cs: Načítá se instalační prostředí, vyčkejte prosím.
es: Cargando el entorno de instalación, espere por favor.
ja: インストール環境を読み込んでいます。しばらくお待ちください。
nb_no: Laster installasjonsmiljø, vennligst vent.

source: Remove
cs: Odstranit
es: Eliminar
ja: 削除
nb_no: Fjerne

source: IP Address
cs: IP adresa
es: Dirección IP
ja: IP アドレス
nb_no: IP Addresse

source: Prefix length or netmask
cs: Délka předpony nebo maska sítě
es: Longitud del prefijo o máscara de red
ja: プレフィクス長またはサブネットマスク
nb_no: Prefikslengde eller nettmaske

source: Add an address
cs: Přidat adresu
es: Añadir una dirección
ja: アドレスの追加
nb_no: Legg til en addresse

source: Add another address
cs: Přidat další adresu
es: Añadir otras direcciones
ja: その他のアドレスの追加
nb_no: Legg til en annen adresse

source: Addresses
cs: Adresy
es: Direcciones
ja: アドレス
nb_no: Addresser

source: Addresses data list
cs: Seznam údajů o adresách
es: Lista de datos de direcciones
ja: アドレスデータの一覧
nb_no: Adresser dataliste

source: Name
cs: Název
es: Nombre
ja: 名前
nb_no: Navn

source: IP addresses
cs: IP adresy
es: Direcciones IP
ja: IP アドレス
nb_no: IP addresser

source: Connection actions
cs: Akce připojení
ja: 接続処理

source: Edit
cs: Upravit
es: Editar
ja: 編集
nb_no: Redigere

source: Edit connection %s
cs: Upravit připojení %s
es: Editar conexión %s
ja: 接続 %s の編集
nb_no: Rediger tilkobling %s

source: Forget
cs: Zapomenout
es: Olvidar
ja: 削除
nb_no: Glem

source: Forget connection %s
cs: Zapomenout připojení %s
es: Olvidar conexión %s
ja: 接続 %s の削除
nb_no: Glem tilkoblingen %s

source: Actions for connection %s
cs: Akce pro připojení %s
es: Acciones para la conexión %s
ja: 接続 %s に対する処理
nb_no: Handlinger for tilkobling %s

source: Server IP
cs: IP serveru
es: Servidor IP
ja: サーバ IP

source: Add DNS
cs: Přidat DNS
es: Añadir DNS
ja: DNS の追加
nb_no: Legg til DNS

source: Add another DNS
cs: Přidat další DNS
es: Añadir otro DNS
ja: その他の DNS の追加
nb_no: Legg til en annen DNS

source: Ip prefix or netmask
cs: předpona IP nebo maska sítě
ja: IP プレフィクスもしくはネットマスク

source: At least one address must be provided for selected mode
cs: Pro zvolený režim musí být uvedena alespoň jedna adresa
es: Se debe proporcionar al menos una dirección para el modo seleccionado
ja: 選択しているモードの場合、 1 つ以上のアドレスを設定しなければなりません
nb_no: Minst en adresse må oppgis for valgt modus

source: Mode
cs: Režim
es: Modo
ja: モード
nb_no: Modus

source: Automatic (DHCP)
cs: Automatický (DHCP)
es: Automático (DHCP)
ja: 自動 (DHCP)
nb_no: Automatisk (DHCP)

source: Manual
cs: Manuální
ja: 手動
nb_no: Manuell

source: Gateway
cs: Brána
es: Puerta de enlace
ja: ゲートウエイ

source: Gateway can be defined only in 'Manual' mode
cs: Bránu lze definovat pouze v režimu 'Manual'
ja: '手動' モードの場合にのみゲートウエイを設定できます
nb_no: Gateway kan bare defineres i 'Manuelt' modus

source: Wired
cs: Připojení kabelem (Ethernet)
ja: 有線
nb_no: Kablet

source: No wired connections found
cs: Nebyla nalezena žádná kabelová připojení
ja: 有線接続が見つかりませんでした
nb_no: Ingen kablede tilkoblinger funnet

source: Connect
cs: Připojit
es: Conectar
ja: 接続
nb_no: Koble til

source: Connected to %s
cs: Připojeno k %s
ja: %s に接続済み

source: No connected yet
cs: Dosud nepřipojeno
ja: まだ接続していません
nb_no: Ikke koblet til ennå

source: The system has not been configured for connecting to a Wi-Fi network yet.
cs: Systém zatím nebyl konfigurován pro připojení k síti Wi-Fi.
ja: このシステムでは、まだ WiFi ネットワークへの接続設定を実施していません。
nb_no: Systemet har ikke blitt konfigurert for å koble til et Wi-Fi nettverk ennå.

source: No Wi-Fi supported
cs: Wi-Fi není podporováno
ja: Wi-Fi サポートがありません
nb_no: Ingen Wi-Fi støttes

source: The system does not support Wi-Fi connections, probably because of missing or disabled hardware.
cs: Systém nepodporuje připojení Wi-Fi, pravděpodobně chybí hardware nebo je zakázán.
ja: このシステムは WiFi 接続には対応していません。無線ハードウエアが存在していないか、無効化されているものと思われます。
nb_no: Systemet støtter ikke Wi-Fi tilkoblinger, sannsynligvis på grunn av manglende eller deaktivert maskinvare.

source: Network
cs: Síť
es: Red
ja: ネットワーク
nb_no: Nettverk

source: None
cs: Žádná
es: Ninguno
ja: 無し
nb_no: Ingen

source: WPA & WPA2 Personal
cs: WPA & WPA2 Osobní
es: WPA y WPA2 personales
ja: WPA および WPA2 Personal
nb_no: WPA & WPA2 Personlig

source: WiFi connection form
cs: Formulář pro připojení WiFi
ja: WiFi 接続フォーム

source: Authentication failed, please try again
cs: Ověření selhalo, zkuste to znovu
ja: 認証が失敗しました、やり直してください

source: Something went wrong
cs: Něco se nezdařilo
es: Algo salió mal
ja: 何らかの問題が発生しました
nb_no: Noe gikk galt

source: Please, review provided settings and try again.
cs: Zkontrolujte poskytnutá nastavení a zkuste to znovu.
es: Por favor, revise la configuración proporcionada y vuelva a intentarlo.
ja: 設定をご確認のうえやり直してください。
nb_no: Vennligst, sjekk de angitte innstillingene og prøv igjen.

source: Security
cs: Zabezpečení
es: Seguridad
ja: セキュリティ
nb_no: Sikkerhet

source: WPA Password
cs: Heslo k WPA
es: Contraseña WPA
ja: WPA パスワード
nb_no: WPA Passord

source: Connecting
cs: Připojuji
es: Conectando
ja: 接続しています
nb_no: Kobler til

source: Connected
cs: Připojeno
es: Conectado
ja: 接続済み
nb_no: Tilkoblet

source: Disconnected
cs: Odpojeno
es: Desconectado
ja: 切断済み
nb_no: Koblet fra

source: Disconnect
cs: Odpojit
ja: 切断
nb_no: Koble fra

source: Connect to hidden network
cs: Připojit ke skryté síti
es: Conectar a una red oculta
ja: ステルスネットワークへの接続
nb_no: Koble til skjult nettverk

source: configured
cs: konfigurováno
ja: 設定済み
nb_no: konfigurert

source: Visible Wi-Fi networks
cs: Viditelné sítě Wi-Fi
ja: 検出された Wi-Fi ネットワーク

source: Connect to a Wi-Fi network
cs: Připojení k síti Wi-Fi
es: Conectado a una red WIFI
ja: Wi-Fi ネットワークへの接続
nb_no: Koble til et Wi-Fi nettverk

source: The system will use %s as its default language.
cs: Systém použije jako výchozí jazyk %s.
es: El sistema utilizará %s como su idioma predeterminado.
ja: システムは %s を既定の言語として使用します。
nb_no: Systemet vil bruke %s som standardspråk.

source: Users
cs: Uživatelé
es: Usuarios
ja: ユーザ
nb_no: Brukere

source: Storage
cs: Paměť
es: Almacenamiento
ja: ストレージ
nb_no: Lagring

source: Software
ja: ソフトウエア
nb_no: Programvare

source: Before installing, please check the following problems.
cs: Před instalací zkontrolujte tyto problémy.
ja: インストールを行う前に、下記の問題点をご確認ください。
nb_no: Før installasjon, vennligst sjekk følgende problemer.

source: Overview
cs: Přehled
ja: 概要
nb_no: Oversikt

source: These are the most relevant installation settings. Feel free to browse the sections in the menu for further details.
cs: Toto je nejdůležitější nastavení instalace. Další podrobnosti najdete v sekcích v nabídce.
ja: インストールにあたっての主要な項目のみを表示しています。さらに詳しい設定を確認したい場合は、それぞれのセクションを開いてください。
nb_no: Disse er de mest relevante installasjonsinnstillingene, Bla gjerne gjennom seksjonene i menyen for ytterligere detaljer.

source: Take your time to check your configuration before starting the installation process.
cs: Před zahájením instalace zkontrolujte konfiguraci.
ja: インストール処理を開始する前に、設定内容をよくご確認ください。
nb_no: Ta god tid til å sjekke din konfigurasjon før du begynner installasjons prosessen.

source: The installation will take
cs: Instalace zabere
ja: インストールで占有する容量は
nb_no: Installasjonen vil ta

source: The installation will take %s including:
cs: Instalace bude trvat %s včetně:
ja: インストールを行うには、下記を含めた %s が必要です:
nb_no: Installasjonen vil ta %s inkludert:

source: Install in a new Logical Volume Manager (LVM) volume group shrinking existing partitions at the underlying devices as needed
cs: Instalace do nové skupiny svazků LVM (Logical Volume Manager), která podle potřeby zmenší existující oddíly na základních zařízeních
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) reduciendo las particiones existentes en los dispositivos subyacentes según sea necesario
ja: 必要に応じて既存のパーティションを縮小し、新しく論理ボリュームマネージャ (LVM) のボリュームグループを作成してインストールします
nb_no: Installer i en ny logisk volum behandler (LVM) volumgruppe som krymper eksisterende partisjoner ved de underliggende enhetenes behov

source: Install in a new Logical Volume Manager (LVM) volume group without modifying the partitions at the underlying devices
cs: Instalace do nové skupiny svazků Správce logických svazků (LVM) bez úpravy oddílů v základních zařízeních
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) sin modificar las particiones en los dispositivos subyacentes
ja: 既存のパーティションを変更せず、新しく論理ボリュームマネージャ (LVM) のボリュームグループを作成してインストールします
nb_no: Installer i en ny Logisk Volum Behandler (LVM) volumgruppe uten å modifisere partisjonene på de underliggende enhetene

source: Install in a new Logical Volume Manager (LVM) volume group deleting all the content of the underlying devices
cs: Instalace do nové skupiny svazků LVM (Logical Volume Manager), která odstraní veškerý obsah základních zařízení
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) elimina todo el contenido de los dispositivos subyacentes
ja: 既存のデバイス内の内容を全て削除し、新しく論理ボリュームマネージャ (LVM) のボリュームグループを作成してインストールします
nb_no: Installer i en ny Logisk Volum Behandler (LVM) volumgruppe og slett alt av innholdet til de underliggende enhetene

source: Install in a new Logical Volume Manager (LVM) volume group using a custom strategy to find the needed space at the underlying devices
cs: Instalace do nové skupiny svazků LVM (Logical Volume Manager) pomocí vlastní strategie pro nalezení potřebného místa v základních zařízeních
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) utilizando una estrategia personalizada para encontrar el espacio necesario en los dispositivos subyacentes
ja: 必要な領域検出に際して独自の方式を利用し、新しく論理ボリュームマネージャ (LVM) のボリュームグループを作成してインストールします
nb_no: Installer en ny Logisk Volum Behandler (LVM) volumgruppe ved å bruke en tilpasset strategi for å finne den nødvendige plassen på de underliggende enhetene

source: Install in a new Logical Volume Manager (LVM) volume group on %s shrinking existing partitions as needed
cs: Instalace do nové skupiny svazků LVM (Logical Volume Manager) na %s se zmenšením stávajících oddílů podle potřeby
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) en %s, reduciendo las particiones existentes según sea necesario
ja: 必要に応じて %s 内の既存パーティションを縮小し、新しく論理ボリュームマネージャ (LVM) のボリュームグループを作成してインストールします
nb_no: Installer en ny Logisk Volum Behandler (LVM) volumgruppe på %s og krymper de eksisterende partisjonene ved behov

source: Install in a new Logical Volume Manager (LVM) volume group on %s without modifying existing partitions
cs: Instalace do nové skupiny svazků LVM (Logical Volume Manager) na %s bez úpravy existujících oddílů
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) en %s sin modificar las particiones existentes
ja: %s 内の既存パーティションを変更せず、新しく論理ボリュームマネージャのボリュームグループを作成してインストールします
nb_no: Installer en ny Logisk Volum Behandler (LVM) volumgruppe på %s uten å modifisere eksisterende partisjoner

source: Install in a new Logical Volume Manager (LVM) volume group on %s deleting all its content
cs: Instalace do nové skupiny svazků LVM (Logical Volume Manager) na %s s odstraněním veškerého jejich obsahu
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) en %s eliminando todo su contenido
ja: %s 内の内容を全て削除し、新しく論理ボリュームマネージャ (LVM) のボリュームグループを作成してインストールします
nb_no: Installer en ny Logisk Volum Behandler (LVM) volumgruppe på %s sletter alt innhold

source: Install in a new Logical Volume Manager (LVM) volume group on %s using a custom strategy to find the needed space
cs: Instalace do nové skupiny svazků LVM (Logical Volume Manager) na %s s použitím vlastní strategie pro nalezení potřebného místa
es: Instalar en un nuevo grupo de volúmenes de Logical Volume Manager (LVM) en %s usando una estrategia personalizada para encontrar el espacio necesario
ja: %s 内での必要な領域検出に際して独自の方式を利用し、新しく論理ボリュームマネージャのボリュームグループを作成してインストールします
nb_no: Installer en ny Logisk Volum Behandler (LVM) volumgruppe på %s ved bruk av en tilpasset strategi for å finne nødvendig plass

source: No device selected yet
cs: Zatím nebylo vybráno žádné zařízení
es: Ningún dispositivo seleccionado todavía
ja: まだ何もデバイスを選択していません
nb_no: Ingen enhet er valgt ennå

source: Install using device %s shrinking existing partitions as needed
cs: Instalace pomocí zařízení %s se zmenšením stávajících oddílů podle potřeby
es: Instalar utilizando el dispositivo %s reduciendo las particiones existentes según sea necesario
ja: デバイス %s の既存パーティションを必要に応じて縮小してインストールします
nb_no: Installer med enheten %s ved å krympe eksisterende partisjoner ved behov

source: Install using device %s without modifying existing partitions
cs: Instalace pomocí zařízení %s bez úpravy stávajících oddílů
es: Instalar utilizando el dispositivo %s sin modificar las particiones existentes
ja: デバイス %s の既存パーティションを変更せずにインストールします
nb_no: Installer med enheten %s uten å modifisere eksisterende partisjoner

source: Install using device %s and deleting all its content
cs: Instalace pomocí zařízení %s a odstranění veškerého jeho obsahu
es: Instalar utilizando el dispositivo %s y eliminar todo su contenido
ja: デバイス %s の内容を全て削除してインストールします
nb_no: Installer med enheten %s og slett alt av dens innhold

source: Install using device %s with a custom strategy to find the needed space
cs: Instalace pomocí zařízení %s s vlastní strategií pro vyhledání potřebného místa
es: Instalar usando el dispositivo %s con una estrategia personalizada para encontrar el espacio necesario
ja: 必要な領域検出に際して独自の方式を利用し、デバイス %s にインストールします
nb_no: Installer med enheten %s ved å bruke en tilpasset strategi for å finne nødvendig plass

source: %s logo
ja: %s ロゴ

source: Select a product
cs: Vyberte produkt
ja: 製品の選択

source: Available products
cs: Dostupné produkty
ja: 利用可能な製品
nb_no: Tilgjengelige produkter
