Repository: agama-project/agama
Catalog: web/po/*.po
Languages: cs, es, ja, nb_no

source: %s is an immutable system with atomic updates. It uses a read-only Btrfs file system updated via snapshots.
cs: %s je neměnný systém s atomickými aktualizacemi. Používá souborový systém Btrfs pouze pro čtení aktualizovaný pomocí snímků.
es: %s es un sistema inmutable con actualizaciones atómicas. Utiliza un sistema de archivos Btrfs de solo lectura actualizado mediante instantáneas.
ja: %s は一括更新のできる不可変なシステムです。読み込み専用の btrfs ルートファイルシステムを利用して更新を適用します。
nb_no: %s er et uforanderlig system med atomiske oppdateringer. Den bruker et skrivebeskyttet Btrfs filsystem oppdatert via øyeblikksbilder.

source: Use Btrfs snapshots for the root file system
cs: Použití snímků Btrfs pro kořenový souborový systém
es: Utilizar instantáneas de Btrfs para el sistema de archivos raíz
ja: ルートファイルシステムで btrfs スナップショットを使用する
nb_no: Bruk Btrfs øyeblikksbilder for root filsystemet

source: Allows to boot to a previous version of the system after configuration changes or software upgrades.
cs: Umožňuje zavést předchozí verzi systému po změně konfigurace nebo aktualizaci softwaru.
es: Permitir iniciar una versión anterior del sistema después de cambios de configuración o actualizaciones de software.
ja: 設定の変更やソフトウエアのアップグレードを行った際、必要に応じて以前の状態に戻して起動することができます。
nb_no: Gjør det mulig å starte opp til en tidligere versjon av systemet etter konfigurasjonsendringer eller programvareoppgraderinger.

source: Up to %s can be recovered by shrinking the device.
cs: Zmenšením zařízení lze obnovit až %s.
ja: デバイスの縮小により、最大で %s が確保できます。

source: The device cannot be shrunk:
cs: Zařízení nelze zmenšit:
ja: デバイスは縮小できません:

source: Show information about %s
cs: Zobrazit informace o %s
ja: %s に関する情報を表示

source: The content may be deleted
cs: Obsah může být smazán
es: El contenido puede ser eliminado
ja: 内容が削除されるかもしれません
nb_no: Innholdet kan bli slettet

source: Action
cs: Akce
es: Acción
ja: 処理
nb_no: Handling

source: Actions to find space
cs: Akce k nalezení prostoru
es: Acciones para encontrar espacio
ja: 領域の検出処理
nb_no: Handling for å finne plass

source: Space policy
cs: Zásady pro volné místo
ja: 領域ポリシー
nb_no: Plass retningslinjer

source: Add %s file system
cs: Přidání souborového systému %s
es: Agregar %s sistema de archivos
ja: %s ファイルシステムの追加
nb_no: Legg til %s filsystemet

source: Edit %s file system
cs: Upravit souborový systém %s
es: Editar %s sistema de archivos
ja: %s ファイルシステムの編集
nb_no: Rediger %s filsystemet

source: Edit file system
cs: Úprava souborového systému
es: Editar sistema de archivos
ja: ファイルシステムの編集
nb_no: Rediger filsystemet

source: The type and size of the file system cannot be edited.
cs: Typ a velikost souborového systému nelze upravovat.
es: El tipo y el tamaño del sistema de archivos no puede ser editado.
ja: ファイルシステムの種類とサイズは編集できません。
nb_no: Typen og størrelsen av filsystemet kan ikke bli redigert.

source: The current file system on %s is selected to be mounted at %s.
cs: Aktuální souborový systém na %s je vybrán k připojení k %s.
es: El actual sistema de archivos en %s está seleccionado para ser montado en %s.
ja: %s 内にある現在のファイルシステムを %s にマウントするよう選択しています。
nb_no: Det nåværende filsystemet på %s er valgt for å monteres på %s.

source: The size of the file system cannot be edited
cs: Velikost souborového systému nelze měnit
es: El tamaño del sistema de archivos no puede ser editado
ja: ファイルシステムのサイズは編集できません
nb_no: Størrelsen på filsystemet kan ikke bli redigert

source: The file system is allocated at the device %s.
cs: Souborový systém je přidělen na zařízení %s.
es: El sistema de archivos está asignado en el dispositivo %s.
ja: ファイルシステムはデバイス %s 内から割り当てます。
nb_no: Filsystemet er allokert på enheten %s.

source: A mount point is required
cs: Je vyžadován přípojný bod
es: Se requiere un punto de montaje
ja: マウントポイントを指定する必要があります
nb_no: Et monteringspunkt er nødvendig

source: The mount point is invalid
cs: Přípojný bod je neplatný
es: El punto de montaje no es válido
ja: マウントポイントが正しくありません
nb_no: Monteringspunktet er ugyldig

source: A size value is required
cs: Je vyžadována hodnota velikosti
es: Se requiere un valor de tamaño
ja: サイズを指定する必要があります
nb_no: En størrelsesverdi er nødvendig

source: Minimum size is required
cs: Je vyžadována minimální velikost
es: Se requiere un tamaño mínimo
ja: 最小サイズを指定する必要があります
nb_no: Minstestørrelse er nødvendig

source: There is already a file system for %s.
cs: Pro %s již existuje souborový systém.
es: Ya existe un sistema de archivos para %s.
ja: %s に対するファイルシステムが既に存在しています。
nb_no: Det er allerede et filsystem for %s.

source: Do you want to edit it?
cs: Chcete to upravit?
es: ¿Quieres editarlo?
ja: 編集してよろしいですか？
nb_no: Vil du redigere den?

source: There is a predefined file system for %s.
cs: Pro %s existuje předdefinovaný souborový systém.
es: Hay un sistema de archivos predefinido para %s.
ja: %s に対して事前設定されたファイルシステムが既に存在しています。
nb_no: Det er et forhåndsdefinert filsystem for %s.

source: Do you want to add it?
cs: Chcete ho přidat?
es: ¿Quieres añadirlo?
ja: 追加してよろしいですか？
nb_no: Vil du legge til den?

source: The options for the file system type depends on the product and the mount point.
cs: Možnosti typu souborového systému závisí na produktu a přípojném bodu.
es: Las opciones para el tipo de sistema de archivos dependen del producto y del punto de montaje.
ja: ファイルシステムに対する選択肢は、製品とマウントポイントごとに異なります。
nb_no: Alternativene for filsystemtypen avhenger av produktet og monteringspunktet.

source: More info for file system types
cs: Další informace o typech souborových systémů
es: Más información para los tipos de sistemas de archivos
ja: ファイルシステムの種類に関する詳細
nb_no: Mer info om filsystemtyper

source: File system type
cs: Typ systému souborů
es: Tipo de sistema de archivos
ja: ファイルシステムの種類
nb_no: Filsystem type

source: the configuration of snapshots
cs: konfigurace snímků
es: la configuración de las instantáneas
ja: スナップショットの設定
nb_no: konfigurasjonen av øyeblikksbilder

source: the presence of the file system for %s
cs: přítomnost souborového systému pro %s
es: la presencia del sistema de archivos para %s
ja: %s に対するファイルシステムの存在
nb_no: tilstedeværelsen av filsystemet for %s

source: the amount of RAM in the system
cs: velikost paměti RAM v systému
es: la cantidad de memoria RAM en el sistema
ja: システムに搭載された RAM の量
nb_no: mengden RAM i systemet

source: The final size depends on %s.
cs: Konečná velikost závisí na %s.
es: El tamaño final depende de %s.
ja: 最終的なサイズは %s に依存します。
nb_no: Sluttstørrelsen avhenger av %s.

source: and
cs: a
es: y
ja: および
nb_no: og

source: Automatically calculated size according to the selected product.
cs: Automatický výpočet velikosti podle vybraného produktu.
es: Tamaño calculado automáticamente según el producto seleccionado.
ja: 選択した製品に合わせてサイズを自動計算します。
nb_no: Automatisk kalkulert størrelse i henhold til det valgte produktet.

source: Exact size for the file system.
cs: Přesná velikost souborového systému.
es: Tamaño exacto para el sistema de archivos.
ja: ファイルシステムに対して正確なサイズを設定します。
nb_no: Nøyaktig størrelse for filsystemet.

source: Exact size
cs: Přesná velikost
es: Tamaño exacto
ja: 正確なサイズ
nb_no: Nøyaktig størrelse

source: Size unit
cs: Jednotka velikosti
es: Unidad de tamaño
ja: サイズの単位
nb_no: Størrelsesenhet

source: Limits for the file system size. The final size will be a value between the given minimum and maximum. If no maximum is given then the file system will be as big as possible.
cs: Omezení velikosti souborového systému. Konečná velikost bude hodnota mezi zadaným minimem a maximem. Pokud není zadáno žádné maximum, bude souborový systém co největší.
es: Límites para el tamaño del sistema de archivos. El tamaño final será un valor entre el mínimo y el máximo dados. Si no se da un máximo, el sistema de archivos será lo más grande posible.
ja: ファイルシステムに対するサイズ制限を範囲指定します。最終的なサイズは最小値と最大値の間になります。最大値を指定しない場合、ファイルシステムはできる限り大きくなるように設定されます。
nb_no: Grense for filsystemstørrelsen. Den endelige størrelsen vil være en verdi mellom avgitt minimum og maksimum. Hvis det ikke er gitt noe maksimum, så vil filsystemet være så stor som mulig.

source: Minimum
es: Mínimo
ja: 最小

source: Minimum desired size
cs: Minimální požadovaná velikost
es: Tamaño mínimo deseado
ja: 最小必須サイズ
nb_no: Minimum ønsket størrelse

source: Unit for the minimum size
cs: Jednotka pro minimální velikost
es: Unidad para el tamaño mínimo
ja: 最小サイズの単位
nb_no: Enhet for minimum størrelse

source: Maximum
es: Máximo
ja: 最大
nb_no: Maksimum

source: Maximum desired size
cs: Maximální požadovaná velikost
es: Tamaño máximo deseado
ja: 最大要求サイズ
nb_no: Maksimal ønsket størrelse

source: Unit for the maximum size
cs: Jednotka pro maximální velikost
es: Unidad para el tamaño máximo
ja: 最大サイズの単位
nb_no: Enhet for maksimal størrelse

source: Auto
es: Automático
ja: 自動

source: Fixed
cs: Opraveno
es: Fijado
ja: 固定値
nb_no: Fikset

source: Range
cs: Rozsah
es: Rango
ja: 範囲
nb_no: Rekkevidde

source: The file systems are allocated at the installation device by default. Indicate a custom location to create the file system at a specific device.
cs: Souborové systémy jsou ve výchozím nastavení vytvořeny v instalačním zařízení. Chcete-li vytvořit souborový systém na konkrétním zařízení, zadejte vlastní umístění.
es: Los sistemas de archivos son asignados por defecto en el dispositivo de instalación. Indique una ubicación personalizada para crear el sistema de archivos en un dispositivo específico.
ja: 既定では、インストール先のデバイス内にファイルシステムを割り当てます。ここでは、特定のデバイス内にファイルシステムを作成する際の場所を設定します。
nb_no: Filsystemet er allokert som standard på installasjonsenheten. Indiker en egendefinert plassering for å opprette filsystemet på en spesifikk enhet.

source: Location for %s file system
cs: Umístění souborového systému %s
es: Ubicación del sistema de archivos %s
ja: %s ファイルシステムの場所
nb_no: Plassering for %s filsystemet

source: Select in which device to allocate the file system
cs: Vyberte, ve kterém zařízení se má vytvořit systém souborů
es: Seleccione en qué dispositivo asignar el sistema de archivos
ja: ファイルシステムの割り当てを実施するデバイスを選択してください
nb_no: Velg hvilken enhet å allokere filsystemet i

source: Select a location
cs: Vyberte umístění
es: Seleccionar una ubicación
ja: 場所の選択
nb_no: Velg en plassering

source: Select how to allocate the file system
cs: Zvolte způsob vytvoření souborového systému
es: Seleccionar cómo asignar el sistema de archivos
ja: ファイルシステムの割り当て方法を選択してください
nb_no: Velg hvordan filsystemet skal allokeres

source: Create a new partition
cs: Vytvořit nový oddíl
es: Crear una nueva partición
ja: 新しいパーティションの作成
nb_no: Opprett en ny partisjon

source: The file system will be allocated as a new partition at the selected disk.
cs: Souborový systém bude přidělen jako nový oddíl na vybraném disku.
es: El sistema de archivos se asignará como una nueva partición en el disco seleccionado.
ja: ファイルシステムは選択したディスク内の新規パーティションとして割り当てます。
nb_no: Filsystemet vil bli allokert som en ny partisjon på den valgte disken.

source: Create a dedicated LVM volume group
cs: Vytvoření vyhrazené skupiny svazků LVM
es: Crear un grupo de volúmenes LVM dedicado
ja: 専用の LVM ボリュームグループの作成
nb_no: Opprett en dedikert LVM volumgruppe

source: A new volume group will be allocated in the selected disk and the file system will be created as a logical volume.
cs: Na vybraném disku bude vytvořena nová skupina svazků a systém souborů bude vytvořen jako logický svazek.
es: Se asignará un nuevo grupo de volúmenes en el disco seleccionado y el sistema de archivos se creará como un volumen lógico.
ja: 選択したディスク内に新しいボリュームグループを作成し、論理ボリュームとしてファイルシステムを作成します。
nb_no: En ny volumgruppe vil bli allokert på den valgte disken og filsystemet vil bli opprettet som et logisk volum.

source: Format the device
cs: Formátovat zařízení
es: Formatear el dispositivo
ja: デバイスのフォーマット
nb_no: Formater enheten

source: The selected device will be formatted as %s file system.
cs: Vybrané zařízení bude formátováno jako souborový systém %s.
es: El dispositivo seleccionado se formateará como un sistema de archivos %s.
ja: 選択したデバイスを %s ファイルシステムでフォーマットします。
nb_no: Den valgte enheten vil bli formatert som %s filsystem.

source: Mount the file system
cs: Připojit souborový systém
es: Montar el sistema de archivos
ja: ファイルシステムのマウント
nb_no: Monter filsystemet

source: The current file system on the selected device will be mounted without formatting the device.
cs: Aktuální souborový systém na vybraném zařízení bude připojen bez formátování zařízení.
es: El actual sistema de archivos en el dispositivo seleccionado se montará sin formatear el dispositivo.
ja: 選択したデバイス内にあるファイルシステムを、フォーマットせずにそのままマウントします。
nb_no: Det gjeldende filsystemet på den valgte enhet vil bli montert uten å formatere enheten.

source: Usage
cs: Použití
es: Uso
ja: 用途
nb_no: Bruk

source: Formatting DASD devices
cs: Formátuji zařízení DASD
es: Formatear dispositivos DASD
ja: DASD デバイスをフォーマットしています
nb_no: Formaterer DASD enheter

source: DASD devices selection table
cs: Tabulka výběru zařízení DASD
ja: DASD デバイス選択テーブル

source: Back to device selection
cs: Zpět na výběr zařízení
ja: デバイス選択に戻る

source: No
cs: Ne
ja: いいえ
nb_no: Nei

source: Yes
cs: Ano
es: Sí
ja: はい
nb_no: Ja

source: Channel ID
cs: ID kanálu
es: Canal ID
ja: チャネル ID
nb_no: Kanal ID

source: Status
cs: Stav
es: Estado
ja: 状態

source: Type
cs: Typ
es: Tipo
ja: 種類

source: Formatted
cs: Formátován
es: Formateado
ja: フォーマット済み
nb_no: Formatert

source: Partition Info
cs: Údaje o oddílech
es: Información de la partición
ja: パーティション情報
nb_no: Partisjon Info

source: Perform an action
cs: Provést akci
es: Realizar una acción
ja: 処理を実行
nb_no: Utfør en handling

source: Activate
cs: Aktivace
es: Activar
ja: 有効化
nb_no: Aktiver

source: Deactivate
cs: Deaktivace
es: Desactivar
ja: 無効化
nb_no: Deaktivere

source: Set DIAG On
cs: Zapnout DIAG
es: Activar DIAG
ja: 診断を有効化
nb_no: Sett DIAG på

source: Set DIAG Off
cs: Vypnout DIAG
es: Desactivar DIAG
ja: 診断を無効化
nb_no: Sett DIAG av

source: Format
cs: Formát
es: Formatear
ja: フォーマット
nb_no: Formater

source: Filter by min channel
cs: Filtrování podle min. kanálu
es: Filtrar por canal mínimo
ja: 最小チャネルでフィルタ
nb_no: Filtrer etter minimum kanal

source: Remove min channel filter
cs: Odstranění filtru min. kanálu
es: Eliminar filtro de canal mínimo
ja: 最小チャネルのフィルタを削除
nb_no: Fjern minimum kanal filter

source: Filter by max channel
cs: Filtrování podle max. kanálu
es: Filtrar por canal máximo
ja: 最大チャネルでフィルタ
nb_no: Filtrer etter maksimal kanal

source: Remove max channel filter
cs: Odstranění filtru max. kanálu
es: Eliminar filtro de canal máximo
ja: 最大チャネルのフィルタを削除
nb_no: Fjern maksimal kanal filter

source: Unused space
cs: Nevyužitý prostor
es: Espacio no utilizado
ja: 未使用の領域
nb_no: Ubrukt plass

source: Only available if authentication by target is provided
cs: K dispozici, jen když je zadáno ověřování cílem
es: Solo disponible si se proporciona autenticación por destino
ja: ターゲットによる認証を指定した場合にのみ利用できます
nb_no: Bare tilgjengelig hvis autentisering av målet er gitt

source: Authentication by target
cs: Ověřování cílem
es: Autenticación por objetivo
ja: ターゲットによる認証
nb_no: Autentisering av målet

source: User name
cs: Uživatelské jméno
es: Nombre de usuario
ja: ユーザ名
nb_no: Brukernavn

source: Incorrect user name
cs: Nesprávné uživatelské jméno
es: Nombre de usuario incorrecto
ja: ユーザ名が正しくありません
nb_no: feil brukernavn

source: Incorrect password
cs: Nesprávné heslo
es: Contraseña incorrecta
ja: パスワードが正しくありません
nb_no: Feil passord

source: Authentication by initiator
cs: Ověření iniciátorem
es: Autenticación por iniciador
ja: イニシエータによる認証
nb_no: Autentisering av initiativtaker

source: Target Password
cs: Cílové heslo
es: Contraseña de destino
ja: ターゲットのパスワード
nb_no: Målets Passord

source: Discover iSCSI Targets
cs: Najít cílové stanice iSCSI
es: Descubrir los objetivos iSCSI
ja: iSCSI ターゲットの検出
nb_no: Oppdag iSCSI mål

source: Make sure you provide the correct values
cs: Ujistěte se, že jste zadali správné hodnoty
es: Asegúrese de proporcionar los valores correctos
ja: 正しい値を設定しているかどうかご確認ください
nb_no: Pass på at du oppgir riktige verdier

source: IP address
cs: adresa IP
es: Dirección IP
ja: IP アドレス
nb_no: IP addresse

source: Address
cs: Adresa
es: Dirección
ja: アドレス
nb_no: Addresse

source: Incorrect IP address
cs: Nesprávná IP adresa
es: Dirección IP incorrecta
ja: IP アドレスが正しくありません
nb_no: Feil IP addresse

source: Port
es: Puerto
ja: ポート

source: Incorrect port
cs: Nesprávný port
es: Puerto incorrecto
ja: ポートが正しくありません
nb_no: Feil port

source: Edit %s
cs: Upravit %s
es: Editar %s
ja: %s の編集
nb_no: Rediger %s

source: Edit iSCSI Initiator
cs: Upravit iniciátor iSCSI
es: Editar iniciador iSCSI
ja: iSCSI イニシエータの編集
nb_no: Rediger iSCSI initiativtaker

source: Initiator name
cs: Název iniciátora
es: Nombre del iniciador
ja: イニシエータ名
nb_no: Initiativtakers navn

source: Offload card
cs: Karta k přesměrování části (mobilního) provozu
es: Descargar tarjeta
ja: オフロードカード
nb_no: Avlastingskort

source: Initiator
cs: Iniciátor
es: Iniciador
ja: イニシエータ
nb_no: Initiativtaker

source: Login %s
cs: Přihlášení %s
es: Iniciar sesión %s
ja: %s にログイン
nb_no: Logg på %s

source: Startup
cs: Typ startu iSCSI
es: Puesta en marcha
ja: 起動
nb_no: Oppstart

source: On boot
cs: Při spuštění systému
es: En arranque
ja: システム起動時
nb_no: På oppstart

source: Connected (%s)
cs: Připojeno (%s)
es: Conectado (%s)
ja: 接続済み (%s)
nb_no: Tilkoblet (%s)

source: Login
cs: Přihlášení
es: Iniciar sesión
ja: ログイン
nb_no: Logg inn

source: Logout
cs: Odhlášení
es: Cerrar sesión
ja: ログアウト
nb_no: Logg ut

source: Portal
cs: Portál
ja: ポータル

source: Interface
cs: Rozhraní
es: Interfaz
ja: インターフェイス
nb_no: Grensesnitt

source: No iSCSI targets found.
cs: Nebyly nalezeny žádné cíle iSCSI.
es: No se encontraron objetivos iSCSI.
ja: iSCSI ターゲットが見つかりませんでした。
nb_no: Ingen iSCSI mål funnet.

source: Please, perform an iSCSI discovery in order to find available iSCSI targets.
cs: Spusťte vyhledávání iSCSI a tím najděte dostupné cíle iSCSI.
es: Realice una exploación de iSCSI para encontrar objetivos iSCSI disponibles.
ja: 利用可能な iSCSI ターゲットを検出するため、 iSCSI 検索を実施してください。
nb_no: Vennligst, utfør en iSCSI oppdagelse for å finne tilgjengelige iSCSI mål.

source: Discover iSCSI targets
cs: Zjištění cílů iSCSI
es: Descubrir objetivos iSCSI
ja: iSCSI ターゲットの検索
nb_no: Oppdag iSCSI mål

source: Discover
cs: Objevit
es: Descubrir
ja: 検索
nb_no: Oppdag

source: Targets
cs: Cíle
es: Objetivos
ja: ターゲット
nb_no: Mål

source: Delete current content
cs: Odstranit aktuální obsah
es: Eliminar el contenido actual
ja: 現在の内容を全て削除
nb_no: Slett gjeldende innhold

source: All partitions will be removed and any data in the disks will be lost.
cs: Všechny oddíly budou odstraněny a veškerá data na discích budou ztracena.
es: Se eliminarán todas las particiones y se perderán todos los datos de los discos.
ja: ディスク内の全てのパーティションを削除します。これにより、ディスク内に存在するデータは全て失われます。
nb_no: Alle partisjoner vil bli fjernet og alle data på diskene vil gå tapt.

source: deleting current content
cs: odstranění aktuálního obsahu
ja: 現在の内容を削除
nb_no: sletter gjeldende innhold

source: Shrink existing partitions
cs: Zmenšit stávající oddíly
es: Reducir las particiones existentes
ja: 既存のパーティションの縮小
nb_no: Krymp eksisterende partisjoner

source: The data is kept, but the current partitions will be resized as needed.
cs: Data zůstanou zachována, ale velikost aktuálních oddílů se podle potřeby změní.
es: Los datos se conservan, pero las particiones actuales cambiarán de tamaño según sea necesario.
ja: 既存のデータは保持しますが、十分な領域を確保するために既存のパーティションのサイズ変更を行います。
nb_no: Dataene beholdes, med de gjeldene partisjonene vil bli endret etter behov.

source: shrinking partitions
cs: zmenšování oddílů
ja: パーティションの縮小
nb_no: Krymper partisjoner

source: Use available space
cs: Využít dostupný prostor
es: Utilice el espacio disponible
ja: 利用可能な領域を使用する
nb_no: Bruk tilgjengelig plass

source: The data is kept. Only the space not assigned to any partition will be used.
cs: Data jsou uchována. Využije se pouze prostor, který není přiřazen žádnému oddílu.
es: Los datos se conservan. Sólo se utilizará el espacio que no esté asignado a ninguna partición.
ja: 既存のデータを全て保持します。パーティションに割り当てられていない空き領域のみを使用します。
nb_no: Dataene beholdes. Bare lagringsplassen som ikke er tilordnet noen partisjon vil bli brukt.

source: without modifying any partition
cs: bez úpravy jakéhokoli oddílu
es: sin modificar ninguna partición
ja: パーティションの変更を行いません
nb_no: uten å modifisere noen partisjon

source: Custom
cs: Vlastní
es: Personalizado
ja: 独自設定
nb_no: Tilpasset

source: Select what to do with each partition.
cs: Vyberte, co se má s jednotlivými oddíly dělat.
es: Seleccione qué hacer con cada partición.
ja: パーティションの設定作業を独自に実施します。
nb_no: Velg hva som skal skje med hver partisjon.

source: with custom actions
cs: s vlastními akcemi
ja: 独自の処理
nb_no: med tilpassede handlinger

source: Auto LUNs Scan
cs: Automatické skenování jednotek LUN
es: Escaneo automático de LUN
ja: 自動 LUN 検出
nb_no: Automatisk LUNs skanning

source: Activated
cs: Aktivováno
es: Activado
ja: 有効
nb_no: Aktivert

source: Deactivated
cs: Deaktivováno
es: Desactivado
ja: 無効
nb_no: Deaktivert

source: zFCP Disk Activation
cs: Aktivace disku zFCP
ja: zFCP ディスク有効化

source: zFCP Disk activation form
cs: Aktivační formulář zFCP disku
ja: zFCP ディスク有効化フォーム

source: The zFCP disk was not activated.
cs: Disk zFCP nebyl aktivován.
es: El disco zFCP no estaba activado.
ja: zFCP ディスクは有効化されませんでした。
nb_no: zFCP disken ble ikke aktivert.

source: Automatic LUN scan is [enabled]. Activating a controller which is running in NPIV mode will automatically configures all its LUNs.
cs: Automatické skenování LUN je [povoleno]. Aktivací řadiče, běžícího v režimu NPIV, se automaticky zkonfigurují všechny jeho LUN.
ja: 自動 LUN スキャンが [有効化] されています。 NPIV モードで動作しているコントローラを有効化した場合、その LUN は全て自動的に設定されます。

source: Automatic LUN scan is [disabled]. LUNs have to be manually configured after activating a controller.
cs: Automatické skenování LUN je [zakázáno]. Po aktivaci řadiče je třeba LUNy konfigurovat ručně.
ja: 自動 LUN スキャンが [無効化] されています。 LUN はコントローラの有効化後、手作業で設定しなければなりません。

source: Please, try to activate a zFCP disk.
cs: Zkuste aktivovat disk zFCP.
es: Por favor, intente activar un disco zFCP.
ja: zFCP ディスクの有効化をお試しください。
nb_no: Vennligst, prøv å aktivere en zFCP disk.

source: Please, try to activate a zFCP controller.
cs: Zkuste aktivovat řadič zFCP.
es: Por favor, intente activar un controlador zFCP.
ja: zFCP コントローラの有効化をお試しください。
nb_no: Vennligst, prøv å aktivere en zFCP kontroller.

source: No zFCP disks found.
cs: Nebyly nalezeny žádné disky zFCP.
es: No se encontraron discos zFCP.
ja: zFCP ディスクが見つかりませんでした。
nb_no: Ingen zFCP disker funnet.

source: Activate zFCP disk
cs: Aktivovat disk zFCP
es: Activar disco zFCP
ja: zFCP ディスクの有効化
nb_no: Aktiver zFCP disk

source: Activate new disk
cs: Aktivace nového disku
es: Activar nuevo disco
ja: 新しいディスクの有効化
nb_no: Aktiver ny disk

source: Disks
cs: Disky
es: Discos
ja: ディスク
nb_no: Disker

source: Controllers
cs: Řadiče
ja: コントローラ

source: No zFCP controllers found.
cs: Nebyly nalezeny žádné řadiče zFCP.
es: No se encontraron controladores zFCP.
ja: zFCP コントローラが見つかりませんでした。
nb_no: Ingen zFCP kontrollere funnet.

source: Read zFCP devices
cs: Načtení zařízení zFCP
es: Leer dispositivos zFCP
ja: zFCP デバイスの読み込み
nb_no: Les zFCP enheter

source: Define a user now
cs: Nyní definujte uživatele
es: Definir un usuario ahora
ja: 今すぐユーザを設定する
nb_no: Definer en bruker nå

source: No user defined yet.
cs: Zatím není definován žádný uživatel.
es: Ningún usuario definido todavía.
ja: ユーザを設定していません。
nb_no: Ingen bruker definert ennå.
