Repository: agama-project/agama
Catalog: service/po/*.po
Languages: ca, cs, de, es, fi, fr, id, it, ja, ka, nb_no, nl, pt_br, ru, sv, tr, uk

source: The device '%{device}' cannot be formatted because it is part of the MD RAID %{md_raid}
ca: El dispositiu %{device} no es pot formatar perquè forma part de la RAID MD %{md_raid}
cs: Zařízení ‘%{device}’ nelze naformátovat, protože je součástí MD RAID %{md_raid}
de: Das Gerät '%{device}' kann nicht formatiert werden, da es Teil des MD-RAID '%{md_raid}' ist
es: El dispositivo '%{device}' no puede ser formateado porque es parte del RAID MD %{md_raid}
fi: Laitetta ”%{device}” ei voi alustaa koska se on osa MD_RAIDia %{md_raid}
fr: Le périphérique '%{device}' ne peut pas être formaté, car il fait partie du MD RAID %{md_raid}
id: Perangkat ‘%{device}’ tidak dapat diformat karena merupakan bagian dari MD RAID %{md_raid}
it: Impossibile formattare il dispositivo '%{device}' perché fa parte del RAID MD %{md_raid}
ja: デバイス '%{device}' は MD RAID %{md_raid} の一部であるため、フォーマットできません
nl: Het apparaat '%{device}' kan niet worden geformateerd omdat deze onderdeel is van MD RAID %{md_raid}
pt_br: Não é possível formatar o dispositivo '%{device}' porque ele faz parte do MD RAID %{md_raid}
ru: Устройство „%{device}“ не может быть отформатировано, поскольку оно является частью MD RAID %{md_raid}
sv: Enheten '%{device}' kan inte formateras eftersom den är en del av MD RAID %{md_raid}
tr: '%{device}' aygıtı biçimlendirilemiyor çünkü MD RAID %{md_raid}'in bir parçası
uk: Пристрій «%{device}» не може бути відформатований, оскільки він є частиною MD RAID %{md_raid}

source: '%{method}' is not a suitable method to encrypt the physical volumes.
ca: El mètode %{method} no és un mètode adequat per encriptar els volums físics.
cs: ‘%{method}’ není vhodná metoda pro šifrování fyzických svazků.
de: '%{method}' ist keine geeignete Methode zur Verschlüsselung der physischen Volumes.
es: %{method} no es un método adecuado para cifrar los volúmenes físicos.
fi: Salaustapa ”%{method}” ei ole sopiva fyysisten taltioiden salaamiseen.
fr: '%{method}' n'est pas une méthode appropriée pour chiffrer les volumes physiques.
id: '%{method}' bukanlah metode yang sesuai untuk mengenkripsi volume fisik.
it: '%{method}' non è un metodo adatto per cifrare i volumi fisici.
ja: '%{method}' は物理ボリュームの暗号化方式として適切ではありません。
ka: '%{method}' ფიზიკური ტომების დასაშიფრად არ გამოგდგება.
nl: '%{method}' is geen geschikte methode voor het versleutelen van fysieke volumes.
pt_br: '%{method}' não é um método adequado para criptografar volumes físicos.
ru: '%{method}' не является подходящим методом для шифрования физических томов.
sv: '%{method}' är inte en lämplig metod för att kryptera de fysiska volymerna.
tr: '%{method}' fiziksel birimleri şifrelemek için uygun bir yöntem değildir.
uk: '%{method}' не є придатним методом для шифрування фізичних томів.

source: Mandatory device %s not found
ca: No s'ha trobat el dispositiu obligatori %s.
cs: Nezbytné zařízení %s nebylo nalezeno
de: Obligatorisches Gerät ‚%s‘ nicht gefunden
es: No se encuentra el dispositivo obligatorio %s
fi: Vaadittua laitetta %s ei löydy
fr: Périphérique obligatoire %s introuvable
id: Perangkat wajib %s tidak ditemukan
it: Dispositivo obbligatorio %s non trovato
ja: 必須のデバイス %s が見つかりませんでした
ka: აუცილებელი მოწყობილობა %s აღმოჩენილი არაა
nl: Verplicht apparaat %s niet gevonden
pt_br: O dispositivo obrigatório %s não foi encontrado
ru: Обязательное устройство %s не найдено
sv: Obligatorisk enhet %s hittades inte
tr: Zorunlu aygıt %s bulunamadı
uk: Обов'язковий пристрій %s не знайдено

source: Mandatory %s not found
ca: No s'ha trobat el tipus de dispositiu obligatori %s.
cs: Nezbytné %s nebylo nalezeno
de: Obligatorisches %s nicht gefunden
es: No se encuentra el dispositivo %s obligatorio
fi: Vaadittua %s ei löydy
fr: %s obligatoire introuvable
id: Wajib %s tidak ditemukan
it: %s obbligatoria non trovata
ja: 必須の %s が見つかりませんでした
ka: აუცილებელი %s აღმოჩენილი არაა
nl: Verplicht(e) %s niet gevonden
pt_br: %s obrigatório não encontrado
ru: Не найден обязательный элемент: %s
sv: Obligatorisk %s hittades inte
tr: Zorunlu %s bulunamadı
uk: Не знайдено обов'язковий елемент: %s

source: drive
ca: unitat
cs: jednotka
de: Laufwerk
es: unidad
fi: asema
fr: unité
it: unità
ja: ドライブ
ka: ამძრავი
nl: Schijf
pt_br: unidade
ru: диск
sv: disk
tr: sürücü
uk: накопичувач

source: MD RAID
ca: RAID MD
es: RAID MD
it: RAID MD
ru: RAID-МАССИВ MD
uk: RAID-МАСИВ MD

source: partition
ca: partició
cs: oddíl
es: partición
fi: osio
id: partisi
it: partizione
ja: パーティション
ka: დანაყოფი
nl: partitie
pt_br: partição
ru: раздел
tr: bölümleme
uk: розділ

source: LVM logical volume
ca: Volum lògic d'LVM
cs: Logický svazek LVM
de: Logisches LVM-Volume
es: Volumen lógico LVM
fi: Looginen LVM-taltio
fr: volume logique LVM
id: Volume logis LVM
it: Volume logico LVM
ja: LVM 論理デバイス
ka: LVM ლოგიკური ტომი
nl: LVM logisch volume
pt_br: Volumo lógico de LVM
ru: логический том LVM
sv: LVM logisk volym
tr: LVM mantıksal birimi
uk: логічний том LVM

source: device
ca: dispositiu
cs: zařízení
de: Gerät
es: dispositivo
fi: laite
fr: périphérique
id: perangkat
it: dispositivo
ja: デバイス
ka: მოწყობილობა
nl: apparaat
pt_br: dispositivo
ru: устройство
sv: enhet
tr: cihaz
uk: пристрій

source: There is a volume group without name
ca: Hi ha un grup de volums sense nom.
cs: Skupina svazků není pojmenovaná
de: Es ist eine Volume-Gruppe ohne Namen vorhanden
es: Hay un grupo de volúmenes sin nombre
fi: Nimetön taltioryhmä löytynyt
fr: Il existe un groupe de volumes sans nom
id: Ada grup volume tanpa nama
it: Esiste un gruppo di volumi senza nome
ja: 名前のないボリュームグループが存在しています
ka: არსებობს ტომების ჯგუფი სახელის გარეშე
nl: Er is een volume groep zonder naam
pt_br: Há um grupo de volumes sem nome
ru: Существует группа томов без имени
sv: Det finns en volymgrupp utan namn
tr: Adı olmayan bir birim grubu var
uk: Існує група томів без назви

source: There is no LVM physical volume with alias '%s'
ca: No hi ha cap volum físic d'LVM amb l'àlies %s.
cs: Neexistuje žádný fyzický svazek LVM s aliasem '%s'
de: Es ist kein physisches Volume mit dem Alias '%s' vorhanden
es: No existe ningún volumen físico LVM con alias "%s"
fi: Fyysistä LVM-taltiota aliaksella ”%s” ei ole
fr: Aucun volume physique LVM ne porte l'alias '%s'
id: Tidak ada volume fisik LVM dengan alias '%s'
it: Nessun volume fisico LVM con alias '%s'
ja: '%s' という別名の LVM 物理ボリュームはありません
ka: ფსევდონიმით '%s' LVM-ის ფიზიკური ტომი არ არსებობს
nl: Er is geen fysiek LVM volume met alias '%s'
pt_br: Não há volume físico LVM com alias '%s'
ru: Не существует физического тома LVM с псевдонимом '%s'
sv: Det finns ingen LVM fysisk volym med alias '%s'
tr: '%s' takma adlı LVM fiziksel birimi yok
uk: Фізичного тому LVM з псевдонімом '%s' не існує

source: The list of target devices for the volume group '%s' is mixing reused devices and new devices
ca: La llista de dispositius de destinació per al grup de volums %s barreja dispositius reutilitzats i de nous.
cs: Seznam cílových zařízení pro skupinu svazků '%s’ kombinuje znovu použitá zařízení a nová zařízení
de: In der Liste der Zielgerät für die Volume-Gruppe '%s' sind wiederverwendete Geräte und neue Geräte gemischt
es: La lista de dispositivos de destino para el grupo de volumenes %s mezcla dispositivos reutilizados y nuevos
fi: Taltioryhmän ”%s” luettelo kohdelaitteista sekoittaa uudelleenkäytettyjä laitteita ja uusia laitteita
fr: La liste des périphériques cibles pour le groupe de volumes '%s' mélange des périphériques réutilisés et de nouveaux périphériques
id: Daftar perangkat target untuk grup volume ‘%s’ mencampurkan perangkat yang digunakan kembali dan perangkat baru
it: L'elenco dei dispositivi di destinazione per il gruppo di volumi '%s' contiene una combinazione di dispositivi riutilizzati e nuovi
ja: ボリュームグループ '%s' に対するデバイス内に、再利用するデバイスと新規のデバイスの両方が混在しています
nl: De lijst van doel apparaaten voor volume groep '%s' is mengt hergebruikte en nieuwe apparaten
pt_br: A lista de dispositivos de destino para o grupo de volumes '%s' tem uma combinação de dispositivos novos e reutilizados
ru: В списке целевых устройств для группы томов „%s“ смешаны повторно используемые и новые устройства
sv: Listan över målenheter för volymgruppen '%s' blandar återanvända enheter och nya enheter
tr: '%s' birim grubu için hedef aygıtlar listesi yeniden kullanılan aygıtlar ile yeni aygıtları karıştırıyor
uk: У списку цільових пристроїв для групи томів «%s» змішані повторно використовувані та нові пристрої

source: There is no target device for LVM physical volumes with alias '%s'
ca: No hi ha cap dispositiu de destinació per als volums físics d'LVM amb l'àlies %s.
cs: Neexistuje žádné cílové zařízení pro fyzický svazek LVM s aliasem '%s'
de: Es gibt kein Zielgerät für physische LVM-Volumes mit dem Alias ‚%s‘
es: No existe dispositivo de destino para volúmenes físicos LVM con alias "%s"
fi: Fyysisille LVM-taltioillle aliaksella ”%s” ei ole kohdelaitetta
fr: Aucun périphérique cible pour les volumes physiques LVM ne porte l'alias '%s'
id: Tidak ada perangkat target untuk volume fisik LVM dengan alias '%s'
it: Nessun dispositivo di destinazione per i volumi fisici LVM con alias '%s'
ja: '%s' という別名の LVM 物理ボリュームはありません
ka: LVM-ის ფიზიკური ტომებისთვის სამიზნე მოწყობილობა ფსევდონიმით '%s' არ არსებობს
nl: Er is geen doelapparaat voor fysieke LVM volumes met alias '%s'
pt_br: Não há dispositivo de destino para volumes físicos LVM com alias '%s'
ru: Не существует целевого устройства для физических томов LVM с псевдонимом '%s'
sv: Det finns ingen LVM fysisk volym med alias '%s'
tr: '%s' takma adlı LVM fiziksel birimleri için hedef aygıt yok
uk: Для фізичних томів LVM з псевдонімом '%s' не існує цільового пристрою

source: The device '%s' is used several times as target device for physical volumes
ca: El dispositiu %s s'usa diverses vegades com a dispositiu de destinació per a volums físics.
cs: Zařízení '%s' je vícekrát použito jako cílové zařízení pro fyzické svazky
de: Das Gerät ‚%s‘ wird mehrfach als Zielgerät für physische Datenträger verwendet
es: El dispositivo "%s" se utiliza varias veces como dispositivo de destino para volúmenes físicos
fi: Laitetta ”%s” on käytetty useaan kertaan fyysisten taltioiden kohdelaitteena
fr: Le périphérique '%s' est utilisé plusieurs fois comme périphérique cible pour des volumes physiques
id: Perangkat '%s' digunakan beberapa kali sebagai perangkat target untuk volume fisik
it: Il dispositivo '%s' viene utilizzato diverse volte come dispositivo di destinazione per i volumi fisici
ja: デバイス '%s' は物理ボリュームとして複数回使用されています
ka: მოწყობილობა '%s' რამდენჯერმე გამოიყენება, როგორც სამიზნე მოწყობილობა ფიზიკური ტომებისთვის
nl: Het apparaat '%s' is meerdere keren gebruikt al doel apparaat voor fysieke volumes
pt_br: O dispositivo '%s' é usado várias vezes como dispositivo de destino para volumes físicos
ru: Устройство „%s“ несколько раз использовалось в качестве целевого устройства для физических томов
sv: Enheten '%s' används flera gånger som målenhet för fysiska volymer
tr: '%s' aygıtı fiziksel birimler için hedef aygıt olarak birkaç kez kullanıldı
uk: Пристрій '%s' використано кілька разів як цільовий пристрій для фізичних томів

source: Neither a file system nor a storage system was detected on the device. In case the device does contain a file system or a storage system that is not supported, resizing will most likely cause data loss.
ca: No s'ha detectat cap sistema de fitxers ni cap sistema d'emmagatzematge al dispositiu. En cas que el dispositiu contingui un sistema de fitxers o un sistema d'emmagatzematge que no sigui compatible, el canvi de mida probablement causarà la pèrdua de dades.
cs: V zařízení nebyl zjištěn systém souborů ani systém úložiště. Obsahuje-li zařízení nepodporovaný systém souborů nebo nepodporované úložiště, změna velikosti skoro jistě způsobí ztrátu dat.
de: Es wurde weder ein Dateisystem noch ein Speichersystem auf dem Gerät erkannt. Falls das Gerät ein Dateisystem oder ein Speichersystem enthält, das nicht unterstützt wird, führt die Größenänderung höchstwahrscheinlich zu Datenverlust.
es: No se detectó ni un sistema de archivos ni un sistema de almacenamiento en el dispositivo. En caso de que el dispositivo contenga un sistema de archivos o un sistema de almacenamiento que no sea compatible, cambiar el tamaño probablemente provocará la pérdida de datos.
fi: Tiedostojärjestelmää tai tallennusjärjestelmää ei havaittu laitteella. Mikäli laitteella on kuitenkin tiedosto- tai tallennusjärjestelmä jota ei tueta, laitteen koon muuttaminen aiheuttaa luultavasti tietojen häviämistä.
fr: Aucun système de fichiers ou de stockage n'a été détecté sur le périphérique. Si ce dernier contient un système de fichiers ou de stockage non pris en charge, le redimensionnement entraînera très probablement une perte de données.
id: Baik sistem berkas maupun sistem penyimpanan tidak terdeteksi pada perangkat. Jika perangkat memiliki sistem berkas atau sistem penyimpanan yang tidak didukung, mengubah ukuran kemungkinan besar akan menyebabkan hilangnya data.
it: Nessun file system né sistema di memorizzazione rilevato sul dispositivo. Qualora il dispositivo contenga un file system o un sistema di memorizzazione non supportato, con ogni probabilità il ridimensionamento comporterà una perdita di dati.
ja: デバイス内にはファイルシステムとストレージシステムのどちらも検出されませんでした。サポート対象外のファイルシステムやストレージシステムをお使いの場合、サイズの縮小を行うとデータが失われる危険性があります。
nl: Er is geen bestandssysteem of opslag systeem gedetecteerd op het apparaat. In het geval dat het apparaat wel een bestandssysteem of opslagsysteem dat niet wordt ondersteund, zal het aanpassen van de grootte zeer waarschijnlijk leiden tot gegevensverlies.
pt_br: Nem um sistema de arquivo nem um sistema de armazenamento foi detectado no dispositivo. Caso o dispositivo contenha um sistema de arquivo ou um sistema de armazenamento que não seja suportado, o redimensionamento provavelmente causará perda de dados.
ru: На устройстве не обнаружено ни файловой системы, ни системы хранения данных. Если устройство содержит файловую систему или систему хранения данных, которая не поддерживается, изменение размера, скорее всего, приведет к потере данных.
sv: Varken ett filsystem eller ett lagringssystem upptäcktes på enheten. Om enheten innehåller ett filsystem eller ett lagringssystem som inte stöds, kommer storleksändring med största sannolikhet orsaka dataförlust.
tr: Cihazda ne bir dosya sistemi ne de bir depolama sistemi algılanmadı. Cihazın desteklenmeyen bir dosya sistemi veya depolama sistemi içermesi durumunda, yeniden boyutlandırma büyük olasılıkla veri kaybına neden olacaktır.
uk: На пристрої не виявлено ані файлової системи, ані системи зберігання даних. Якщо пристрій містить файлову систему або систему зберігання даних, які не підтримуються, зміна розміру, найімовірніше, призведе до втрати даних.

source: Shrinking is not supported by this device
ca: Aquest dispositiu no admet l'encongiment.
cs: Toto zařízení nepodporuje zmenšování
de: Verkleinern wird von diesem Gerät nicht unterstützt
es: Este dispositivo no admite la reducción
fi: Tämä laite ei tue koon pienentämistä
fr: Ce périphérique ne prend pas en charge la réduction
id: Penyusutan tidak didukung oleh perangkat ini
it: La riduzione non è supportata da questo dispositivo
ja: このデバイスはサイズ縮小に対応していません
ka: ამ მოწყობილობაზე დაპატარავება მხარდაჭერილი არაა
nl: Verkleinen wordt niet ondersteund door dit apparaat
pt_br: O encolhimento não é suportado por este dispositivo
ru: Уменьшение размера не поддерживается этим устройством
sv: Krympning stöds inte på den här enheten
tr: Bu cihaz küçültmeyi desteklemiyor
uk: Цей пристрій не підтримує стискання

source: Copying important installation files to the target system
ca: Copiant fitxers d'instal·lació importants al sistema de destinació
cs: Kopírování důležitých instalačních souborů do cílového systému
de: Wichtige Installationsdateien werden auf das Zielsystem kopiert
es: Copiando archivos de instalación importantes al sistema de destino
fi: Kopioidaan tärkeitä asennustiedostoja kohdejärjestelmään
fr: Les fichiers d'installation importants sont en cours de copie vers le système cible
id: Menyalin berkas instalasi penting ke sistem tujuan
it: Copia di importanti file di installazione nel sistema di destinazione
ja: インストール先のシステムに重要なインストールファイルをコピーしています
ka: დაყენებისთვის აუცილებელი ფაილების კოპირება სამიზნე სისტემაში
nl: Belangrijke installatie bestanden worden gekopieerd naar het doel systeem
pt_br: Copiar arquivos de instalação importantes para o sistema de destino
ru: Копирование важных установочных файлов в целевую систему
sv: Kopierar viktiga installationsfiler till målsystemet
tr: Önemli kurulum dosyalarının hedef sisteme kopyalanması
uk: Копіювання важливих інсталяційних файлів до цільової системи

source: Writing Linux Security Modules configuration
ca: Escrivint la configuració dels mòduls de seguretat de Linux
cs: Zapisuji konfiguraci bezpečnostních modulů Linuxu
de: Konfiguration der Linux-Sicherheitsmodule wird geschrieben
es: Escribiendo configuración de módulos de seguridad de Linux
fi: Kirjoitetaan Linuxin tietoturvamoduuleiden (LSM) asetuksia
fr: La configuration des modules de sécurité Linux est en cours d'écriture
id: Menulis konfigurasi Modul Keamanan Linux
it: Scrittura della configurazione dei moduli di sicurezza Linux
ja: Linux セキュリティモジュールの設定を書き込んでいます
ka: იწერება Linux-ის უსაფრთხოების მოდულების კონფიგურაცია
nl: Wegschrijven configuratie van Linux beveiligingsmodules
pt_br: Escrevendo a configuração dos Módulos de Segurança do Linux
ru: Запись конфигурации модулей безопасности Linux
sv: Skriver Linuxsäkerhetsmoduler konfiguration
tr: Linux Güvenlik Modülleri yapılandırmasını yazma
uk: Запис конфігурації модулів безпеки Linux

source: Installing bootloader
ca: Instal·lant el carregador d'arrencada
cs: Instalace zavaděče
de: Bootloader wird installiert
es: Instalando cargador de arranque
fi: Asennetaan käynnistyslatainta
fr: Le chargeur d'amorçage est en cours d'installation
id: Menginstal bootloader
it: Installazione del bootloader
ja: ブートローダをインストールしています
ka: მიმდინარეობს ჩამტვირთავის დაყენება
nl: Bootloader wordt geinstalleerd
pt_br: Instalando o bootloader
ru: Установка загрузчика
sv: Installerar starthanterare
tr: Önyükleyiciyi yükleme
uk: Встановлення завантажувача

source: Adjusting storage configuration
ca: Ajustant la configuració d'emmagatzematge
cs: Nastavování konfigurace úložiště
de: Speicherkonfiguration wird angepasst
es: Ajustando configuración de almacenamiento
fi: Tallennustilan asetusten muuttaminen
fr: La configuration de stockage est en cours d'ajustement
id: Menyesuaikan konfigurasi penyimpanan
it: Regolazione della configurazione di memorizzazione
ja: ストレージ設定を調整しています
ka: საცავის კონფიგურაციის მორგება
nl: Aanpassen van de opslag configuratie
pt_br: Ajustando a configuração de armazenamento
ru: Настройка конфигурации хранилища
sv: Justerar lagringskonfiguration
tr: Depolama yapılandırmasını ayarlama
uk: Налаштування конфігурації сховища

source: Adjusting iSCSI configuration
ca: Ajustant la configuració d'iSCSI
cs: Nastavování konfigurace iSCSI
de: iSCSI-Konfiguration wird angepasst
es: Ajustando configuración iSCSI
fi: Määritetään iSCSI-asetuksia
fr: La configuration iSCSI est en cours d'ajustement
id: Menyesuaikan konfigurasi iSCSI
it: Regolazione della configurazione iSCSI
ja: iSCSI 設定を調整しています
ka: iSCSI-ის კონფიგურაციის მორგება
nl: Aanpassen van de iSCSI configuratie
pt_br: Ajustando a configuração do iSCSI
ru: Настройка конфигурации iSCSI
sv: Justerar iSCSI konfiguration
tr: iSCSI yapılandırmasını ayarlama
uk: Налаштування конфігурації iSCSI

source: Configuring file systems snapshots
ca: Configurant les instantànies dels sistemes de fitxers
cs: Konfigurovování snímků souborového systému
de: Dateisystem-Schnappschüsse werden konfiguriert
es: Configurando instantáneas del sistema de archivos
fi: Tehdään tiedostojärjestelmien tilannevedosten asetuksia
fr: Les instantanés des systèmes de fichiers sont en cours de configuration
id: Konfigurasi snapshot sistem berkas
it: Configurazione delle istantanee dei file system
ja: ファイルシステムのスナップショットを設定しています
ka: ფაილური სისტემის სწრაფი ასლების მორგება
nl: Configureer snapshots van het bestandssysteem
pt_br: Configurando cópia instantânea de sistemas de arquivos
ru: Настройка моментальных снимков файловых систем
sv: Konfigurerar filsystemsögonblicksavbilder
tr: Dosya sistemi anlık görüntülerini yapılandırma
uk: Налаштування моментальних знімків файлових систем

source: Copying logs
ca: Copiant registres
cs: Kopírování protokolů
de: Protokolle werden kopiert
es: Copiando registros
fi: Kopioidaan lokeja
fr: Les journaux sont en cours de copie
id: Menyalin log
it: Copia dei log
ja: ログをコピーしています
ka: ჟურნალის კოპირება
nl: Kopieren van logs
pt_br: Copiando registros
ru: Копирование журналов
sv: Kopierar loggar
tr: Günlükleri kopyalama
uk: Копіювання журналів

source: Running user-defined scripts
ca: Executant els scripts definits per l'usuari
cs: Spouštění uživatelských skriptů
de: Benutzerdefinierte Skripte werden ausgeführt
es: Ejecutando comandos definidos por el usuario
fi: Suoritetaan käyttäjän määrittämät komentojonot
fr: Les scripts définis par l'utilisateur sont en cours d'exécution
id: Menjalankan skrip yang didefinisikan pengguna
it: Esecuzione degli script definiti dall'utente
ja: ユーザ定義のスクリプトを実行しています
ka: მომხმარებლის სკრიპტების შესრულება
nl: Uitvoeren van gebruiker-gedefinieerde scripts
pt_br: Executando scripts definidos pelo usuário
ru: Выполнение пользовательских скриптов
sv: Kör användardefinierade skript
tr: Kullanıcı tanımlı betikleri çalıştırma
uk: Виконання користувацьких скриптів

source: Deploying user-defined files
ca: Desplegant els fitxers definits per l'usuari
cs: Nasazování uživatelsky definovaných souborů
de: Benutzerdefinierte Dateien werden bereitgestellt
es: Implementando los archivos definidos por el usuario
fi: Viedään käyttöön käyttäjän määrittämät tiedostot
fr: Les fichiers définis par l'utilisateur sont en cours de déploiement
id: Menerapkan berkas yang didefinisikan pengguna
it: Distribuzione dei file definiti dall'utente
ja: ユーザ定義のファイルを配置しています
ka: მომხმარებლის ფაილების გაშლა
nl: Uitrol van gebruiker-gedefinieerde bestanden
pt_br: Implementando arquivos definidos pelo usuário
ru: Развертывание пользовательских файлов
sv: Utplacerar användardefinierade filer
tr: Kullanıcı tanımlı dosyaları dağıtma
uk: Розгортання користувацьких файлів

source: Unmounting storage devices
ca: Desmuntant dispositius d'emmagatzematge
cs: Odpojuji úložná zařízení
de: Speichergeräte werden ausgehängt
es: Desmontando dispositivos de almacenamiento
fi: Irrotetaan tallennuslaitteita
fr: Les périphériques de stockage sont en cours de démontage
id: Melepas perangkat penyimpanan
it: Smontaggio dei dispositivi di memorizzazione
ja: ストレージデバイスのマウントを解除しています
ka: საცავის მოწყობილობების მოხსნა
nl: Ontkoppelen van opslag apparaten
pt_br: Desmontando dispositivos de armazenamento
ru: Размонтирование накопителей
sv: Avmonterar lagringsenheter
tr: Depolama aygıtlarının bağlantısını kesme
uk: Розмонтування пристроїв зберігання

source: Logout iSCSI targets
ca: Surt de la sessió dels objectius iSCSI
cs: Odhlásit iSCSI cíle
de: iSCSI-Ziele abmelden
es: Cerrar sesión en destinos iSCSI
fi: Kirjaudutaan ulos iSCSI-kohteista
fr: Déconnecter les cibles iSCSI
id: Keluar dari target iSCSI
it: Chiudi destinazioni iSCSI
ja: iSCSI ターゲットからのログアウト
ka: გასვლა iSCSI სამიზნეებიდან
nl: iSCSI doelen uitloggen
pt_br: Fazer logout dos destinos iSCSI
ru: Выход из iSCSI-целей
sv: Logga ut iSCSI-mål
tr: iSCSI hedeflerinden çıkış yapın
uk: Вихід із iSCSI-цілей
