Repository: agama-project/agama
Catalog: service/po/*.po
Languages: ca, cs, de, es, fi, fr, id, it, ja, ka, nb_no, nl, pt_br, ru, sv, tr, uk

source: Found unsupported elements in the AutoYaST profile: %{keys}.
ca: S'han trobat elements no compatibles al perfil d'AutoYaST: %{keys}.
cs: Nalezen nepodporovaný prvek profilu AutoYaST: %{keys}.
de: Nicht unterstützte Elemente im AutoYaST-Profil gefunden: %{keys}.
es: Se han encontrado elementos no admitidos en el perfil de AutoYaST: %{keys}.
fi: AutoYaST-profiilissa löydettiin tukemattomia kohita: %{keys}.
fr: Éléments non pris en charge trouvés dans le profil AutoYaST : %{keys}.
id: Menemukan elemen yang tidak didukung dalam profil AutoYaST: %{keys}.
it: Trovati elementi non supportati nel profilo AutoYaST: %{keys}.
ja: AutoYaST プロファイル内にサポートされていない要素が見つかりました: %{keys}.
ka: აღმოჩენილია მხარდაუწერელი ელემენტები AutoYaST-ის პროფილში: {keys}.
nl: Niet-ondersteunde elementen in het AutoYaST-profiel gevonden: %{keys}.
pt_br: Foram encontrados elementos não suportados no perfil do AutoYaST: %{keys}.
ru: Найдены неподдерживаемые элементы в профиле AutoYaST: %{keys}.
sv: Hittade ostödda element i AutoYaST-profilen: %{keys}.
tr: AutoYaST Profilinde desteklenmeyen elemanlar bulundu: %{keys}.
uk: Знайдено непідтримувані елементи у профілі AutoYaST: %{keys}.

source: Analyze disks
ca: Anàlisi dels discs
cs: Analyzovat disky
de: Festplatten analysieren
es: Analizar discos
fi: Levyjen analysointi
fr: Analyser les disques
id: Menganalisis disk
it: Analizza dischi
ja: ディスクの分析
ka: დისკების ანალიზი
nb_no: Analyser disker
nl: Analyseer schijven
pt_br: Analizar discos
ru: Анализ дисков
sv: Analysera diskar
tr: Diskleri incele
uk: Аналіз дисків

source: Configure software
ca: Configuració del programari
cs: Konfigurovat software
de: Software konfigurieren
es: Configurar software
fi: Ohjelmistojen asetukset
fr: Configurer les logiciels
id: Mengkonfigurasi perangkat lunak
it: Configura software
ja: ソフトウエアの設定
ka: პროგრამების მორგება
nb_no: Konfigurer programvare
nl: Configureer software
pt_br: Configurar software
ru: Настройка программного обеспечения
sv: Konfigurera programvara
tr: Yazılımı yapılandır
uk: Налаштування програмного забезпечення

source: Prepare disks
ca: Preparació dels discs
cs: Připravit disky
de: Festplatten vorbereiten
es: Preparar discos
fi: Levyjen valmistelu
fr: Préparer les disques
id: Siapkan disk
it: Prepara dischi
ja: ディスクの準備
ka: დისკების მომზადება
nb_no: Klargjør disker
nl: Prepareer schijven
pt_br: Preparar discos
ru: Подготовка дисков
sv: Förbered diskar
tr: Diskleri hazırla
uk: Підготовка дисків

source: Install software
ca: Instal·lació de programari
cs: Instalovat software
de: Software installieren
es: Instalar software
fi: Asenna ohjelmistoja
fr: Installer les logiciels
id: Instal perangkat lunak
it: Installa software
ja: ソフトウエアのインストール
ka: პროგრამების დაყენება
nb_no: Installer programvare
nl: Installeer software
pt_br: Instalar software
ru: Установка программного обеспечения
sv: Installera programvara
tr: Yazılımı yükle
uk: Встановлення програмного забезпечення

source: Configure the system
ca: Configuració del sistema
cs: Nakonfigurovat systém
de: System konfigurieren
es: Configurar el sistema
fi: Tee järjestelmän asetukset
fr: Configurer le système
id: Konfigurasikan sistem
it: Configura il sistema
ja: システムの設定
ka: სისტემის მორგება
nb_no: Konfigurer systemet
nl: Configureer het systeem
pt_br: Configurar o sistema
ru: Настройка системы
sv: Konfigurera systemet
tr: Sistemi yapılandır
uk: Налаштування системи

source: Load software translations
ca: Carrega les traduccions del programari
cs: Načíst překlady softwaru
de: Softwareübersetzungen laden
es: Cargar traducciones de software
fi: Lataa ohjelmistojen käännökset
fr: Charger les traductions des logiciels
id: Memuat terjemahan perangkat lunak
it: Carica le traduzione del programma
ja: ソフトウエアの翻訳の読み込み
ka: პროგრამის თარგმანების ჩატვირთვა
nb_no: Last inn oversettelser for programvare
nl: Laad software vertalingen
pt_br: Carregar traduções de software
ru: Загрузка переводов программ
sv: Laddar översättningar av programvara
tr: Yazılım çevirilerini yükle
uk: Завантаження перекладів програмного забезпечення

source: Load storage translations
ca: Carrega les traduccions de l'emmagatzematge
cs: Načíst překlady paměti
de: Übersetzungen im Speicher laden
es: Cargar traducciones de almacenamiento
fi: Lataa tallennustilan käännökset
fr: Charger les traductions du stockage
id: Memuat terjemahan penyimpanan
it: Carica le traduzione dello spazio di memorizzazione
ja: ストレージの翻訳の読み込み
ka: საცავის თარგმანების ჩატვირთვა
nb_no: Last inn oversettelser for lagring
nl: Laad opslag vertalingen
pt_br: Traduções de armazenamento de carga
ru: Загрузка переводов хранения
sv: Laddar översättningar för lagring
tr: Depolama alanı çevirilerini yükleyin
uk: Завантаження перекладів зі сховища

source: Trying to import a self signed certificate. Do you want to trust it and register the product?
ca: S'intenta importar un certificat autosignat. Voleu confiar-hi i registrar el producte?
cs: Pokoušíte se importovat certifikát, který je podepsaný sám sebou. Chcete mu důvěřovat a zaregistrovat tento produkt?
de: Es wird versucht, ein eigensigniertes Zertifikat zu importieren. Möchten Sie ihm vertrauen und das Produkt registrieren?
es: Intentando importar un certificado autofirmado. ¿Desea confiar en él y registrar el producto?
fi: Yritetään tuoda itse allekirjoitettua varmennetta. Luotetaanko siihen ja rekisteröidään tuote?
fr: Vous essayez d'importer un certificat auto-signé. Voulez-vous l'approuver et enregistrer le produit ?
id: Mencoba mengimpor sertifikat yang ditandatangani sendiri. Apakah Anda ingin mempercayainya dan mendaftarkan produk?
it: Tentativo di importare un certificato autofirmato. Considerarlo attendibile e registrare il prodotto?
ja: 自己署名の証明書を取り込もうとしています。この証明書を信頼して製品を登録してよろしいですか？
nl: Probeer een zelf ondertekend certificaat te importeren. Wil je deze vertrouwen en het product registreren?
pt_br: Tentando importar um certificado autoassinado. Deseja confiar nele e registrar o produto?
ru: Попытка импортировать самоподписанный сертификат. Хотите ли вы доверять ему и зарегистрировать продукт?
sv: Försöker importera ett självsignerat certifikat. Vill du lita på det och registrera produkten?
tr: Kendi kendine imzalanmış bir sertifikayı içe aktarmaya çalışıyorum. Ona güvenmek ve ürünü kaydetmek ister misiniz?
uk: Спроба імпортувати самопідписаний сертифікат. Чи хочете Ви довіряти йому і зареєструвати продукт?

source: Try again
ca: Torna-ho a provar
cs: Zkusit znovu
de: Erneut versuchen
es: Volver a intentar
fi: Yritä uudelleen
fr: Réessayer
id: Coba lagi
it: Riprova
ja: 再試行
ka: თავიდან სცადეთ
nl: Opnieuw proberen
pt_br: Tentar novamente
ru: Повторить попытку
sv: Försök igen
tr: Tekrar deneyin
uk: Спробуйте ще раз

source: Continue anyway
ca: Continua tanmateix
cs: Přesto pokračovat
de: Trotzdem fortfahren
es: Continuar de todos modos
fi: Jatka joka tapauksessa
fr: Poursuivre malgré tout
id: Lanjutkan saja
it: Continua comunque
ja: 無視して続行
ka: მაინც გაგრძელება
nl: Toch doorgaan
pt_br: Continuar mesmo assim
ru: Всё равно продолжить
sv: Fortsätt ändå
tr: Yine de devam et
uk: Все одно продовжити

source: Abort installation
ca: Avorta la instal·lació
cs: Přerušit instalaci
de: Installation abbrechen
es: Cancelar instalación
fi: Keskeytä asennus
fr: Abandonner l'installation
id: Batalkan instalasi
it: Interrompi installazione
ja: インストールの中止
ka: დაყენების შეწყვეტა
nl: Installatie annuleren
pt_br: Interromper instalação
ru: Прервать установку
sv: Avbryt installationen
tr: Kurulumu iptal et
uk: Перервати встановлення

source: Skip
ca: Omet
cs: Přeskočit
de: Überspringen
es: Saltar
fi: Ohita tämä kohta
fr: Ignorer
id: Lewati
it: Salta
ja: 飛ばす
ka: გამოტოვება
nl: Overslaan
pt_br: Pular
ru: Пропустить
sv: Hoppa över
tr: Atla
uk: Пропустити

source: Yes
ca: Sí
cs: Ano
de: Ja
es: Sí
fi: Kyllä
fr: Oui
id: Ya
it: Sì
ja: はい
ka: დიახ
nl: Ja
pt_br: Sim
ru: Да
sv: Ja
tr: Evet
uk: Так

source: No
cs: Ne
de: Nein
fi: Ei
fr: Non
id: Tidak
ja: いいえ
ka: არა
nl: Nee
pt_br: Não
ru: Нет
sv: Nej
tr: Hayır
uk: Ні

source: No checksum for the file %{file} was found in the repository. This means that although the file is part of the signed repository, the list of checksums does not mention this file. Use it anyway?
ca: No s'ha trobat cap suma de comprovació per al fitxer %{file} al repositori. Això vol dir que tot i que el fitxer forma part del repositori signat, la llista de sumes de comprovació no esmenta aquest fitxer. Voleu usar-lo tanmateix?
cs: Pro soubor %{file} nebyl v repozitáři nalezen kontrolní součet. To znamená, že ačkoliv je soubor součástí podepsaného repozitáře, seznam kontrolních součtů tento soubor nezmiňuje. Chcete jej i přesto použít?
de: Es wurde keine Prüfsumme für die Datei "%{file}" im Repository gefunden. Das bedeutet, dass diese Datei nicht in der Liste der Prüfsummen erwähnt wird, obwohl die Datei Teil des signierten Repositorys ist. Trotzdem verwenden?
es: No se ha encontrado ninguna suma de comprobación para el archivo %{file} en el repositorio. Eso significa que aunque el archivo sea parte del repositorio firmado, la lista de sumas de comprobación no menciona este archivo. ¿Quiere usarlo de todas formas?
fi: Tarkistussummaa tiedostolle %{file} ei löydy ohjelmalähteestä. Tämä tarkoittaa että vaikka tiedosto on osa allekirjoitettua ohjelmalähdettä, tarkistussummien luettelossa ei ole mainintaa tästä tiedostosta. Käytetäänkö sitä tästä huolimatta?
fr: Aucune somme de contrôle pour le fichier %{file} n'a été trouvée dans le dépôt. Cela signifie que bien que le fichier fasse partie du dépôt signé, la liste des sommes de contrôle ne mentionne pas ce fichier. Voulez-vous l'utiliser malgré tout ?
id: Tidak ditemukan checksum untuk berkas %{file} di repositori. Hal ini berarti meskipun berkas tersebut merupakan bagian dari repositori yang ditandatangani, daftar checksum tidak mencantumkan berkas ini. Apakah tetap ingin menggunakannya?
it: Nessun codice di controllo per il file %{file} trovato nel repository . Ciò significa che il file appartiene al repository firmato, ma l'elenco dei codici di controllo non fa riferimento a tale file. Utilizzarlo comunque?
ja: ファイル %{file} に対するチェックサムがリポジトリ内に書かれていません。このことから、このファイルは署名されたリポジトリの一部ではあるものの、このファイルに対する設定が存在していないことを表しています。このファイルを使用してよろしいですか？
nl: Geen controlesom voor het bestand %{file} gevonden in de opslagruimte. Dit betekent dat hoewel het bestand onderdeel is van een ondertekende opslagruimtec, de lijst met controlesommen dit bestand niet vermeld. Desondanks gebruiken?
pt_br: Não há soma de verificação para o arquivo %{file} no repositório. Isso significa que o arquivo faz parte do repositório assinado, mas a lista de somas de verificação não menciona esse arquivo. Usá-lo mesmo assim?
ru: В репозитории не найдена контрольная сумма для файла %{file}. Это означает, что хотя файл является частью подписанного репозитория, в списке контрольных сумм он не упоминается. Использовать его в любом случае?
sv: Ingen kontrollsumma för filen %{file} hittades i förrådet. Det betyder att även om filen är en del av det signerade förrådet, nämns inte filen i listan över kontrollsummor. Vill du använda den ändå?
tr: Depoda %{file} dosyası için bir sağlama toplamı bulunamadı. Bu, dosya imzalanmış deponun bir parçası olmasına rağmen sağlama toplamları listesinin bu dosyadan bahsetmediği anlamına gelir. Yine de kullanılsın mı?
uk: У сховищі не знайдено контрольної суми для файлу %{file}. Це означає, що хоча файл є частиною підписаного сховища, у списку контрольних сум він не згадується. Використовувати його в будь-якому випадку?

source: The checksum of the file %{file} is "%{digest}" but the expected checksum is unknown. This means that the origin and integrity of the file cannot be verified. Use it anyway?
ca: La suma de comprovació del fitxer %{file} és %{digest}, però la suma de comprovació esperada és desconeguda. Això vol dir que l'origen i la integritat del fitxer no es poden verificar. Voleu usar-lo tanmateix?
cs: Kontrolní součet souboru %{file} je "%{digest}”, ale očekávaná hodnota kontrolního součtu není známa. Původ a integrita souboru nemohou být ověřeny. Chcete jej přesto použít?
de: Die Prüfsumme der Datei "%{file}" lautet "%{digest}", aber die erwartete Prüfsumme ist unbekannt. Der Ursprung und die Integrität der Datei können nicht überprüft werden. Trotzdem verwenden?
es: La suma de comprobación del archivo %{file} es "%{digest}", pero la suma de comprobación esperada es desconocida. Eso significa que el origen y la integridad del archivo no se pueden verificar. ¿Desea usarlo de todas formas?
fi: Tarkistussumma tiedostolle %{file} on "%{digest}" mutta odotettua tarkistussummaa ei tiedetä. Tämä tarkoittaa että tiedoston alkuperää ja eheyttä ei voida vahvistaa. Käytetäänkö sitä tästä huolimatta?
fr: La somme de contrôle du fichier %{file} est "%{digest}", mais la somme de contrôle attendue est inconnue. Cela signifie que l'origine et l'intégrité du fichier ne peuvent pas être vérifiées. Voulez-vous l'utiliser malgré tout ?
id: Checksum berkas %{file} adalah “%{digest}”, tetapi checksum yang diharapkan tidak diketahui. Hal ini berarti asal usul dan integritas berkas tidak dapat diverifikasi. Apakah tetap ingin menggunakannya?
it: Il codice di controllo del file %{file} è "%{digest}", ma il codice di controllo previsto è sconosciuto. Ciò significa non è possibile verificare l'origine e l'integrità del file. Utilizzarlo comunque?
ja: ファイル %{file} のチェックサムは "%{digest}" になっていますが、正しいチェックサムが不明です。そのため、このファイルの正当性が確認できません。このファイルを使用してよろしいですか？
nl: De controlesom van het bestand %{file} is %{digest} maar de verwachte controlesom is onbekend. De herkomst en integriteit van het bestand kan niet worden gecontroleerd. Desondanks gebruiken?
pt_br: A soma de verificação do arquivo %{file} é "%{digest}", mas a soma de verificação esperada é desconhecida. Isso significa que não é possível verificar a origem e a integridade do arquivo. Usá-lo mesmo assim?
ru: Контрольная сумма файла %{file} равна «%{digest}», но ожидаемая контрольная сумма неизвестна. Это означает, что происхождение и целостность файла не могут быть проверены. Все равно использовать его?
sv: Kontrollsumman för filen %{file} är "%{digest}" men den förväntade kontrollsumman är okänd. Det betyder att filens ursprung och integritet inte kan verifieras. Vill du använda den ändå?
tr: %{file} dosyasının kontrol toplamı "%{digest}" ancak beklenen kontrol toplamı bilinmiyor. Bu, dosyanın kökeninin ve bütünlüğünün doğrulanamayacağı anlamına geliyor. Yine de kullanılsın mı?
uk: Контрольна сума файлу %{file} дорівнює «%{digest}», але очікувана контрольна сума невідома. Це означає, що походження і цілісність файлу не можуть бути перевірені. Все одно використовувати його?

source: The expected checksum of file %{file} is "%{found}" but it was expected to be "%{expected}". The file has changed by accident or by an attacker since the creater signed it. Use it anyway?
ca: La suma de comprovació esperada del fitxer %{file} és %{found} però s'esperava que fos %{expected}. El fitxer ha canviat per accident o per un atacant des que el creador el va signar. Voleu usar-lo tanmateix?
cs: Očekávaný kontrolní součet souboru %{file} je "%{found}”, avšak byl očekáván "%{expected}”. Buďto se soubor změnil náhodou nebo to po publikování tvůrcem balíčku provedl útočník. Chcete jej i přesto použít?
de: Die erwartete Prüfsumme der Datei "%{file}" lautet "%{found}", es wurde aber "%{expected}" erwartet. Die Datei wurde versehentlich oder durch einen Angreifer geändert, seit der Ersteller sie signiert hat. Trotzdem verwenden?
es: La suma de verificación del archivo %{file} es "%{found}", pero se esperaba que fuera "%{expected}". El archivo ha cambiado por accidente o ha sufrido un ataque desde que el creador lo firmó. ¿Desea usarlo de todas formas?
fi: Tarkistussumma tiedostolle %{file} on "%{found}" mutta sen odotettiin olevan "%{expected}". Tiedosto on muuttunut vahingossa tai hyökkääjän toimesta sen luomisen jälkeen. Käytetäänkö sitä tästä huolimatta?
fr: La somme de contrôle du fichier %{file} est "%{found}", mais la valeur attendue était "%{expected}". Le fichier a été modifié par accident ou par un attaquant depuis que son créateur l'a signé. Voulez-vous l'utiliser malgré tout ?
id: Checksum yang diharapkan untuk berkas %{file} adalah “%{found}”, tetapi seharusnya “%{expected}”. Berkas ini telah berubah secara tidak sengaja atau oleh penyerang sejak pembuatnya menandatanganinya. Apakah tetap ingin menggunakannya?
it: Il codice di controllo previsto per il file %{file} è "%{found}", ma doveva essere"%{expected}". Il file è stato modificato accidentalmente o dall'autore di un attacco da quando il creatore lo ha firmato. Utilizzarlo comunque?
ja: ファイル %{file} のチェックサムは "%{found}" ですが、正しくは "%{expected}" であるべきものです。作成者が署名したあと、何らかの事故で書き換わってしまったか、もしくは不正な攻撃者が書き換えた可能性があります。このファイルを使用してよろしいですか？
nl: De verwachte controlesom van bestand %{file} is "%{found}" maar de waarde bleek "%{expected}". Het bestand is per ongeluk gewijzigd of is door een aanvaller aangepast nadat deze door de maker is gesigneerd. Desondanks gebruiken?
pt_br: A soma de verificação esperada do arquivo %{file} é "%{found}", mas era esperado que fosse "%{expected}". O arquivo foi alterado por engano ou por um invasor desde que o criador a assinou. Usá-lo mesmo assim?
ru: Ожидаемая контрольная сумма файла %{file} равна «%{found}», а должна была быть «%{expected}». Файл был изменен случайно или злонамеренно с момента подписания его создателем. Использовать его в любом случае?
sv: Den förväntade kontrollsumman för filen %{file} är "%{found}" men den förväntades vara "%{expected}". Filen har ändrats av misstag eller av en angripare sedan skaparen signerade den. Vill du använda den ändå?
tr: %{file} dosyasının beklenen toplam kontrolü "%{found}" ancak "%{expected}" olması bekleniyordu. Dosya, oluşturucusu imzaladığından beri kazara veya bir saldırgan tarafından değiştirildi. Yine de kullanılsın mı?
uk: Очікувана контрольна сума файлу %{file} дорівнює «%{found}», а повинна була бути «%{expected}». Файл був змінений випадково або зловмисно з моменту підписання його творцем. Використовувати його в будь-якому разі?

source: There was a problem running a package script.
ca: Hi ha hagut un problema en executar un script de paquet.
cs: Vyskytla se chyba při běhu skriptu balíku.
de: Es gab ein Problem bei der Ausführung eines Paketskripts.
es: Se ha producido un problema al ejecutar un guion de paquete.
fi: Pakettikomentojonoa suoritettaessa oli ongelma.
fr: Un problème est survenu lors de l'exécution du script du paquet.
id: Terjadi masalah saat menjalankan skrip paket.
it: Si è verificato un problema durante l'esecuzione dello script del pacchetto.
ja: パッケージスクリプトの実行時に問題が発生しました。
ka: პრობლემა პაჯეტის სკრიპტის შესრულებისას.
nl: Er is een probleem ontstaan tijdens het uitvoeren van een package script.
pt_br: Houve um problema ao executar um script do pacote.
ru: Возникла проблема с запуском скрипта пакета.
sv: Det uppstod ett problem med att köra ett paketskript.
tr: Paket komudu çalıştırılırken bir hata meydana geldi.
uk: Виникла проблема із запуском скрипта пакунка.

source: The file %{filename} from %{repo_url} is not digitally signed. The origin and integrity of the file cannot be verified. Use it anyway?
ca: El fitxer %{filename} de %{repo_url} no està signat digitalment. L'origen i la integritat del fitxer no es poden verificar. Voleu usar-lo tanmateix?
cs: Soubor %{filename} z adresy %{repo_url} neobsahuje digitální podpis. Původ a integrita souboru nemůže být ověřena. Chcete jej i přesto použít?
de: Die Datei "%{filename}" aus %{repo_url} wurde nicht digital signiert. Der Ursprung und die Integrität der Datei können nicht überprüft werden. Trotzdem verwenden?
es: El archivo %{filename} de %{repo_url} no está firmado digitalmente. El origen y la integridad del archivo no se pueden verificar. ¿Desea usarlo de todas formas?
fi: Tiedostoa %{filename} lähteestä %{repo_url} ei ole allekirjoitettu digitaalisesti. Tiedoston alkuperää ja eheyttä ei voida vahvistaa. Käytetäänkö sitä tästä huolimatta?
fr: Le fichier %{filename} provenant de %{repo_url} n'est pas signé numériquement. L'origine et l'intégrité du fichier ne peuvent pas être vérifiées. Voulez-vous l'utiliser malgré tout ?
id: Berkas %{filename} dari %{repo_url} tidak ditandatangani secara digital. Asal usul dan integritas berkas tidak dapat diverifikasi. Apakah tetap ingin menggunakannya?
it: Il file %{filename} nel repository %{repo_url} non è dotato di firma digitale. Impossibile verificare l'origine e l'integrità del file. Utilizzarlo comunque?
ja: %{repo_url} が提供するファイル %{filename} には電子署名がありません。そのため、ファイルの正当性が確認できません。このファイルを使用してよろしいですか？
nl: Het bestand %{filename} van %{repo_url} is niet digitaal ondertekend. De herkomst en integriteit van het bestand kan niet worden gecontroleerd. Desondanks gebruiken?
pt_br: O arquivo %{filename} de %{repo_url} não foi assinado digitalmente. Não é possível verificar a origem e a integridade do arquivo. Usá-lo mesmo assim?
ru: Файл %{filename} из %{repo_url} не имеет цифровой подписи. Происхождение и целостность файла не могут быть проверены. Все равно использовать его?
sv: Filen %{filename} från %{repo_url} är inte digitalt signerad. Filens ursprung och integritet kan inte verifieras. Vill du använda den ändå?
tr: %{repo_url} adresindeki %{filename} dosyası dijital olarak imzalanmamış. Dosyanın kökeni ve bütünlüğü doğrulanamıyor. Yine de kullanılsın mı?
uk: Файл %{filename} з %{repo_url} не має цифрового підпису. Походження та цілісність файлу не можуть бути перевірені. Все одно використовувати його?

source: The file %{filename} is not digitally signed. The origin and integrity of the file cannot be verified. Use it anyway?
ca: El fitxer %{filename} no està signat digitalment. L'origen i la integritat del fitxer no es poden verificar. Voleu usar-lo tanmateix?
cs: Soubor %{filename} není digitálně podepsán. Původ a integrita souboru nemůže být ověřena. Chcete jej i přesto použít?
de: Die Datei "%{filename}" wurde nicht digital signiert. Der Ursprung und die Integrität der Datei können nicht überprüft werden. Trotzdem verwenden?
es: El archivo %{filename} no está firmado digitalmente. El origen y la integridad del archivo no se pueden verificar. ¿Desea usarlo de todas formas?
fi: Tiedostoa %{filename} ei ole allekirjoitettu digitaalisesti. Tiedoston alkuperää ja eheyttä ei voida vahvistaa. Käytetäänkö sitä tästä huolimatta?
fr: Le fichier %{filename} n'est pas signé numériquement. L'origine et l'intégrité du fichier ne peuvent pas être vérifiées. Voulez-vous l'utiliser malgré tout ?
id: Berkas %{filename} tidak ditandatangani secara digital. Asal usul dan integritas berkas tidak dapat diverifikasi. Apakah tetap ingin menggunakannya?
it: Il file %{filename} non è dotato di firma digitale. Impossibile verificare l'origine e l'integrità del file. Utilizzarlo comunque?
ja: ファイル %{filename} には電子署名がありません。そのため、ファイルの正当性が確認できません。このファイルを使用してよろしいですか？
nl: Het bestand %{filename} is niet digitaal ondertekend. De herkomst en integriteit van het bestand kan niet worden gecontroleerd. Desondanks gebruiken?
pt_br: O arquivo %{filename} não foi assinado digitalmente. Não é possível verificar a origem e a integridade do arquivo. Usá-lo mesmo assim?
ru: Файл %{filename} не имеет цифровой подписи. Происхождение и целостность файла не могут быть проверены. Все равно использовать его?
sv: Filen %{filename} är inte digitalt signerad. Filens ursprung och integritet kan inte verifieras. Vill du använda den ändå?
tr: %{filename} dosyası dijital olarak imzalanmamış. Dosyanın kökeni ve bütünlüğü doğrulanamıyor. Yine de kullanılsın mı?
uk: Файл %{filename} не має цифрового підпису. Походження та цілісність файлу не можуть бути перевірені. Все одно використовувати його?
