Repository: agama-project/agama
Catalog: service/po/*.po
Languages: ca, cs, de, es, fi, fr, id, it, ja, ka, nb_no, nl, pt_br, ru, sv, tr, uk

source: The key %{id} (%{name}) with fingerprint %{fingerprint} is unknown. Do you want to trust this key?
ca: La clau %{id} (%{name}) amb l'empremta digital %{fingerprint} és desconeguda. Voleu confiar en aquesta clau?
cs: Klíč %{id} (%{name}) s otiskem %{fingerprint} není známý. Chcete tomuto klíči důvěřovat?
de: Der Schlüssel %{id} (%{name}) mit dem Fingerabdruck %{fingerprint} ist unbekannt. Möchten Sie diesem Schlüssel vertrauen?
es: La clave %{id} (%{name}) con la huella digital %{fingerprint} es desconocida. ¿Quieres confiar en esta clave?
fi: Avain %{id} (%{name}) sormenjäljellä %{fingerprint} on tuntematon. Luotetaanko tähän avaimeen?
fr: La clé %{id} (%{name}) avec l'empreinte digitale %{fingerprint} est inconnue. Voulez-vous faire confiance à cette clé ?
id: Kunci %{id} (%{name}) dengan sidik jari %{fingerprint} tidak diketahui. Apakah Anda ingin mempercayai kunci ini?
it: La chiave %{id} (%{name}) con l'impronta digitale %{fingerprint} è sconosciuta. Considerarla attendibile?
ja: 鍵 %{id} (%{name}) (指紋 %{fingerprint}) の発行元が不明です。この鍵を信頼してよろしいですか？
nb_no: Nøkkelen %{id} (%{name}) med fingeravtrykk %{fingerprint} er ukjent. Vil du stole på denne nøkkelen?
nl: De sleutel {id} (%{name}) met vingerafdruk %{fingerprint} is onbekend. Vertrouwt u deze sleutel?
pt_br: A chave %{id} (%{name}) com impressão digital %{fingerprint} é desconhecida. Você quer confiar nessa chave?
ru: Ключ %{id} (%{name}) с отпечатком %{fingerprint} неизвестен. Хотите ли вы доверять этому ключу?
sv: Nyckeln %{id} (%{name}) med fingeravtrycket %{fingerprint} är okänd. Vill du lita på den här nyckeln?
tr: %{fingerprint} parmak izine sahip %{id} (%{name}) anahtarı bilinmiyor. Bu anahtara güvenmek istiyor musunuz?
uk: Ключ %{id} (%{name}) з відбитком %{fingerprint} не відомий. Бажаєте довіряти цьому ключу?

source: The file %{filename} from %{repo_url} is digitally signed with the following unknown GnuPG key: %{key_id}. Use it anyway?
ca: El fitxer %{filename} de %{repo_url} està signat digitalment amb la clau GnuPG desconeguda següent: %{key_id}. Voleu usar-lo tanmateix?
cs: Soubor %{filename} z adresy %{repo_url} je digitálně podepsán pomocí neznámého GnuPG klíče: %{key_id}. Chcete jej i přesto použít?
de: Die Datei "%{filename}" aus %{repo_url} wurde mit dem folgenden unbekannten GnuPG-Schlüssel digital signiert: %{key_id}. Trotzdem verwenden?
es: El archivo %{filename} de %{repo_url} está firmado digitalmente con la siguiente clave GnuPG desconocida: %{key_id}. ¿Desea usarlo de todas formas?
fi: Tiedosto %{filename} lähteestä %{repo_url} on allekirjoitettu digitaalisesti seuraavalla tuntemattomalla GnuPG-avaimella: %{key_id}. Tiedoston alkuperää ja eheyttä ei voida vahvistaa. Käytetäänkö sitä tästä huolimatta?
fr: Le fichier %{filename} provenant de %{repo_url} est signé numériquement avec la clé GnuPG inconnue suivante : %{key_id}. Voulez-vous l'utiliser malgré tout ?
id: Berkas %{filename} dari %{repo_url} ditandatangani secara digital dengan kunci GnuPG yang tidak dikenal berikut: %{key_id}. Apakah tetap ingin menggunakannya?
it: Il file %{filename} nel repository %{repo_url} è firmato digitalmente con la seguente chiave GnuPG sconosciuta: %{key_id}. Utilizzarlo comunque?
ja: %{repo_url} が提供するファイル %{filename} には電子署名がありますが、不明な GnuPG 鍵 (%{key_id}) を使用しています。このファイルを使用してよろしいですか？
nl: Het bestand %{filename} van %{repo_url} is digitaal ondertekend met de volgende onbekende GnuPG sleutel: %{key_id}. Desondanks gebruiken?
pt_br: O arquivo %{filename} de %{repo_url} foi assinado digitalmente com a seguinte chave GnuPG desconhecida: %{key_id}. Usá-lo mesmo assim?
ru: Файл %{filename} из %{repo_url} подписан цифровой подписью следующим неизвестным ключом GnuPG: %{key_id}. Использовать его в любом случае?
sv: Filen %{filename} från %{repo_url} är digitalt signerad med följande okända GnuPG-nyckel: %{key_id}. Vill du använda den ändå?
tr: %{repo_url}'den %{filename} dosyası, şu bilinmeyen GnuPG anahtarıyla dijital olarak imzalanmıştır: %{key_id}. Yine de kullanılsın mı?
uk: Файл %{filename} із %{repo_url} підписано цифровим підписом таким невідомим ключем GnuPG: %{key_id}. Використовувати його в будь-якому випадку?

source: The file %{filename} is digitally signed with the following unknown GnuPG key: %{key_id}. Use it anyway?
ca: El fitxer %{filename} està signat digitalment amb la clau GnuPG desconeguda següent: %{key_id}. Voleu usar-lo tanmateix?
cs: Soubor %{filename} je digitálně podepsán pomocí neznámého GnuPG klíče: %{key_id}. Chcete jej i přesto použít?
de: Die Datei "%{filename}" wurde mit dem folgenden unbekannten GnuPG-Schlüssel digital signiert: %{key_id}. Trotzdem verwenden?
es: El archivo %{filename} está firmado digitalmente con la siguiente clave GnuPG desconocida: %{key_id}. ¿Desea usarlo de todas formas?
fi: Tiedosto %{filename} on allekirjoitettu digitaalisesti seuraavalla tuntemattomalla GnuPG-avaimella: %{key_id}. Tiedoston alkuperää ja eheyttä ei voida vahvistaa. Käytetäänkö sitä tästä huolimatta?
fr: Le fichier %{filename} est signé numériquement avec la clé GnuPG inconnue suivante : %{key_id}. Voulez-vous l'utiliser malgré tout ?
id: Berkas %{filename} telah ditandatangani secara digital menggunakan kunci GnuPG yang tidak dikenal berikut: %{key_id}. Apakah tetap ingin menggunakannya?
it: Il file %{filename} è firmato digitalmente con la seguente chiave GnuPG sconosciuta: %{key_id}. Utilizzarlo comunque?
ja: ファイル %{filename} には電子署名がありますが、不明な GnuPG 鍵 (%{key_id}) を使用しています。このファイルを使用してよろしいですか？
nl: Het bestand %{filename} is digitaal ondertekend met de volgende onbekende GnuPG sleutel: %{key_id}. Desondanks gebruiken?
pt_br: O arquivo %{filename} foi assinado digitalmente com a seguinte chave GnuPG desconhecida: %{key_id}. Usá-lo mesmo assim?
ru: Файл %{filename} подписан цифровой подписью следующим неизвестным ключом GnuPG: %{key_id}. Использовать его в любом случае?
sv: Filen %{filename} är digitalt signerad med följande okända GnuPG-nyckel: %{key_id}. Vill du använda den ändå?
tr: %{filename} dosyası, şu bilinmeyen GnuPG anahtarıyla dijital olarak imzalanmıştır: %{key_id}. Yine de kullanılsın mı?
uk: Файл %{filename} підписано цифровим підписом з невідомим ключем GnuPG: %{key_id}. Використовувати його у будь-якому випадку?

source: The file %{filename} from %{repo_url} is digitally signed with the following GnuPG key, but the integrity check failed: %{key_id} (%{key_name}). Use it anyway?
ca: El fitxer %{filename} de %{repo_url} està signat digitalment amb la clau GnuPG següent, però la comprovació d'integritat ha fallat: %{key_id} (%{key_name}). Voleu usar-lo tanmateix?
cs: Soubor %{filename} z adresy %{repo_url} je digitálně podepsán pomocí GnuPG klíče, ale kontrola integrity selhala: %{key_id} (%{key_name}). Chcete jej i přesto použít?
de: Die Datei "%{filename}" aus %{repo_url} wurde mit dem folgenden GnuPG-Schlüssel digital signiert, aber bei der Integritätsprüfung ist ein Fehler aufgetreten: %{key_id} (%{key_name}). Trotzdem verwenden?
es: El archivo %{filename} de %{repo_url} está firmado digitalmente con la siguiente clave GnuPG, pero la comprobación de integridad ha fallado: %{key_id} (%{key_name}). ¿Desea usarlo de todas formas?
fi: Tiedosto %{filename} lähteestä %{repo_url} on allekirjoitettu digitaalisesti seuraavalla GnuPG-avaimella mutta eheyden varmistaminen epäonnistui: %{key_id} (%{key_name}). Käytetäänkö sitä tästä huolimatta?
fr: Le fichier %{filename} provenant de %{repo_url} est signé numériquement avec la clé GnuPG suivante, mais le contrôle d'intégrité a échoué : %{key_id} (%{key_name}). Voulez-vous l'utiliser malgré tout ?
id: Berkas %{filename} dari %{repo_url} telah ditandatangani secara digital menggunakan kunci GnuPG berikut, tetapi pemeriksaan integritas gagal: %{key_id} (%{key_name}). Apakah tetap ingin menggunakannya?
it: Il file %{filename} nel repository %{repo_url} è firmato digitalmente con la seguente chiave GnuPG, ma la verifica dell'integrità non è riuscita: %{key_id} (%{key_name}). Utilizzarlo comunque?
ja: %{repo_url} が提供するファイル %{filename} には %{key_id} (%{key_name}) の GnuPG 鍵による署名がありますが、一貫性チェックに失敗しました。このファイルを使用してよろしいですか？
nl: Het bestand %{filename} van %{repo_url} is digitaal ondertekend met de volgende GnuPG sleutel, maar de integriteitscontrole is mislukt: %{key_id} (%{key_name}). Desondanks gebruiken?
pt_br: O arquivo %{filename} de %{repo_url} foi assinado digitalmente com a seguinte chave GnuPG, mas houve falha na verificação da integridade: %{key_id} (%{key_name}). Usá-lo mesmo assim?
ru: Файл %{filename} из %{repo_url} подписан следующим ключом GnuPG, но проверка целостности дала сбой: %{key_id} (%{key_name}). Использовать его в любом случае?
sv: Filen %{filename} från %{repo_url} är digitalt signerad med följande GnuPG-nyckel, men integritetskontrollen misslyckades: %{key_id} (%{key_name}). Vill du använda den ändå?
tr: %{repo_url} adresindeki %{filename} dosyası aşağıdaki GnuPG anahtarıyla dijital olarak imzalandı, ancak bütünlük denetimi başarısız oldu: %{key_id} (%{key_name}). Yine de kullanılsın mı?
uk: Файл %{filename} з %{repo_url} підписано цифровим ключем GnuPG, але перевірка цілісності завершилася невдало: %{key_id} (%{key_name}). Використовувати його все одно?

source: The file %{filename} is digitally signed with the following GnuPG key, but the integrity check failed: %{key_id} (%{key_name}). Use it anyway?
ca: El fitxer %{filename} està signat digitalment amb la clau GnuPG següent, però la comprovació d'integritat ha fallat: %{key_id} (%{key_name}). Voleu usar-lo tanmateix?
cs: Soubor %{filename} je digitálně podepsán pomocí GnuPG klíče, ale kontrola integrity selhala: %{key_id} (%{key_name}). Chcete jej i přesto použít?
de: Die Datei "%{filename}" wurde mit dem folgenden GnuPG-Schlüssel digital signiert, aber bei der Integritätsprüfung ist ein Fehler aufgetreten: %{key_id} (%{key_name}). Trotzdem verwenden?
es: El archivo %{filename} está firmado digitalmente con la siguiente clave GnuPG, pero la comprobación de integridad ha fallado: %{key_id} (%{key_name}). ¿Desea usarlo de todas formas?
fi: Tiedosto %{filename} on allekirjoitettu digitaalisesti seuraavalla GnuPG-avaimella mutta eheyden varmistaminen epäonnistui: %{key_id} (%{key_name}). Käytetäänkö sitä tästä huolimatta?
fr: Le fichier %{filename} est signé numériquement avec la clé GnuPG suivante, mais le contrôle d'intégrité a échoué : %{key_id} (%{key_name}). Voulez-vous l'utiliser malgré tout ?
id: Berkas %{filename} telah ditandatangani secara digital menggunakan kunci GnuPG berikut, tetapi pemeriksaan integritas gagal: %{key_id} (%{key_name}). Apakah tetap ingin menggunakannya?
it: Il file %{filename} è firmato digitalmente con la seguente chiave GnuPG, ma la verifica dell'integrità non è riuscita: %{key_id} (%{key_name}). Utilizzarlo comunque?
ja: ファイル %{filename} には %{key_id} (%{key_name}) の GnuPG 鍵による署名がありますが、一貫性チェックに失敗しました。このファイルを使用してよろしいですか？
nl: Het bestand %{filename} is digitaal ondertekend met de volgende GnuPG sleutel, maar de integriteitscontrole is mislukt: %{key_id} (%{key_name}). Desondanks gebruiken?
pt_br: O arquivo %{filename} foi assinado digitalmente com a seguinte chave GnuPG, mas houve falha na verificação da integridade: %{key_id} (%{key_name}). Usá-lo mesmo assim?
ru: Файл %{filename} подписан следующим ключом GnuPG, но проверка целостности дала сбой: %{key_id} (%{key_name}). Использовать его в любом случае?
sv: Filen %{filename} är digitalt signerad med följande GnuPG-nyckel, men integritetskontrollen misslyckades: %{key_id} (%{key_name}). Vill du använda den ändå?
tr: %{filename} dosyası aşağıdaki GnuPG anahtarıyla dijital olarak imzalandı, ancak bütünlük denetimi başarısız oldu: %{key_id} (%{key_name}). Yine de kullanılsın mı?
uk: Файл %{filename} підписано цифровим ключем GnuPG, але перевірка цілісності не вдалася: %{key_id} (%{key_name}). Використовувати його все одно?

source: Trust
ca: Confia-hi
cs: Důvěřovat
de: Vertrauen
es: Confiar
fi: Luota
fr: Approuver
id: Percayai
it: Considera attendibile
ja: 信頼する
ka: ნდობა
nl: Vertrouwen
pt_br: Confiar
ru: Доверять
sv: Lita på
tr: Güven
uk: Довіряти

source: Refreshing repositories metadata
ca: Refrescant les metadades dels repositoris
cs: Obnovování metadat repozitáře
de: Repositorys-Metadaten werden aktualisiert
es: Actualizando los metadatos del repositorios
fi: Päivitetään ohjelmalähteiden metatietoja
fr: Actualisation des métadonnées des dépôts
id: Menyegarkan metadata repositori
it: Aggiornamento dei metadati dei repository
ja: リポジトリのメタデータを更新しています
ka: რეპოზიტორიის მეტამონაცემების განახლება
nb_no: Oppdaterer pakkebrønn metadata
nl: Metadata van opslagruimtes verversen
pt_br: Atualizando metadados de repositórios
ru: Обновление метаданных репозиториев
sv: Uppdaterar metadata för förråd
tr: Depo meta verileri yenileniyor
uk: Оновлення метаданих репозиторіїв

source: Calculating the software proposal
ca: Calculant la proposta de programari
cs: Vyhodnocuje se návrh softwaru
de: Software-Vorschlag wird berechnet
es: Calcular la propuesta de software
fi: Lasketaan ohjelmistoehdotusta
fr: Calcul de l'offre de logiciel
id: Menghitung usulan perangkat lunak
it: Calcolo della proposta di software
ja: ソフトウエアの提案内容を作成しています
ka: პროგრამების შეთავაზების მომზადება
nb_no: Kalkulerer programvareforslaget
nl: Berekenen van het softwarevoorstel
pt_br: Calculando a proposta de software
ru: Расчет предложения по программному обеспечению
sv: Beräknar programvaruförslaget
tr: Yazılım önerisi hesaplanıyor
uk: Розрахунок пропозиції щодо програмного забезпечення

source: Initializing sources
ca: Iniciant les fonts
cs: Inicializuji zdroje
de: Quellen werden initialisiert
es: Inicializando fuentes
fi: Otetaan ohjelmalähteitä käyttöön
fr: Initialisation des sources
id: Menginisialisasi sumber
it: Inizializzazione delle sorgenti
ja: ソースを準備しています
ka: წყაროების ინიციალიზაცია
nb_no: Initialiserer kilder
nl: Bronnen initialiseren
pt_br: Inicializando fontes
ru: Инициализация источников
sv: Initierar källor
tr: Kaynaklar başlatılıyor
uk: Ініціалізація джерел

source: Adding service '%s' failed.
ca: Ha fallat afegir el servei %s.
cs: Přidání služby ‘%s' se nezdařilo.
de: Fehler beim Hinzufügen des Dienstes ‚%s‘.
es: Error al añadir el servicio %s.
fi: Palvelun ”%s” lisääminen epäonnistui..
fr: L'ajout du service '%s' a échoué.
id: Penambahan layanan ‘%s’ gagal.
it: Aggiunta del servizio '%s' non riuscita.
ja: サービス '%s' の追加に失敗しました。
ka: სერვისის '%s' დამატება ჩავარდა.
nl: Toevoegen service '%s' mislukt.
pt_br: Falha ao adicionar serviço '%s'.
ru: Сбой добавления службы „%s“.
sv: Det misslyckades att lägga till tjänsten '%s'.
tr: '%s' hizmetinin eklenmesi başarısız oldu.
uk: Збій додавання служби «%s».

source: Updating service '%s' failed.
ca: Ha fallat actualitzar el servei %s.
cs: Aktualizace služby '%s' se nezdařila.
de: Fehler beim Aktualisieren des Dienstes ‚%s‘.
es: Error al actualizar el servicio %s.
fi: Palvelun ”%s” päivittämien epäonnistui.
fr: La mise à jour du service '%s' a échoué.
id: Pembaruan layanan ‘%s’ gagal.
it: Aggiornamento del servizio '%s' non riuscito.
ja: サービス '%s' の更新に失敗しました。
ka: სერვისის '%s' განახლება ჩავარდა.
nl: Updaten van service '%s' milsukt.
pt_br: Falha ao atualizar serviço '%s'.
ru: Сбой обновления службы „%s“.
sv: Uppdatering av tjänsten '%s' misslyckades.
tr: '%s' hizmetinin güncellenmesi başarısız oldu.
uk: Збій оновлення служби «%s».

source: Saving service '%s' failed.
ca: Ha fallat desar el servei %s.
cs: Uložení služby '%s' se nezdařilo.
de: Fehler beim Speichern des Dienstes ‚%s‘.
es: Error al guardar el servicio %s.
fi: Palvelun ”%s” tallentaminen epäonnistui.
fr: L'enregistrement du service '%s' a échoué.
id: Penyimpanan layanan ‘%s’ gagal.
it: Salvataggio del servizio '%s' non riuscito.
ja: サービス '%s' の保存に失敗しました。
ka: სერვისის '%s' შენახვა ჩავარდა.
nl: Opslaan service '%s' mislukt.
pt_br: Falha ao salvar serviço '%s'.
ru: Сбой сохранения службы „%s“.
sv: Det misslyckades att spara tjänsten '%s'.
tr: '%s' hizmeti kaydedilemedi.
uk: Збій збереження служби «%s».

source: Refreshing service '%s' failed.
ca: Ha fallat refrescar el servei %s.
cs: Selhalo obnovení služby '%s'.
de: Fehler beim Auffrischen des Dienstes ‚%s‘.
es: Error al renovar el servicio %s.
fi: Palvelun ”%s” virkistäminen epäonnistui.
fr: Le rafraîchissement du service '%s' a échoué.
id: Penyegaran layanan ‘%s’ gagal.
it: Aggiornamento del servizio '%s' non riuscito.
ja: サービス '%s' の最新化に失敗しました。
ka: სერვისის '%s' თავიდან ჩატვირთვა ჩავარდა.
nl: Verversen service '%s' milsukt.
pt_br: Falha ao recarregar serviço '%s'.
ru: Сбой обновления данных службы „%s“.
sv: Uppdatering av tjänsten '%s' misslyckades.
tr: '%s' hizmetinin yenilenmesi başarısız oldu.
uk: Збій оновлення даних служби «%s».

source: Removing service '%s' failed.
ca: Ha fallat suprimir el servei %s.
cs: Odebrání služby '%s' se nezdařilo.
de: Fehler beim Entfernen des Dienstes ‚%s‘.
es: Error al eliminar el servicio %s.
fi: Palvelun ”%s” poistaminen epäonnistui.
fr: La suppression du service '%s' a échoué.
id: Penghapusan layanan ‘%s’ gagal.
it: Rimozione del servizio '%s' non riuscito.
ja: サービス '%s' の削除に失敗しました。
ka: სერვისის '%s' წაშლა ჩავარდა.
nl: Verwijderen service '%s' mislukt.
pt_br: Falha ao remover serviço '%s'.
ru: Сбой удаления службы „%s“.
sv: Det misslyckades att ta bort tjänsten '%s'.
tr: '%s' hizmetinin kaldırılması başarısız oldu.
uk: Збій вилучення служби «%s».

source: Could not read repository "%s"
ca: No s'ha pogut llegir el repositori %s.
cs: Nelze načíst repozitář "%s"
de: Das Repository „%s“ konnte nicht gelesen werden
es: No se pudo leer el repositorio "%s"
fi: Ohjelmalähdettä "%s" ei voi lukea
fr: Impossible de lire le dépôt "%s"
id: Tidak dapat membaca repositori "%s"
it: Impossibile leggere il repository "%s"
ja: リポジトリ"%s" を読み込むことができませんでした
ka: რეპოზიტორიის "%s" წაკთხვა შეუძლებელია
nb_no: Kunne ikke lese pakkebrønn "%s"
nl: Kan opslagruimte "%s" niet lezen
pt_br: Não foi possível ler o repositório "%s"
ru: Не удалось прочитать репозиторий "%s"
sv: Kunde inte läsa förråd "%s"
tr: "%s" deposu okunamadı
uk: Не вдалося прочитати репозиторій "%s"

source: Product not selected yet
ca: Encara no s'ha seleccionat el producte.
cs: Není vybrán žádný produkt
de: Produkt noch nicht ausgewählt
es: Producto aún no seleccionado
fi: Tuotetta ei ole vielä valittu
fr: Le produit n'est pas encore sélectionné
id: Produk belum dipilih
it: Prodotto non ancora selezionato
ja: まだ製品を選択していません
ka: ჯერ პროდუქტი არ აგირჩევიათ
nb_no: Produkt har ikke blitt valgt ennå
nl: Nog geen product geselecteerd
pt_br: Produto ainda não selecionado
ru: Продукт еще не выбран
sv: Produkt har inte valts ännu
tr: Ürün henüz seçilmedi
uk: Продукт ще не вибрано

source: Product must be registered
ca: El producte ha d'estar registrat.
cs: Produkt musí být zaregistrován
de: Produkt muss registriert sein
es: El producto debe estar registrado
fi: Tuote tulee olla rekisteröity
fr: Le produit doit être enregistré
id: Produk harus didaftarkan
it: Registrare il prodotto
ja: 製品を登録しなければなりません
ka: პროდუქტი დარეგისტრირებული უნდა იყოს
nb_no: Produkt må bli registrert
nl: Product moet geregistreerd zijn
pt_br: O produto deve ser registrado
ru: Продукт должен быть зарегистрирован
sv: Produkt måste registreras
tr: Ürün kayıtlı olmalı
uk: Продукт повинен бути зареєстрованим

source: Found %s dependency issues.
ca: S'han trobat %s problemes de dependències.
cs: Nalezeno %s problémů v závislostech.
de: %s Abhängigkeitsprobleme gefunden.
es: Se encontraron %s problemas de dependencias.
fi: Löydettiin %s riippuvuusongelmaa.
fr: %s problème(s) de dépendance trouvé(s).
id: Ditemukan %s masalah ketergantungan.
it: Trovati %s problemi di dipendenze.
ja: %s 個の依存関係の問題が見つかりました。
ka: აღმოჩენილია %s დამოკიდებულების პრობლემა.
nb_no: Fant %s avhengighetsproblemer.
nl: %s afhankelijkheidsissues gevonden.
pt_br: Foram encontrados %s problemas de dependência.
ru: Найдено %s проблем с зависимостями.
sv: Hittade %s beroendeproblem.
tr: %s bağımlılık sorunu bulundu.
uk: Знайдено %s проблем із залежностями.

source: Certificate:
ca: Certificat:
cs: Certifikát:
de: Zertifikat:
es: Certificado:
fi: Varmenne:
fr: Certificat :
id: Sertifikat:
it: Certificato:
ja: 証明書:
ka: სერტიფიკატი:
nl: Certificaat:
pt_br: Certificado:
ru: Сертификат:
sv: Certifikat:
tr: Sertifika:
uk: Сертифікат:

source: Issued To
ca: Emès a
cs: Vydán komu
de: Ausgestellt an
es: Emitido para
fi: Myönnetty kohteelle
fr: Émis pour
id: Diterbitkan kepada
it: Rilasciato a
ja: 発行先:
ka: გაცემულია ვისთვის
nl: Uitgegeven aan
pt_br: Emitido para
ru: Получатель
sv: Utfärdat till
tr: Kime Verildi
uk: Випущено для

source: Issued By
ca: Emès per
cs: Vydán kým
de: Ausgestellt von
es: Emitido por
fi: Julkaisija
fr: Émis par
id: Diterbitkan oleh
it: Rilasciato da
ja: 発行者:
ka: გამომცემელია
nl: Uitgegeven door
pt_br: Emitido por
ru: Кем выдан
sv: Utfärdat av
tr: Veren kuruluş
uk: Ким виданий

source: SHA1 Fingerprint:
ca: Empremta digital SHA1:
cs: SHA1 otisk:
de: SHA1-Fingerabdruck:
es: Huella digital SHA1:
fi: SHA1-sormenjälki:
fr: Empreinte SHA1 :
id: Sidik Jari SHA1:
it: Impronta digitale SHA1:
ja: SHA1 指紋:
ka: SHA1 ანაბეჭდი:
nl: SHA1 vingerafdruk:
pt_br: Impressão digital SHA1:
ru: Отпечаток SHA1:
sv: SHA1 fingeravtryck:
tr: SHA1 Parmak İzi:
uk: Відбиток SHA1:

source: SHA256 Fingerprint:
ca: Empremta digital SHA256:
cs: SHA256 otisk:
de: SHA256-Fingerabdruck:
es: Huella digital SHA256:
fi: SHA256-sormenjälki:
fr: Empreinte SHA256 :
id: Sidik Jari SHA256:
it: Impronta digitale SHA256:
ja: SHA256 指紋:
ka: SHA256 ანაბეჭდი:
nl: SHA256 vingerafdruk:
pt_br: Impressão digital SHA256:
ru: Отпечаток SHA256:
sv: SHA256 fingeravtryck:
tr: SHA256 Parmak İzi:
uk: Відбиток SHA256:

source: Common Name (CN):
ca: Nom comú (CN):
cs: Běžný název (CN):
de: Gemeinsamer Name (CN):
es: Nombre común (CN):
fi: Yleinen nimi (CN):
fr: Nom commun (CN) :
id: Nama Umum (CN):
it: Nome comune (CN):
ja: 共通名 (CN):
ka: ზოგადი სახელი (CN):
nl: Normale naam (CN):
pt_br: Nome Comum (CN):
ru: Общее имя (CN):
sv: Vanligt namn (CN):
tr: Ortak Ad (OA):
uk: Загальна назва (CN):

source: Organization (O):
ca: Organització (O):
cs: Organizace (O):
de: Organisation (O):
es: Organización (O):
fi: Organisaatio (O):
fr: Organisation (O) :
id: Organisasi (O):
it: Organizzazione(O):
ja: 組織 (O):
ka: ორგანიზაცია (O):
nl: Organisatie (O):
pt_br: Organização (O):
ru: Организация (O):
sv: Organisation (O):
tr: Organizasyon (O):
uk: Організація (O):

source: Organization Unit (OU):
ca: Unitat organitzativa (OU):
cs: Organizační jednotka (OU):
de: Organisationseinheit (OE):
es: Unidad organizativa (OU):
fi: Organisaatioyksikkö (OU):
fr: Unité organisationnelle (OU) :
id: Organisasi Unit (OU):
it: Unità organizzativa (OU):
ja: 組織単位 (OU):
ka: ორგანიზაციის დეპარტამენტი (OU):
nl: Organisatie eenheid (OU):
pt_br: Unidade Organizacional (UO):
ru: Подразделение (OU):
sv: Organisationsenhet (OU):
tr: Organizasyon Birimi (OB):
uk: Підрозділ (OU):
