Repository: agama-project/agama
Catalog: service/po/*.po
Languages: ca, cs, de, es, fi, fr, id, it, ja, ka, nb_no, nl, pt_br, ru, sv, tr, uk

source: Discover iSCSI targets
ca: Descobreix objectius iSCSI
cs: Objevit iSCSI cíle
de: iSCSI-Ziele entdecken
es: Buscar destinos iSCSI
fi: Havaitaan iSCSI-kohteita
fr: Découvrir les cibles iCSI
id: Menemukan target iSCSI
it: Rileva destinazioni iSCSI
ja: iSCSI ターゲットの検出
ka: iSCSI სამიზნეების აღმოჩენა
pt_br: Descobrir destinos iSCSI
ru: Обнаружение целей iSCSI
sv: Upptäck iSCSI-mål
tr: iSCSI hedeflerini keşfedin
uk: Виявлення цілей iSCSI

source: Login iSCSI targets
ca: Inicia sessió als objectius iSCSI
cs: Přihlásit iSCSI cíle
de: iSCSI-Ziele anmelden
es: Iniciar sesión en destinos iSCSI
fi: Kirjaudutaan sisään iSCSI-kohteisiin
fr: Connecter les cibles iCSI
id: Masuk ke target iSCSI
it: Accedi a destinazioni iSCSI
ja: iSCSI ターゲットへのログイン
ka: შესვლა iSCSI სამიზნეებზე
nl: iSCSI doelen inloggen
pt_br: Fazer login nos destinos iSCSI
ru: Вход в систему iSCSI-целей
sv: Logga in iSCSI-mål
tr: iSCSI hedeflerine giriş
uk: Вхід в систему iSCSI-цілей

source: Cannot login to iSCSI target %s
ca: No es pot iniciar sessió a l'objectiu iSCSI %s.
cs: Nepodařílo se přihlášení k iSCSI cíli %s
de: Anmelden beim iSCSI-Ziel %s nicht möglich
es: No es posible iniciar sesión en el destino iSCSI %s
fi: iSCSI-kohteeseen %s ei voi kirjautua
fr: Impossible de se connecter à la cible iSCSI %s
id: Tidak dapat masuk ke target iSCSI %s
it: Impossibile accedere a destinazione iSCSI %s
ja: iSCSI ターゲット %s にログインできません
ka: ვერ შევედი iSCSI სამიზნეზე %s
nl: Kan niet inloggen op iSCSI doel %s
pt_br: Não é possível fazer login no destino iSCSI %s
ru: Невозможно войти в систему iSCSI-цели %s
sv: Kan inte logga in på iSCSI-mål %s
tr: iSCSI hedefine %s giriş yapılamıyor
uk: Неможливо увійти в систему iSCSI-цілі %s

source: Activating storage devices
ca: Activant els dispositius d'emmagatzematge
cs: Aktivuji úložná zařízení
de: Speichergeräte werden aktiviert
es: Activar dispositivos de almacenamiento
fi: Otetaan tallennuslaitteita käyttöön
fr: Activation des périphériques de stockage
id: Mengaktifkan perangkat penyimpanan
it: Attivazione dei dispositivi di memorizzazione
ja: ストレージデバイスを有効化しています
ka: საცავის მოწყობილობების გააქტიურება
nb_no: Aktiverer lagringsenheter
nl: Activeren van opslag apparaten
pt_br: Ativando dispositivos de armazenamento
ru: Активация устройств хранения
sv: Aktiverar lagringsenheter
tr: Depolama aygıtlarını etkinleştiriliyor
uk: Активація пристроїв зберігання

source: Probing storage devices
ca: Sondant els dispositius d'emmagatzematge
cs: Sonduji úložná zařízení
de: Speichergeräte werden untersucht
es: Probando los dispositivos de almacenamiento
fi: Havaitaan tallennuslaitteita
fr: Sonde les périphériques de stockage
id: Memeriksa perangkat penyimpanan
it: Rilevamento dei dispositivi di memorizzazione
ja: ストレージデバイスを検出しています
ka: საცავის მოწყობილობების აღმოჩენა
nb_no: Undersøker lagringsenheter
nl: Onderzoeken van opslag apparaten
pt_br: Sondando dispositivos de armazenamento
ru: Поиск устройств хранения
sv: Undersöker lagringsenheter
tr: Depolama aygıtları araştırılıyor
uk: Пошук пристроїв зберігання

source: Calculating the storage proposal
ca: Calculant la proposta d'emmagatzematge
cs: Vypočítávání návrhu úložiště
de: Speichervorschlag wird berechnet
es: Calcular la propuesta de almacenamiento
fi: Lasketaan tallennustilan käyttöehdotusta
fr: Calcul de la proposition de stockage
id: Menghitung proposal penyimpanan
it: Calcolo della proposta di memorizzazione
ja: ストレージの提案内容を作成しています
ka: საცავის შეთავაზების მომზადება
nb_no: Kalkulerer lagringsforslaget
nl: Berekenen van het opslagvoorstel
pt_br: Calculando a proposta de armazenamento
ru: Расчет предложения по хранению
sv: Beräknar lagringsförslag
tr: Depolama önerisi hesaplanıyor
uk: Розрахунок пропозиції зі зберігання

source: Preparing bootloader proposal
ca: Preparant la proposta de carregador d'arrencada
cs: Připravuji návrh boot zavaděče
de: Bootloader-Vorschlag wird vorbereitet
es: Preparando la propuesta del gestor de arranque
fi: Valmistellaan alkulatausohjelman ehdotusta
fr: Préparation du chargeur d'amorçage envisagé
id: Mempersiapkan proposal bootloader
it: Preparazione della proposta del boot loader
ja: ブートローダの提案内容を準備しています
ka: ჩამტვირთავის შეთავაზების მომზადება
nb_no: Forbereder forslag til oppstartslaster
nl: Voorbereiden bootloader voorstel
pt_br: Preparando proposta de bootloader
ru: Подготовка предложения по загрузчику
sv: Förbereder starthanterare förslag
tr: Bootloader bölümü hazırlanıyor
uk: Підготовка пропозиції щодо завантажувача

source: Adding storage-related packages
ca: Afegint paquets relacionats amb l'emmagatzematge
cs: Přidávám balíčky související s úložištěm
de: Speicherbezogene Pakete werden hinzugefügt
es: Agregar paquetes relacionados con el almacenamiento
fi: Lisätään tallennukseen liittyviä paketteja
fr: Ajout des paquets relatifs au stockage
id: Menambahkan paket terkait penyimpanan
it: Aggiunta dei pacchetti correlati alla memorizzazione
ja: ストレージ関連のパッケージを追加しています
ka: საცავთან დაკავშირებული პაკეტების დამატება
nb_no: Legger til lagringsrelaterte pakker
nl: Toevoegen opslag gerelateerde pakketten
pt_br: Adicionando pacotes relacionados ao armazenamento
ru: Добавление пакетов, связанных с хранилищем
sv: Lägger till lagrings-relaterade paket
tr: Depolamayla ilgili paketler ekleme
uk: Додавання пакетів, пов'язаних зі сховищем

source: Preparing the storage devices
ca: Preparant els dispositius d'emmagatzematge
cs: Připravuji úložná zařízení
de: Speichergeräte werden vorbereitet
es: Preparando los dispositivos de almacenamiento
fi: Valmistellaan tallennuslaitteita
fr: Préparation des périphériques de stockage
id: Mempersiapkan perangkat penyimpanan
it: Preparazione dei dispositivi di memorizzazione
ja: ストレージデバイスを準備しています
ka: საცავის მოწყობილობების მომზადება
nb_no: Forbereder lagringsenheter
nl: Voorbereiden van de opslag apparaten
pt_br: Preparando os dispositivos de armazenamento
ru: Подготовка устройств хранения
sv: Förbereder lagringsenheter
tr: Depolama cihazları hazırlanıyor
uk: Підготовка пристроїв зберігання

source: Writing bootloader sysconfig
ca: Escrivint la configuració de sistema del carregador d'arrencada
cs: Zapisuji konfiguraci boot zavaděče v sysconfig
de: Bootloader-Systemkonfiguration wird geschrieben
es: Escribiendo el gestor de arranque sysconfig
fi: Kirjoitetaan alkulatausohjelman asetuksia
fr: Écriture du sysconfig du chargeur d'amorçage
id: Menulis sysconfig bootloader
it: Scrittura di sysconfig del boot loader
ja: ブートローダの sysconfig を書き込んでいます
ka: ჩამტვირთავის sysconfig-ის ჩაწერა
nb_no: Skriver oppstartslasterens sysconfig
nl: Schrijven van de bootloader sysconfig
pt_br: Escrevendo sysconfig do bootloader
ru: Запись системной конфигурации загрузчика
sv: Skriver starthanterarens sysconfig
tr: bootloader sysconfig yazılıyor
uk: Запис системної конфігурації завантажувача

source: Cannot calculate a valid storage setup with the current configuration
ca: No es pot calcular una configuració d'emmagatzematge vàlida amb la configuració actual.
cs: Pro současnou konfiguraci není možné vypočítat platné nastavení úložiště
de: Mit der aktuellen Konfiguration kann keine gültige Speichereinrichtung berechnet werden
es: No es posible calcular una configuración de almacenamiento válida con la configuración actual
fi: Nykyisillä asetuksilla ei voi laskea kelvollista tallennustilamääritystä
fr: Impossible de calculer une configuration de stockage valide avec la configuration actuelle
id: Tidak dapat menghitung konfigurasi penyimpanan yang valid dengan konfigurasi saat ini
it: Impossibile calcolare una configurazione di memorizzazione valida con l'attuale configurazione
ja: 現在の設定では適切なストレージ設定を算出できません
ka: ვერ გამოვთვალე სწორი საცავის კონფიგურაცია მიმდინარე კონფიგურაციით
nl: Kan geen geldige opslag configuratie berekenen met de huidige configuratie
pt_br: Não é possível calcular uma configuração de armazenamento válida com a configuração atual
ru: Невозможно рассчитать правильную настройку хранения с текущей конфигурацией
sv: Det går inte att beräkna en giltig lagringsinställning med den aktuella konfigurationen
tr: Mevcut yapılandırmayla geçerli bir depolama kurulumu hesaplanamıyor
uk: Не вдається обчислити правильне налаштування сховища з поточною конфігурацією

source: A problem ocurred while calculating the storage setup
ca: Hi ha hagut un problema en calcular la configuració de l'emmagatzematge.
cs: Nastal problém při výpočtu nastavení úložiště
de: Bei der Berechnung der Speichereinrichtung ist ein Problem aufgetreten
es: Ocurrió un problema al calcular la configuración de almacenamiento
fi: Tallennustila-asetusten laskemisessa tapahtui ongelma
fr: Un problème est survenu lors du calcul de la configuration du stockage
id: Terjadi masalah saat menghitung pengaturan penyimpanan
it: Si è verificato un problema durante il calcolo della configurazione della memorizzazione
ja: ストレージ設定を作成する際に問題が発生しました
ka: პრობლემა საცავის მორგების გამოთვლისას
nb_no: Ett problem oppsto under kalkulering av lagringsoppsettet
nl: Een probleem is ontstaan bij het berekenen van de opslag opstelling
pt_br: Ocorreu um problema ao calcular a configuração de armazenamento
ru: Возникла проблема при расчёте конфигурации накопителей
sv: Ett problem uppstod vid beräkning av lagringskonfigurationen
tr: Depolama kurulumu hesaplanırken bir sorun oluştu
uk: Виникла проблема при розрахунку конфігурації накопичувачів

source: No device selected for installation
ca: No s'ha seleccionat cap dispositiu per a la instal·lació.
cs: Není vybráno zařízení pro instalaci
de: Kein Gerät für die Installation ausgewählt
es: No se seleccionó ningún dispositivo para la instalación
fi: Asennukselle ei ole valittu laitetta
fr: Aucun périphérique n'a été sélectionné pour l'installation
id: Tidak ada perangkat yang dipilih untuk pemasangan
it: Nessun dispositivo selezionato per l'installazione
ja: インストール先のデバイスを選択していません
ka: დაყენებისთვის მოწყობილობა არჩეული არაა
nb_no: Ingen enhet valgt for installasjon
nl: Geen apparaat geselecteerd voor installatie
pt_br: Nenhum dispositivo selecionado para instalação
ru: Не выбрано устройство для установки
sv: Ingen enhet har valts för installation
tr: Kurulum için cihaz seçilmedi
uk: Не вибрано пристрій для встановлення

source: The following selected device is not found in the system: %{devices}
ca: El dispositiu seleccionat següent no es troba al sistema: %{devices}
cs: Toto zvolené zařízení není v systému: %{devices}
de: Das folgende ausgewählte Gerät wird im System nicht gefunden: %{devices}
es: El siguiente dispositivo seleccionado no se encuentra en el sistema: %{devices}
fi: Seuraava valittu laite ei löydy järjestelmästä: %{devices}
fr: Le périphérique sélectionné suivant est introuvable dans le système : %{devices}
id: Perangkat yang dipilih berikut ini tidak ditemukan dalam sistem: %{devices}
it: Non è stato trovato il seguente dispositivo selezionato nel sistema: %{devices}
ja: システム内には下記のデバイスが見つかりません: %{devices}
nb_no: Følgende valgte enhet ble ikke funnet i systemet: %{devices}
nl: Het volgende, geselecteerde apparaat is niet gevonden in het systeem: %{devices}
pt_br: O seguinte dispositivo selecionado não foi encontrado no sistema: %{devices}
ru: Следующее выбранное устройство не найдено в системе: %{devices}
sv: Följande valda enhet hittades inte i systemet: %{devices}
tr: Aşağıdaki seçilen cihaz sistemde bulunamadı: %{devices}
uk: Наступний вибраний пристрій не знайдено в системі: %{devices}

source: Defining a user, setting the root password or a SSH public key is required
ca: Cal definir un usuari, establir la contrasenya d'arrel o una clau pública SSH.
cs: Je vyžadováno definování uživatele a nastavení rootovského hesla nebo SSH klíče
de: Die Definition eines Benutzers, das Festlegen des Root-Passworts oder eines öffentlichen SSH-Schlüssels ist erforderlich
es: Es necesario definir un usuario, establecer la contraseña de root o una clave pública SSH
fi: Määritetään käyttäjää, pääkäyttäjän salasana tai julkinen SSH-avain vaaditaan
fr: Vous devez définir un utilisateur, un mot de passe root ou une clé publique SSH
id: Diperlukan penetapan pengguna, pengaturan kata sandi root, atau kunci publik SSH
it: Definizione di un utente, impostazione della password root o chiave pubblica SSH obbligatoria
ja: ユーザの設定、 root パスワードの設定、 SSH 公開鍵の設定のいずれかが必要です
nb_no: Det er nødvendig å definere en bruker, angi root-passordet eller en offentlig SSH nøkkel
nl: Het aanmaken van een gebruiker, het instellen van een root password of een publieke SSH sleutel is vereist
pt_br: É necessário definir um usuário, definir a senha root ou uma chave pública SSH
ru: Необходимо определить пользователя, установить пароль root или открытый ключ SSH
sv: Definiera en användare, för att ställa in root-lösenordet eller en offentlig SSH-nyckel krävs
tr: Bir kullanıcı tanımlamak, kök parolasını veya bir SSH genel anahtarını ayarlamak gerekir
uk: Необхідно вказати користувача, встановити пароль root або відкритий ключ SSH

source: The file %{filename} from repository %{repo_name} (%{repo_url})
nb_no: Filen %{filename} fra pakkebrønnen %{repo_name} (%{repo_url})

source: The file %{filename}
nb_no: Filen %{filename}

source: %{source} is not digitally signed. The origin and integrity of the file cannot be verified. Use it anyway?
nb_no: %{source} er ikke digitalt signert. Opphavet og integriteten av filen kan ikke bli verifisert. Bruk den uansett?

source: Selecting Linux Security Modules
nb_no: Velger Linux Sikkerhetsmoduler

source: Cannot accommodate the required file systems for installation
nb_no: Kan ikke håndtere de nødvendige filsystemene for installasjon
