Repository: agama-project/agama
Catalog: service/po/*.po
Languages: ca, cs, de, es, fi, fr, id, it, ja, ka, nb_no, nl, pt_br, ru, sv, tr, uk

source: The device with alias '%s' is used by more than one device
ca: El dispositiu amb l'àlies %s és usat per més d'un dispositiu.
cs: Zařízení označené jako '%s’ momentálně používá více než jedno zařízení
de: Das Gerät mit dem Alias ‚%s‘ wird von mehr als einem Gerät verwendet
es: El dispositivo con el alias %s es usado por más de un dispositivo
fi: Aliaksella ”%s” varustettua laitetta käyttää useampi kuin yksi laite
fr: Le périphérique avec l'alias '%s' est utilisé par plus d'un périphérique
id: Perangkat dengan alias ‘%s’ digunakan oleh lebih dari satu perangkat
it: Il dispositivo con alias '%s' è utilizzato da più di un dispositivo
ja: 別名 '%s' が設定されているデバイスが複数個あります
ka: მოწყობილობა ფსევდონიმით '%s' უკვე გამოიყენება ერთი, ან მეტი მოწყობილობის მიერ
nl: Het apparaat met alias '%s' wordt door meer dan een apparaat gebruikt
pt_br: O dispositivo com o álias '%s' é usado por mais de um dispositivo
ru: Устройство с псевдонимом „%s“ используется более чем одним устройством
sv: Enheten med alias '%s' används av mer än en enhet
tr: '%s' takma adlı aygıt birden fazla aygıt tarafından kullanılıyor
uk: Пристрій із псевдонімом «%s» використовується більш ніж одним пристроєм

source: The device with alias '%s' cannot be formatted because it is used by other device
ca: El dispositiu amb l'àlies %s no es pot formatar perquè l'usa un altre dispositiu.
cs: Zařízení označené jako '%s’ nemůže být naformátováno, protože je v současnosti využívá jiné zařízení
de: Das Gerät mit dem Alias ‚%s‘ kann nicht formatiert werden, da es von einem anderen Gerät verwendet wird
es: El dispositivo con el alias %s no se puede formatear porque es usado por otro dispositivo
fi: Laitetta aliaksella ”%s” ei voi alustaa koska se on toisen laitteen käytössä
fr: Le périphérique avec l'alias '%s' ne peut pas être formaté, car il est utilisé par un autre périphérique
id: Perangkat dengan alias ‘%s’ tidak dapat diformat karena sedang digunakan oleh perangkat lain
it: Impossibile formattare il dispositivo con alias '%s' perché è utilizzato da un altro dispositivo
ja: 別名 '%s' が設定されているデバイスは、他のデバイスで使用されているため、フォーマットできません
nl: Het apparaat met alias '%s' kan niet worden geformatteerd omdat deze wordt gebruikt door een ander apparaat
pt_br: Não é possível formatar o dispositivo com o álias '%s' porque ele é usado por outro dispositivo
ru: Устройство с псевдонимом „%s“ не может быть отформатировано, поскольку оно используется другим устройством
sv: Enheten med alias '%s' kan inte formateras eftersom den används av en annan enhet
tr: '%s' takma adlı aygıt biçimlendirilemiyor çünkü başka bir aygıt tarafından kullanılıyor
uk: Пристрій із псевдонімом «%s» не може бути відформатований, оскільки він використовується іншим пристроєм

source: The device with alias '%s' cannot be partitioned because it is used by other device
ca: El dispositiu amb l'àlies %s no es pot partir perquè l'usa un altre dispositiu.
cs: Na zařízení označeném jako '%s’ není možné upravit oddíly, protože je v současnosti využívá jiné zařízení
de: Das Gerät mit dem Alias ‚%s‘ kann nicht partitioniert werden, da es von einem anderen Gerät verwendet wird
es: El dispositivo con el alias %s no se puede particionar porque es usado por otro dispositivo
fi: Laitetta aliaksella ”%s” ei voi osioida koska se on toisen laitteen käytössä
fr: Le périphérique avec l'alias '%s' ne peut pas être partitionné, car il est utilisé par un autre périphérique
id: Perangkat dengan alias ‘%s’ tidak dapat dipartisi karena sedang digunakan oleh perangkat lain
it: Impossibile partizionare il dispositivo con alias '%s' perché è usato da un altro dispositivo
ja: 別名 '%s' が設定されているデバイスは、他のデバイスで使用されているため、パーティション設定できません
nl: Het apparaat met alias '%s' kan niet worden gepartitioneerd omdat deze wordt gebruikt door een ander apparaat
pt_br: Não é possível particionar o dispositivo com o álias '%s' porque ele é usado por outro dispositivo
ru: Устройство с псевдонимом „%s“ не может быть разбито на разделы, потому что оно используется другим устройством
sv: Enheten med alias '%s' kan inte partitioneras eftersom den används av en annan enhet
tr: '%s' takma adlı aygıt, başka bir aygıt tarafından kullanıldığı için bölümlenemez
uk: Пристрій із псевдонімом «%s» не може бути розбитий на розділи, тому що він використовується іншим пристроєм

source: The boot device cannot be automatically selected
ca: El dispositiu d'arrencada no es pot seleccionar automàticament.
cs: Nelze provést automatický výběr zaváděcího zařízení
de: Das Bootgerät kann nicht automatisch ausgewählt werden
es: El dispositivo de arranque no se puede seleccionar automáticamente
fi: Käynnistyslaitetta ei voi valita automaattisesti
fr: Le périphérique de démarrage ne peut pas être sélectionné automatiquement
id: Perangkat boot tidak dapat dipilih secara otomatis
it: Impossibile selezionare automaticamente il dispositivo di avvio
ja: 起動デバイスを自動選択できません
ka: ჩამტვირთავი მოწყობილობის ავტომატური შერჩევა შეუძლებელია
nl: Het opstart apparaat kan niet automatisch worden geselecteerd
pt_br: Não é possível selecionar automaticamente o dispositivo de inicialização
ru: Загрузочное устройство не может быть выбрано автоматически
sv: Uppstartsenheten kan inte väljas automatiskt
tr: Önyükleme aygıtı otomatik olarak seçilemez
uk: Пристрій завантаження не може бути обрано автоматично

source: There is no boot device with alias '%s'
ca: No hi ha cap dispositiu d'arrencada amb l'àlies %s.
cs: Neexistuje žádné zaváděcí zařízení s aliasem '%s'
de: Es gibt kein Bootgerät mit dem Alias ‚%s‘
es: No hay ningún dispositivo de arranque con el alias %s
fi: Käynnistyslaitetta aliaksella ”%s” ei ole
fr: Il n'existe pas de périphérique de démarrage portant l'alias '%s'
id: Tidak ada perangkat boot dengan alias '%s'
it: Nessun dispositivo di avvio con alias '%s'
ja: '%s' という別名の起動デバイスはありません
ka: არ არსებობს ჩამტვირთავი მოწყობილობა ფსევდონიმით '%s'
nl: Er is geen opstart apparaat met alias '%s'
pt_br: Não há um dispositivo de inicialização com o álias '%s'
ru: Не существует загрузочного устройства с псевдонимом '%s'
sv: Det finns ingen uppstartsenhet med alias '%s'
tr: '%s' takma adlı bir önyükleme aygıtı yok
uk: Не існує завантажувального пристрою з псевдонімом '%s'

source: No passphrase provided (required for using the method '%{crypt_method}').
ca: No s'ha proporcionat cap frase de contrasenya (cal per usar el mètode %{crypt_method}).
cs: Není uvedena žádná přístupová fráze (nutná pro použití metody '%{crypt_method}').
de: Keine Passphrase angegeben (erforderlich für die Verwendung der Methode '%{crypt_method}').
es: No se proporcionó ninguna contraseña (obligatoria para utilizar el método '%{crypt_method}').
fi: Salauslausetta ei ole annettu (vaaditaan salaustavalle ”%{crypt_method}”).
fr: Aucune phrase secrète fournie (nécessaire pour utiliser la méthode '%{crypt_method}').
id: Kata sandi tidak disediakan (diperlukan untuk menggunakan metode '%{crypt_method}').
it: Nessuna stringa di cifratura fornita (necessaria per utilizzare il metodo '%{crypt_method}').
ja: パスフレーズが設定されていません ('%{crypt_method}' 方式を使用する際には必須です) 。
ka: საკვანძო ფრაზა შეყვანილი არაა (აუცილებელია მეთოდისთვის '%{crypt_method}').
nl: Geen wachtwoordzin opgegeven (vereist bij gebruik van methode '%{crypt_method}').
pt_br: Nenhuma senha fornecida (necessária para usar o método '%{crypt_method}').
ru: Не указана парольная фраза (требуется для использования метода „%{crypt_method}“).
sv: Ingen lösenordsfras tillhandahålls (krävs för att använda %{crypt_method}') metoden.
tr: Parola sağlanmadı ('%{crypt_method}' metodunu kullanmak için gereklidir).
uk: Не вказано пароль (необхідно для використання методу '%{crypt_method}').

source: Encryption method '%{crypt_method}' is not available in this system.
ca: El mètode d'encriptació %{crypt_method} no està disponible en aquest sistema.
cs: Šifrovací metoda '%{crypt_method}' není v tomto systému k dispozici.
de: Die Verschlüsselungsmethode '%{crypt_method}' ist auf diesem System nicht verfügbar.
es: El método de cifrado '%{crypt_method}' no está disponible en este sistema.
fi: Salaustapa ”%{crypt_method}” ei ole saatavilla tälle järjestelmälle.
fr: La méthode de chiffrement '%{crypt_method}' n'est pas disponible sur ce système.
id: Metode enkripsi '%{crypt_method}' tidak tersedia di sistem ini.
it: Metodo di cifratura '%{crypt_method}' non disponibile nel sistema.
ja: このシステムでは '%{crypt_method}' 暗号化方式は利用できません。
ka: დაშიფვრის მეთოდი '%{crypt_method}' ამ სისტემაში ხელმისაწვდომი არაა.
nl: Encryptie methode '%{crypt_method}' is niet beschikbaar op dit systeem.
pt_br: O método de criptografia '%{crypt_method}' não está disponível neste sistema.
ru: Метод шифрования „%{crypt_method}“ недоступен в этой системе.
sv: Krypteringsmetod '%{crypt_method}' är inte tillgänglig i det här systemet.
tr: Bu sistemde '%{crypt_method}' şifreleme yöntemi mevcut değil.
uk: Метод шифрування '%{crypt_method}' недоступний у цій системі.

source: '%{crypt_method}' is not a suitable method to encrypt the device.
ca: El mètode %{crypt_method} no és un mètode adequat per encriptar el dispositiu.
cs: '%{crypt_method}' není vhodná metoda pro šifrování zařízení.
de: '%{crypt_method}' ist keine geeignete Methode zur Verschlüsselung des Geräts.
es: '%{crypt_method}' no es un método adecuado para cifrar el dispositivo.
fi: ”%{crypt_method}” ei ole tämän laitteen salaukseen sopiva salaustapa.
fr: '%{crypt_method}' n'est pas une méthode appropriée pour chiffrer le périphérique.
id: '%{crypt_method}' bukan metode yang cocok untuk mengenkripsi perangkat.
it: '%{crypt_method}' non è un metodo adatto per cifrare il dispositivo.
ja: '%{crypt_method}' はデバイスの暗号化方式として不適切です。
ka: '%{crypt_method}' მოწყობილობის დაშიფვრის შესაფერისი მეთოდი არაა.
nl: '%{crypt_method}' is een niet geschikte methode om het apparaat te versleutelen.
pt_br: '%{crypt_method}' não é um método adequado para criptografar o dispositivo.
ru: '%{crypt_method}' не является подходящим методом для шифрования устройства.
sv: '%{crypt_method}' är inte en lämplig metod för att kryptera enheten.
tr: '%{crypt_method}' cihazı şifrelemek için uygun bir yöntem değil.
uk: '%{crypt_method}' не є прийнятним методом для шифрування пристрою.

source: Missing file system type for '%s'
ca: Falta el tipus de sistema de fitxers per a %s
cs: Pro '%s' není uveden typ souborového systému
de: Fehlender Dateisystemtyp für ‚%s‘
es: Falta el tipo de sistema de archivos de '%s'
fi: Tiedostojärjestelmän tyyppi puuttuu kohteelle ”%s”
fr: Type de système de fichiers manquant pour '%s'
id: Tidak ada tipe sistem berkas untuk '%s'
it: Tipo di file system mancante per '%s'
ja: '%s' に対するファイルシステムの種類が設定されていません
ka: მიუთითებელი ფაილური სისტემის ტიპი '%s'-სთვის
nl: Ontbrekend bestandssysteem voor '%s'
pt_br: Tipo de sistema de arquivo ausente para '%s'
ru: Отсутствует тип файловой системы для '%s'
sv: Saknar filsystems typ för '%s'
tr: '%s' için eksik dosya sistemi türü
uk: Відсутній тип файлової системи для '%s'

source: The file system type '%{filesystem}' is not suitable for '%{path}'
ca: El tipus de sistema de fitxers %{filesystem} no és adequat per a %{path}
cs: Souborový systém '%{filesystem}' není vhodný pro '%{path}'
de: Der Dateisystemtyp ‚%{filesystem}‘ ist nicht geeignet für ‚%{path}‘
es: El tipo de sistema de archivos '%{filesystem}' no es adecuado para '%{path}'
fi: Tiedostojärjestelmän tyyppi ”%{filesystem}” ei ole sopiva kohteelle ”%{path}”
fr: Le type de système de fichiers '%{filesystem}' n'est pas adapté pour '%{path}'
id: Tipe sistem berkas '%{filesystem}' tidak cocok untuk '%{path}'
it: Il tipo di file system '%{filesystem}' non è adatto per '%{path}'
ja: ファイルシステムの種類 '%{filesystem}' は、 '%{path}' に対して不適切です
ka: ფაილური სისტემის ტიპი '%{filesystem}' შესაფერისი არაა '%{path}'-სთვის
nl: Het bestandssysteemtype '%{filesystem}' is niet geschikt voor '%{path}'
pt_br: O tipo de sistema de arquivo '%{filesystem}' não é adequado para '%{path}'
ru: Тип файловой системы „%{filesystem}“ не подходит для '%{path}'
sv: Filsystemstypen '%{filesystem}' är inte lämplig för '%{path}'
tr: '%{filesystem}' dosya sistemi türü '%{path}' için uygun değil
uk: Тип файлової системи '%{filesystem}' непридатний для '%{path}'

source: There is no LVM thin pool volume with alias '%s'
ca: No hi ha cap volum d'agrupació prima d'LVM amb l'àlies %s.
cs: Neexistuje žádný svazek LVM thin pool s aliasem '%s'
de: Es ist kein LVM Thin Pool-Volume mit dem Alias '%s' vorhanden
es: No hay ningún volumen de grupo ligero LVM con alias "%s"
fi: LVM-ohutvarantotaltiota aliaksella ”%s” ei ole
fr: Aucun volume de pool léger LVM ne porte l'alias '%s'
id: Tidak ada volume pool tipis LVM dengan alias '%s'
it: Nessun volume thin pool LVM con alias '%s'
ja: '%s' という別名の LVM Thin プールボリュームはありません
ka: ფსევდონიმით '%s' LVM თხელი პულის ტომი არ არსებობს
nl: Er is geen LVM thin pool volume met alias '%s'
pt_br: Não há volume de pool fino LVM com alias '%s'
ru: Не существует тома LVM thin pool с псевдонимом '%s'
sv: Det finns ingen LVM tunn poolvolym med alias '%s'
tr: '%s' takma adlı LVM ince havuz birimi yok
uk: Не існує тому тонкого пулу LVM з псевдонімом '%s'

source: There is no MD RAID member device with alias '%s'
ca: No hi ha cap dispositiu membre de la RAID MD amb l'àlies %s.
cs: Neexistuje žádné členské zařízení v MD RAIDu s aliasem '%s'
de: Es gibt kein MD RAID-Mitgliedsgerät mit dem Alias ‚%s‘
es: No hay ningún dispositivo de miembro de RAID MD con el alias %s
fi: MD RAID -jäsenlaitetta aliaksella ”%s” ei ole
fr: Aucun périphérique membre MD RAID ne porte l'alias '%s'
id: Tidak ada perangkat member MD RAID dengan alias '%s'
it: Nessun dispositivo membro RAID MD con alias '%s'
ja: '%s' という別名の MD RAID メンバーデバイスはありません
ka: MD RAID-ის წევრი მოწყობილობა ფსევდონიმით '%s' არ არსებობს
nl: Er is geen apparaat dat is lid is van een MD RAID met alias '%s'
pt_br: Não há um dispositivo de membro do MD RAID com o álias '%s'
ru: Не существует устройства-члена MD RAID с псевдонимом '%s'
sv: Det finns ingen MD RAID-medlemsenhet med alias '%s'
tr: '%s' takma adlı bir MD RAID üye aygıtı yok
uk: Не існує пристрою-члена MD RAID з псевдонімом '%s'

source: There is a MD RAID without level
ca: Hi ha una RAID MD sense nivell.
cs: Zařízení MD RAID bez úrovně
de: Es gibt ein MD RAID ohne Level
es: Hay un RAID MD sin nivel
fi: MD RAID ilman määritettyä tasoa havaittu
fr: Il existe un MD RAID sans niveau
id: Ada MD RAID tanpa tingkat
it: Esiste un RAID MD senza livello
ja: レベル指定のない MD RAID があります
ka: არსებობს MD RAID დონის გარეშე
nl: Er is een MD RAID zonder niveau
pt_br: Há um MD RAID sem nível
ru: Существует RAID-массив MD без уровня
sv: Det finns en MD RAID utan nivå
tr: Seviyesi olmayan bir MD RAID var
uk: Існує RAID-масив MD без рівня

source: At least %s devices are required for %s
ca: Calen almenys %s dispositius per a %s.
cs: Nejméně %s zařízení je zapotřebí pro %s
de: Mindestens %s Geräte sind für %s erforderlich
es: Se requieren al menos %s dispositivos para %s
fi: Ainakin %s laitetta vaaditaan kohteelle %s
fr: Au moins %s périphériques sont requis pour %s
id: Setidaknya %s perangkat diperlukan untuk %s
it: Sono richiesti almeno %s dispositivi per %s
ja: 少なくとも %s 個のデバイスが必要です (%s に対して)
ka: საჭიროა, სულ ცოტა, %s მოწყობილობა %s-სთვის
nl: Ten minste %s apparaten zijn benodigd voor %s
pt_br: Pelo menos %s dispositivos são necessários para %s
ru: Требуется не менее %s устр. для %s
sv: Minst %s enheter krävs för %s
tr: %s için en az %s cihaz gereklidir
uk: Потрібно не менше %s пристроїв для %s

source: The device '%{member}' cannot be deleted because it is part of the MD RAID %{md_raid}
ca: El dispositiu %{member} no es pot suprimir perquè forma part de la RAID MD %{md_raid}
cs: Zařízení '%{member}’ nelze smazat, protože je součástí MD RAID %{md_raid}
de: Das Gerät '%{member}' kann nicht gelöscht werden, da es Teil des MD-RAID '%{md_raid}' ist
es: El dispositivo %{member} no puede ser borrado porque es parte del RAID MD %{md_raid}
fi: Laitetta ”%{member}” ei voi poistaa koska se on osa MD_RAIDia %{md_raid}
fr: Le périphérique '%{member}' ne peut pas être supprimé, car il fait partie du MD RAID %{md_raid}
id: Perangkat ‘%{member}’ tidak dapat dihapus karena merupakan bagian dari MD RAID %{md_raid}
it: Impossibile eliminare il '%{member}' perché fa parte del RAID MD %{md_raid}
ja: デバイス '%{member}' は MD RAID %{md_raid} の一部であるため、削除できません
nl: Het apparaat '%{member}' kan niet worden verwijderd omdat het onderdeel is van MD RAID %{md_raid}
pt_br: Não é possível excluir o dispositivo '%{member}' porque ele faz parte do MD RAID %{md_raid}
ru: Устройство „%{member}“ не может быть удалено, поскольку оно является частью MD RAID %{md_raid}
sv: Enheten '%{member}' kan inte tas bort eftersom den är en del av MD RAID %{md_raid}
tr: '%{member}' aygıtı silinemez çünkü MD RAID %{md_raid}'in bir parçasıdır
uk: Пристрій «%{member}» не може бути видалений, оскільки він є частиною MD RAID %{md_raid}

source: The device '%{member}' cannot be resized because it is part of the MD RAID %{md_raid}
ca: No es pot canviar la mida del dispositiu %{member} perquè forma part de la RAID MD %{md_raid}
cs: Na zařízení '%{member}’ nelze upravit velikost, protože je součástí MD RAID %{md_raid}
de: Die Größe des Geräts '%{member}' kann nicht geändert werden, da es Teil des MD-RAID '%{md_raid}' ist
es: El dispositivo %{member} no puede ser redimensionado porque es parte del RAID MD %{md_raid}
fi: Laitteen ”%{member}” kokoa ei voi muuttaa koska se on osa MD_RAIDia %{md_raid}
fr: Le périphérique '%{member}' ne peut pas être redimensionné, car il fait partie du MD RAID %{md_raid}
id: Perangkat ‘%{member}’ tidak dapat diubah ukurannya karena merupakan bagian dari MD RAID %{md_raid}
it: Impossibile ridimensionare il dispositivo '%{member}' perché fa parte del RAID MD %{md_raid}
ja: デバイス '%{member}' は MD RAID %{md_raid} の一部であるため、サイズ変更できません
nl: Het apparaat '%{member} kan niet van grootte veranderen omdat deze deel is van MD RAID %{md_raid}
pt_br: Não é possível redimensionar o dispositivo '%{member}' porque ele faz parte do MD RAID %{md_raid}
ru: Размер устройства „%{member}“ не может быть изменен, поскольку оно является частью MD RAID %{md_raid}
sv: Enheten '%{member}' kan inte ändras i storlek eftersom det är en del av MD RAID %{md_raid}
tr: '%{member}' aygıtı MD RAID %{md_raid}'in bir parçası olduğu için yeniden boyutlandırılamaz
uk: Розмір пристрою «%{member}» не може бути змінений, тому що він є частиною MD RAID %{md_raid}

source: The device '%{member}' cannot be formatted because it is part of the MD RAID %{md_raid}
ca: El dispositiu %{member} no es pot formatar perquè forma part de la RAID MD %{md_raid}
cs: Zařízení '%{member}’ nelze naformátovat, protože je součástí MD RAID %{md_raid}
de: Das Gerät '%{member}' kann nicht formatiert werden, da es Teil des MD-RAID '%{md_raid}' ist
es: El dispositivo %{member} no se puede formatear porque es parte del RAID MD %{md_raid}
fi: Laitetta ”%{member}” ei voi alustaa koska se on osa MD_RAIDia %{md_raid}
fr: Le périphérique '%{member}' ne peut pas être formaté, car il fait partie du MD RAID %{md_raid}
id: Perangkat ‘%{member}’ tidak dapat diformat karena merupakan bagian dari MD RAID %{md_raid}
it: Impossibile formattare il dispositivo '%{member}' perché fa parte del RAID MD %{md_raid}
ja: デバイス '%{member}' は MD RAID %{md_raid} の一部であるため、フォーマットできません
nl: Het apparaat '%{member} kan niet worden geformateerd omdat het onderdeel is van MD RAID %{md_raid}
pt_br: Não é possível formatar o dispositivo '%{member}' porque ele faz parte do MD RAID %{md_raid}
ru: Устройство „%{member}“ не может быть отформатировано, поскольку оно является частью MD RAID %{md_raid}
sv: Enheten '%{member}' kan inte formateras eftersom den är en del av MD RAID %{md_raid}
tr: '%{member}' aygıtı biçimlendirilemiyor çünkü MD RAID %{md_raid}'in bir parçası
uk: Пристрій «%{member}» не може бути відформатований, оскільки він є частиною MD RAID %{md_raid}

source: The device '%{member}' cannot be partitioned because it is part of the MD RAID %{md_raid}
ca: El dispositiu %{member} no es pot partir perquè forma part de la RAID MD %{md_raid}
cs: Na zařízení '%{member}’ nelze upravit oddíly, protože je součástí MD RAID %{md_raid}
de: Das Gerät '%{member}' kann nicht partitioniert werden, da es Teil des MD-RAID '%{md_raid}' ist
es: El dispositivo '%{member}' no puede ser particionado porque es un parte de dispositivo del RAID MD %{md_raid}
fi: Laitetta ”%{member}” ei voi osioida koska se on osa MD_RAIDia %{md_raid}
fr: Le périphérique '%{member}' ne peut pas être partitionné, car il fait partie du MD RAID %{md_raid}
id: Perangkat ‘%{member}’ tidak dapat dipartisi karena merupakan bagian dari MD RAID %{md_raid}
it: Impossibile partizionare il dispositivo '%{member}' perché fa parte del RAID MD %{md_raid}
ja: デバイス '%{member}' は MD RAID %{md_raid} の一部であるため、パーティション設定できません
nl: Het apparaat '%{member}' kan niet worden gepartitioneerd omdat het onderdeel is van MD RAID %{md_raid}
pt_br: Não é possível particionar o dispositivo '%{member}' porque ele faz parte do MD RAID %{md_raid}
ru: Устройство „%{member}“ не может быть разбито на разделы, поскольку оно является частью MD RAID %{md_raid}
sv: Enheten '%{member}' kan inte partitioneras eftersom den är en del av MD RAID %{md_raid}
tr: '%{member}' aygıtı, MD RAID %{md_raid}'in bir parçası olduğu için bölümlenemiyor
uk: Пристрій «%{member}» не може бути розбитий на розділи, тому що він є частиною MD RAID %{md_raid}

source: The device '%{member}' cannot be used because it is part of the MD RAID %{md_raid}
ca: El dispositiu %{member} no es pot usar perquè forma part de la RAID MD %{md_raid}
cs: Zařízení '%{member}’ není možné použít, protože je součástí MD RAID %{md_raid}
de: Das Gerät '%{member}' kann nicht verwendet werden, da es Teil des MD-RAID '%{md_raid}' ist
es: El dispositivo '%{member}' no se puede usar porque es parte del RAID MD %{md_raid}
fi: Laitetta ”%{member}” ei voi käyttää koska se on osa MD_RAIDia %{md_raid}
fr: Le périphérique '%{member}' ne peut pas être utilisé, car il fait partie du MD RAID %{md_raid}
id: Perangkat ‘%{member}’ tidak dapat digunakan karena merupakan bagian dari MD RAID %{md_raid}
it: Impossibile usare il dispositivo '%{member}' perché fa parte del RAID MD %{md_raid}
ja: デバイス '%{member}' は MD RAID %{md_raid} の一部であるため、使用できません
nl: Het apparaat '%{member}' kan niet worden gebruikt omdat het onderdeel is van MD RAID %{md_raid}
pt_br: Não é possível usar o dispositivo '%{member}' porque ele faz parte do MD RAID %{md_raid}
ru: Устройство „%{member}“ не может быть использовано, поскольку оно является частью MD RAID %{md_raid}
sv: Enheten '%{member}' kan inte användas eftersom den är en del av MD RAID %{md_raid}
tr: '%{member}' aygıtı, MD RAID %{md_raid}'in bir parçası olduğu için kullanılamaz
uk: Пристрій «%{member}» не може бути використаний, оскільки він є частиною MD RAID %{md_raid}
