Repository: agama-project/agama
Catalog: rust/po/*.po
Languages: de, id

source: No
de: Nein
id: Tidak

source: Yes
de: Ja
id: Ya

source: Prepare the system
de: System vorbereiten
id: Siapkan sistem

source: Install software
de: Software installieren
id: Instal perangkat lunak

source: Configure the system
de: System konfigurieren
id: Konfigurasikan sistem

source: Storing security settings
de: Sicherheitseinstellungen speichern
id: Menyimpan pengaturan keamanan

source: Setting up the hostname
de: Hostname einrichten
id: Menyiapkan nama host

source: Setting up the network proxy
de: Netzwerkproxy einrichten
id: Menyiapkan proksi jaringan

source: Importing user files
de: Benutzerdateien importieren
id: Mengimpor berkas pengguna

source: Running user pre-installation scripts
de: Ausführen von Benutzer-Skripten vor der Installation
id: Menjalankan skrip pra-instalasi pengguna

source: Storing questions settings
de: Frageeinstellungen speichern
id: Menyimpan pengaturan pertanyaan

source: Storing localization settings
de: Lokalisierungseinstellungen speichern
id: Menyimpan pengaturan lokalisasi

source: Storing users settings
de: Benutzereinstellungen speichern
id: Menyimpan pengaturan pengguna

source: Configuring iSCSI devices
de: iSCSI-Geräte konfigurieren
id: Mengonfigurasi perangkat iSCSI

source: Configuring DASD devices
de: DASD-Geräte konfigurieren

source: Setting up the network
de: Netzwerk einrichten
id: Menyiapkan jaringan

source: Preparing the software proposal
de: Software-Vorschlag vorbereiten
id: Menyiapkan usulan perangkat lunak

source: Preparing the storage proposal
de: Speicherungsvorschlag vorbereiten
id: Menyiapkan usulan penyimpanan

source: Storing bootloader settings
de: Bootloader-Einstellungen speichern
id: Menyimpan pengaturan bootloader

source: Writing configuration
de: Konfiguration schreiben
id: Menulis konfigurasi

source: Reading configuration
de: Konfiguration lesen
id: Membaca konfigurasi

source: Reject
de: Ablehnen
id: Tolak

source: Trust
de: Vertrauen
id: Percayai

source: Trying to import a self-signed certificate. Do you want to trust it and register the product?
de: Es wird versucht, ein selbstsigniertes Zertifikat zu importieren. Möchten Sie diesem Zertifikat vertrauen und das Produkt registrieren?
id: Mencoba mengimpor sertifikat yang ditandatangani sendiri. Apakah Anda ingin mempercayainya dan mendaftarkan produk?

source: Ignore
de: Ignorieren
id: Abaikan

source: Retry
de: Wiederholen
id: Coba lagi

source: There was a problem running a package script.
de: Es gab ein Problem bei der Ausführung eines Paketskripts.
id: Terjadi masalah saat menjalankan skrip paket.

source: Continue
de: Fortsetzen
id: Lanjutkan

source: The key {0} ({1}) with fingerprint {2} is unknown. Do you want to trust this key?
de: Der Schlüssel {0} ({1}) mit dem Fingerabdruck {2} ist unbekannt. Möchten Sie diesem Schlüssel vertrauen?
id: Kunci {0} ({1}) dengan sidik jari {2} tidak dikenal. Apakah Anda ingin mempercayai kunci ini?

source: Skip
de: Überspringen
id: Lewati

source: Updating the list of repositories
de: Liste der Repositorien wird aktualisiert
id: Memperbarui daftar repositori

source: Refreshing metadata from the repositories
de: Metadaten aus den Repositorien wird aktualisiert
id: Menyegarkan metadata dari repositori

source: Calculating the software proposal
de: Software-Vorschlag wird berechnet
id: Menghitung usulan perangkat lunak

source: Registering the system
de: System wird registriert
id: Mendaftarkan sistem

source: The product must be registered
de: Das Produkt muss registriert werden
id: Produk harus didaftarkan

source: Defining a user, setting the root password or a SSH public key is required
de: Die Definition eines Benutzers, das Festlegen des Root-Passworts oder eines öffentlichen SSH-Schlüssels ist erforderlich
id: Diperlukan penetapan pengguna, pengaturan kata sandi root, atau kunci publik SSH

source: First user information is incomplete
de: Die Informationen zum ersten Benutzer sind unvollständig
id: Informasi pengguna pertama tidak lengkap
